{
  "fields": [
    "average_volume",
    "basic_eps_net_income",
    "beta_1_year",
    "business_description",
    "cash_ratio",
    "conversion_rate",
    "country",
    "currency",
    "current_ratio",
    "debt_to_equity",
    "dividends_paid",
    "earnings_per_share_basic_ttm",
    "earnings_per_share_diluted_ttm",
    "ebitda",
    "free_cash_flow",
    "fundamental_currency_code",
    "goodwill",
    "gross_margin",
    "gross_margin_percent_ttm",
    "gross_profit",
    "industry",
    "last_annual_eps",
    "last_annual_revenue",
    "market_cap_basic",
    "net_debt",
    "net_income",
    "number_of_employees",
    "number_of_shareholders",
    "operating_margin",
    "pre_tax_margin",
    "price_52_week_high",
    "price_52_week_low",
    "price_book_fq",
    "price_earnings_ttm",
    "price_free_cash_flow_ttm",
    "price_percent_change_1_week",
    "price_percent_change_52_week",
    "price_revenue_ttm",
    "quick_ratio",
    "return_of_invested_capital_percent_ttm",
    "return_on_assets",
    "return_on_equity",
    "return_on_invested_capital",
    "revenue_per_employee",
    "sector",
    "symbol",
    "total_assets",
    "total_current_assets",
    "total_debt",
    "total_revenue",
    "total_shares_outstanding",
    "total_shares_outstanding_fundamental",
    "web_site_url"
  ],
  "symbols": [
    {
      "f": [
        479610,
        -5.12139,
        0.31608,
        "Adveo Group International SA is a Spain-based company engaged, together with its subsidiaries, in the paper industry. Its activities include the production and distribution of paper bags, envelopes and stationary products, as well as office equipment and supplies, among others. The Company operates three production centers located in Madrid, Logrono and Adune. In addition, it is a parent of a group which comprises such controlled entities as Unipapel Transformacion y Distribucion SAU, Monte Urgull SLU, Adimpo SAU, Spicers Deutschland GmbH, Spicers Belgium NV, Spicers France SAS and Spicers Administracion y Servicios SL, among others. In March 2014, the Company's subsidiary, Adveo Espana SA sold industrial unit to Unipapel SLU.",
        -4.19351,
        0.94038,
        "Spain",
        "EUR",
        0.58502,
        325.4099,
        -1.81e+06,
        -5.44805,
        -5.44805,
        -2.6416e+07,
        1.7825e+07,
        "EUR",
        8.7208e+07,
        0.16604939999999999,
        0.16604939999999999,
        1.45343e+08,
        "Office Equipment Wholesale",
        -5.12139,
        null,
        7.412189e+07,
        null,
        -7.0638e+07,
        1268,
        null,
        -0.0486615,
        -0.0771718,
        6.40758,
        2.78,
        0.73805,
        null,
        null,
        -3.88889,
        -35.9466,
        0.08907,
        0.30856,
        -0.38773820000000003,
        -0.1532269,
        -0.667663,
        -0.38773820000000003,
        656274.4,
        "Technology",
        "BME:ADV",
        4.13858e+08,
        1.88347e+08,
        2.074e+08,
        9.01587e+08,
        1.359525e+07,
        1.359525e+07,
        "http://www.adveo.com/en/home"
      ],
      "s": "BME:ADV"
    },
    {
      "f": [
        313380,
        -0.22032,
        0.13572,
        "Eurona Wireless Telecom SA is a Spain-based company primarily engaged in the telecommunications sector. The Company's activities are divided into two segments: Eurona Telecom and Eurona Hotspots. The Eurona Telecom division focuses on providing Internet access in rural and urban areas through Wi-Max, LTE and Satellite technologies. It offers services to individuals, business customers and institutions in Spain, the United Kingdom, Ireland, Italy, Chile and the United States, among others. The Eurona Hotspots segment operates KubiWireless brand name, which manages a hotspot network with multiple Internet connections in closed, temporary and transitory spaces, such as hotels, restaurants, airports, exhibition centers and shopping centers. In addition, the Company provides engineering services, including design, deployment and operation of optic fiber networks, marketing platform for Internet advertisers, as well as develops Internet access projects.",
        0.04892,
        0.94038,
        "Spain",
        "EUR",
        0.70467,
        239.309,
        null,
        -0.34387,
        -0.34387,
        3.58948e+09,
        -1.241899e+07,
        "EUR",
        3.66633e+06,
        0.6258008,
        0.6258008,
        1.57648e+07,
        "Wi-Fi \u0026 Wi-Max Providers",
        -0.22032,
        null,
        8.270339e+07,
        null,
        -8.87203e+06,
        57,
        null,
        -0.2859695,
        -0.37089170000000005,
        3.13,
        2.26,
        4.51858,
        null,
        0.02307,
        13.70968,
        -6,
        3.00101,
        0.69895,
        -0.2101407,
        -0.1520205,
        -0.3287411,
        -0.2101407,
        null,
        "Services",
        "BME:EWT",
        7.054595e+07,
        1.691167e+07,
        4.38006e+07,
        2.509477e+07,
        2.932745e+07,
        2.932745e+07,
        "http://www.eurona.com"
      ],
      "s": "BME:EWT"
    },
    {
      "f": [
        2.98867e+06,
        3.6504,
        1.03346,
        "Acciona SA is a Spain-based holding company primarily engaged in the renewable utilities sector. The Company's activities are divided into five business segments: Energy, responsible for the renewable energy production, distribution and commercialization, as well as construction of wind farms; Infrastructure Construction, including construction and engineering activities, as well as transport and hospital concessions; Water, offering construction of desalination and water treatments plants, drinking water stations, as well as management of water cycle process; Service, providing facility services, airport handling services, waste collection and treatment, as well as logistics services, among others, and Other Activities, including fund management, stock brokerage, wine production, activities related to Acciona Trasmediterranes business and other investments. The Company operates worldwide through numerous subsidiaries.",
        13.22173,
        0.94038,
        "Spain",
        "EUR",
        0.92047,
        189.6318,
        -1.26334e+08,
        7.00929,
        6.01952,
        1.019656e+09,
        3.505e+08,
        "EUR",
        7.9e+07,
        0.7270597,
        0.7270597,
        4.710528e+09,
        "Renewable Utilities",
        3.62654,
        null,
        3.903384e+09,
        null,
        2.07324e+08,
        32211,
        null,
        0.1556651,
        0.0598669,
        80.45,
        60.71,
        1.01496,
        11.32482,
        3.9574,
        6.64894,
        -8.99746,
        0.65914,
        0.78835,
        0.0347539,
        0.0240151,
        0.1072194,
        0.0347539,
        184213.7,
        "Utilities",
        "BME:ANA",
        1.7333e+10,
        5.023e+09,
        7.261e+09,
        6.543524e+09,
        5.70089e+07,
        5.70089e+07,
        "http://www.acciona.com"
      ],
      "s": "BME:ANA"
    },
    {
      "f": [
        1.00787e+07,
        -0.12278,
        0.40235,
        "Dogi International Fabrics SA is a Spain-based company primarily engaged in the textile industry. The Company specializes in the production and sale of elastic fabrics, as well as in the knitting and dyeing of textile fibers. Its facilities comprise production plants in Spain, China and the United States. The Company’s product lines include fabrics for lingerie, swimwear and sportswear, which are marketed under such brand names as Cristal, Dazzling, Sari, Liquid, Winn, Cooper and Invisible, among others. In addition, it sells its fabrics to such companies as Victoria Secret, Sara Lee, Vanity Fair, M\u0026S and Triumph, among others. The Company is a parent Grupo Dogi, a group which comprises such a number of controlled entities as Penn Philippines Export Inc, Dogi Hong Kong Ltd, EFA Inc and Textiles Ata SA de CV, among others. The main shareholder of the Company is Businessgate SL, a unit of Sherpa Capital SL. It operates through Generos de Punto Treiss.",
        -0.09332,
        0.94038,
        "Spain",
        "EUR",
        1.18703,
        554.4763,
        null,
        -0.10721,
        -0.10721,
        -1.5684e+06,
        -4.66382e+06,
        "EUR",
        0,
        0.4621628,
        0.4621628,
        1.92336e+07,
        "Synthetic Fabrics",
        -0.12278,
        null,
        3.240201e+08,
        null,
        -8.4728e+06,
        319,
        null,
        -0.1790232,
        -0.2011205,
        5.474,
        0.64,
        117.2015,
        null,
        null,
        18.42105,
        417.83659,
        8.18189,
        0.61771,
        -0.5923924,
        -0.2739279,
        -1.836524,
        -0.5923924,
        null,
        "Consumer Cyclical",
        "BME:DGI",
        2.5092e+07,
        1.8475e+07,
        1.5298e+07,
        4.101013e+07,
        7.185755e+07,
        7.185755e+07,
        "http://www.dogi.es/"
      ],
      "s": "BME:DGI"
    },
    {
      "f": [
        330580,
        -1.21479,
        0.87458,
        "Cementos Portland Valderrivas SA is a Spain-based company principally engaged in the construction material industry. The Company produces cement, ready-mix concrete, aggregates, mortar and other building materials in Spain, the United States and Tunisia. The Company markets its production in Western-Europe, North-America and Africa. It is involved in the exploitation of quarries and mineral deposits, as well as in the provision of cement, concrete, gypsum, lime and prefabricated products. The Company is also engaged in the development of safe methods for recovering waste and using waste as fuel. In addition, the Company is a parent of Grupo Cementos Portland Valderrivas, a Madrid-based group composed of such entities as Hormigones de la Jacetania SA, Uniland International BV and Societe des Ciments d’Enfidha, among others.",
        0.18781,
        0.94038,
        "Spain",
        "EUR",
        1.92439,
        444.6694,
        -2.374e+06,
        null,
        null,
        null,
        7.1187e+07,
        "EUR",
        7.36708e+08,
        null,
        null,
        4.07392e+08,
        "Cement \u0026 Concrete Manufacturing",
        -1.21479,
        null,
        3.164162e+08,
        null,
        -6.197e+07,
        1661,
        null,
        null,
        null,
        6.59,
        3.84,
        0.98458,
        null,
        null,
        -0.65041,
        60.78947,
        null,
        1.13566,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:CPL",
        2.318619e+09,
        2.6241899999999997e+08,
        1.429522e+09,
        5.8041e+08,
        5.09372e+07,
        5.09372e+07,
        "http://www.valderrivas.es"
      ],
      "s": "BME:CPL"
    },
    {
      "f": [
        2.088033e+07,
        0.20411,
        null,
        "Cellnex Telecom SA is a Spain-based company engaged in the wireless telecommunications (telecom) business. Its activities are divided into three segments: Broadcasting infrastructure, Telecom site rental, as well as Network services and other. The Broadcasting infrastructure division comprises distribution and transmission of television (TV) and frequency modulation (FM) radio signals, operation and maintenance (O\u0026M) of radio broadcasting network, as well as over-the-top (OTT) radio services, among others. The Telecom site rental division provides access to wireless infrastructure, primarily through infrastructure hosting and telecom equipment co-location, mainly for mobile network operators and other wireless and broadband telecom network operators. The Network services and other division offers connectivity services for a variety of telecom operators and radio communication, among others.",
        0.87173,
        0.94038,
        "Spain",
        "EUR",
        2.655,
        247.5,
        null,
        null,
        null,
        null,
        9.7425e+07,
        "EUR",
        2.27637e+08,
        null,
        null,
        null,
        "Wireless Telecom",
        0.20411,
        null,
        3.162476e+09,
        null,
        4.729e+07,
        1255,
        null,
        null,
        null,
        17.5,
        12.55,
        5.64728,
        null,
        null,
        1.82768,
        -15.89649,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:CLNX",
        2.1411019999999998e+09,
        3.65539e+08,
        1.075453e+09,
        5.75365e+08,
        2.3154024e+08,
        2.3154024e+08,
        "https://www.cellnextelecom.com"
      ],
      "s": "BME:CLNX"
    },
    {
      "f": [
        316300,
        0.29168,
        0.80046,
        "Azkoyen SA is a Spain-based company primarily engaged in the manufacture of vending machines. The Company’s activities are divided into three business segments: Vending Machines, which focuses on the production and sale of vending machines for tobacco, coffee, cold and hot drinks, as well as snacks; Payment Systems, which is responsible for the design, manufacture and marketing of solutions for cash management, connectivity and cashless systems, such as automatic coin selection, counting and returning, as well as credit card readers, and Technology and Security Systems, which offers software and hardware for access control and time recording. The Company distributes products under various brand names, such as Azkoyen, Coffetek, Azkoyen Payment Technologies, Coges and Cashlogy, as well as primion. It operates numerous subsidiaries in Europe and Latin America.",
        0.48076,
        0.94038,
        "Spain",
        "EUR",
        1.54892,
        20.273,
        -1e+06,
        0.40267,
        0.40267,
        2.0246e+07,
        1.2247e+07,
        "EUR",
        5.0376e+07,
        0.4799731,
        0.4799731,
        5.9985e+07,
        "Automatic Vending Machines",
        0.29168,
        null,
        1.331919e+08,
        null,
        7.087e+06,
        755,
        null,
        0.1133102,
        0.1027382,
        5.88,
        3.62,
        1.45227,
        13.12489,
        9.03118,
        -5.625,
        39.81481,
        0.99512,
        1.14535,
        0.0922423,
        0.0657605,
        0.1150963,
        0.0922423,
        180627.5,
        "Capital Goods",
        "BME:AZK",
        1.51486e+08,
        6.5592e+07,
        1.7986e+07,
        1.26797e+08,
        2.437919e+07,
        2.437919e+07,
        "http://www.azkoyen.com/"
      ],
      "s": "BME:AZK"
    },
    {
      "f": [
        254020.00000000003,
        0.77691,
        0.32638,
        "Elecnor SA is a Spain-based company primarily engaged in the construction sector. The Company’s activities are divided into two business segments: Infrastructure and Real estate. The Infrastructure division is responsible for the development, construction, engineering, promotion and administration of projects in the energy, telecommunications, transport and environmental sector, among others. The Real estate division focuses on operating concessions in the area related to energy generation, mainly from wind and solar sources, energy and gas transmission, as well as wastewater treatment. The Company is a parent of the Elecnor Group, a group, which comprises a number of entities with operations established in Europe, the Americas, Asia and Africa. The Company is a subsidiary of Cantiles XXI SL.",
        1.86827,
        0.94038,
        "Spain",
        "EUR",
        0.92457,
        323.9941,
        -2.2425e+07,
        0.79296,
        0.79296,
        2.26589e+08,
        4.0003e+07,
        "EUR",
        3.3276000000000004e+07,
        0.5106563,
        0.5106563,
        6.21956e+08,
        "Construction \u0026 Engineering - NEC",
        0.77691,
        null,
        7.83e+08,
        null,
        6.566200000000001e+07,
        12903,
        null,
        0.07029869999999999,
        0.0620812,
        9.17,
        6.1,
        1.66767,
        11.34988,
        4.46767,
        2.62258,
        7.14286,
        0.40325,
        0.91523,
        0.0485682,
        0.0240502,
        0.1425741,
        0.0485682,
        154202.3,
        "Capital Goods",
        "BME:ENO",
        3.710879e+09,
        1.404545e+09,
        1.477815e+09,
        1.881143e+09,
        8.451816e+07,
        8.451816e+07,
        "http://www.elecnor.es"
      ],
      "s": "BME:ENO"
    },
    {
      "f": [
        1.903048e+07,
        1.72854,
        0.50228,
        "Enagas SA is a Spain-based company primarily engaged in the gas transportation. The Company's activities are divided into three business segments: Infrastructure, Technical management and Unregulated activities. The Infrastructure division is structured into three areas: Gas transport, which offers gas transmission through pipelines network; Regasification, which transforms liquefied natural gas (LNG) into gas form and stores it in cryogenic tanks, and Storage, which operates underground natural gas storage facilities. The Technical management division focuses on coordinating the access, storage, transportation and distribution process, maintaining gas infrastructure and ensuring the continuity and security of gas supply. The Unregulated activities division includes deregulated operations and transactions. The Company is present in a number of countries, such as Spain, Sweden, Greece, Albania, Italy, Mexico, Chile and Peru.",
        2.94666,
        0.94038,
        "Spain",
        "EUR",
        1.57503,
        211.7361,
        -3.13097e+08,
        1.74832,
        1.74832,
        8.58881e+08,
        1.92763e+08,
        "EUR",
        2.58e+07,
        null,
        null,
        null,
        "Oil \u0026 Gas Transportation Services - NEC",
        1.72854,
        null,
        5.848989e+09,
        null,
        4.12662e+08,
        1344,
        null,
        0.4917687,
        0.46518479999999995,
        27.91,
        22.58,
        2.347,
        14.01345,
        8.68324,
        3.52842,
        -10.02571,
        5.02662,
        1.54966,
        0.056195300000000004,
        0.0508035,
        0.17119879999999998,
        0.056195300000000004,
        870308.1,
        "Utilities",
        "BME:ENG",
        8.6319e+09,
        1.1608e+09,
        5.2699e+09,
        1.196366e+09,
        2.3842662e+08,
        2.3842662e+08,
        "http://www.enagas.es"
      ],
      "s": "BME:ENG"
    },
    {
      "f": [
        135460,
        0.87174,
        0.53668,
        "Adolfo Dominguez SA is a Spain-based company primarily engaged in the textile industry. The Company’s activities include the design, confection, marketing and distribution of apparel and accessories for men, women and children, as well as in the retail of home furnishings, which are distributed under the Adolfo Dominguez, AD+, Linea U, Mi Casa and ADC brands. The Company is a parent of Grupo Adolfo Dominguez, a group which comprises a number of controlled entities with operations established in such countries as Argentina, Belgium, China, Panama, Mexico, the United States, France, Israel, Japan, Peru, Portugal, the United Kingdom and Germany, among others. ",
        1.48882,
        0.94038,
        "Spain",
        "EUR",
        2.33002,
        0.86558,
        null,
        0.85575,
        0.85575,
        -1.960355e+07,
        -1.701213e+07,
        "EUR",
        null,
        0.5065249000000001,
        0.5065249000000001,
        5.777893e+07,
        "Apparel \u0026 Accessories - NEC",
        0.87174,
        null,
        3.033287e+07,
        null,
        7.9736e+06,
        1401,
        null,
        0.1124258,
        0.1033403,
        4.45,
        3.03,
        0.43154,
        3.82121,
        2.57223,
        0.61538,
        -10.41096,
        0.28053,
        0.98435,
        0.10317660000000001,
        0.0751654,
        0.11859299999999999,
        0.10317660000000001,
        76200.34,
        "Consumer Cyclical",
        "BME:ADZ",
        9.574806e+07,
        5.32922e+07,
        608410,
        1.0840559e+08,
        9.27611e+06,
        9.27611e+06,
        "http://www.adolfodominguez.com/"
      ],
      "s": "BME:ADZ"
    },
    {
      "f": [
        1.0050399999999999e+06,
        1.1972,
        0.21708,
        "Construcciones y Auxiliar de Ferrocarriles SA (CAF) is a Spain-based company engaged in the rolling stock manufacture. The Company’s activities are divided into two business segments: Rolling stock, as well as Components and spare parts. The Rolling stock division focuses on the design, production and distribution of rolling stock and equipment for railway systems, such as high-speed vehicles, locomotives, trains for middle-distance transportation, commuter trains and electric motorcars, subway trains, streetcars, traction and signaling systems, as well as energy storage solutions. The Components and spare parts division offers elements and spare parts for rolling stock equipment, such as wheels, axles and gear units. In addition, the Company offers technical assistance, maintenance and after-sale services, as well as development of rail infrastructure, among others. It operates through numerous subsidiaries in Spain, France, Germany, the United States, Brazil and Mexico, among others.",
        2.39548,
        0.94038,
        "Spain",
        "EUR",
        1.38666,
        103.5347,
        -2.1221e+07,
        0.69173,
        0.69173,
        1.36025e+08,
        5.5083e+07,
        "EUR",
        15000,
        0.5568625,
        0.5568625,
        5.2835299999999994e+08,
        "Locomotive Engines \u0026 Rolling Stock",
        1.1972,
        null,
        1.218681e+09,
        null,
        4.1041e+07,
        7424,
        null,
        0.0824718,
        0.031890299999999996,
        36.85,
        20.66,
        1.64973,
        51.39288,
        19.72901,
        -0.14045,
        41.88785,
        0.97071,
        1.32672,
        0.0145162,
        0.0081639,
        0.0321246,
        0.0145162,
        161059.5,
        "Transportation",
        "BME:CAF",
        3.099578e+09,
        2.021232e+09,
        7.64827e+08,
        1.283591e+09,
        3.428075e+07,
        3.428075e+07,
        "http://www.caf.net/"
      ],
      "s": "BME:CAF"
    },
    {
      "f": [
        296810,
        4.62855,
        0.76161,
        "Corporacion Financiera Alba SA is a Spain-based holding company engaged in the real estate sector. The Company's business is based on the rent operation of buildings. The Company's business is structured in three segments: Construction, Industrial Services and Environment. The Company’s main activities include the acquisition, management and exploitation of non-residential and commercial properties. The Company is also active in the provision of venture capital investments. The Company owns such subsidiaries as Alba Participaciones SA, Arta Capital Sociedad Gestora de Entidades de Capital Riesgo SA and Deya Capital SCR. The Company is part of the March Group which includes also Banca March and the Foundation Juan March. The Company's activities are focused on the cities of Madrid and Barcelona, which are its office markets in Spain.",
        4.65281,
        0.94038,
        "Spain",
        "EUR",
        23.24476,
        4.21681,
        -5.824e+07,
        4.56604,
        4.56604,
        -3.526e+06,
        -1.35626e+08,
        "EUR",
        null,
        null,
        null,
        null,
        "Real Estate Development \u0026 Operations - NEC",
        4.62855,
        null,
        2.49524e+09,
        null,
        2.69567e+08,
        58,
        null,
        7.814312999999999,
        14.46106,
        43.2,
        30.59,
        0.72716,
        9.37355,
        9.2629,
        5.23728,
        13.07794,
        133.7572,
        null,
        0.0769229,
        0.0766954,
        0.078831,
        0.0769229,
        345463,
        "Services",
        "BME:ALB",
        3.612e+09,
        3.324e+08,
        1.447e+08,
        1.5755e+07,
        5.83e+07,
        5.83e+07,
        "http://www.corporacionalba.es"
      ],
      "s": "BME:ALB"
    },
    {
      "f": [
        135650,
        2.4042,
        0.18476,
        "Nmas1 Dinamia SA, formerly Dinamia Capital Privado Sociedad de Capital Riesgo SA, is a Spain-based company engaged in the investment management operations. The Company's activities are divided into three business areas: Investment Banking, Asset Management and Investment Business. The Investment Banking division comprises two departments: Corporate Finance, providing merger and acquisition, capital markets, as well as debt and portfolio advisory; and Equities, offering financial research and brokerage services. The Asset Management area includes promotion, development and management of investment products. The Investment Business segment is involved in the direct investment in entities, as well as in management services of the Company. Its investment portfolio comprises Teltronic, Secuoya, High Tech Hoteles \u0026 Resorts, Alcad and Probos, among others. The Company operates in a number of European countries, such as Spain, France and Switzerland, as well as in the United States.",
        2.4744,
        0.94038,
        "Spain",
        "EUR",
        5.68924,
        1.36843,
        -2.3396e+07,
        7.01916,
        7.01916,
        6.670399999999999e+07,
        3.038e+06,
        "EUR",
        null,
        null,
        null,
        null,
        "Investment Management \u0026 Fund Operators - NEC",
        2.4042,
        null,
        2.703716e+08,
        null,
        6.568600000000001e+07,
        250,
        null,
        0.9766515,
        1.036302,
        8.48,
        6.52,
        1.50693,
        1.14401,
        4.07622,
        1.00629,
        8.51351,
        4.02087,
        null,
        0.3534219,
        0.3082323,
        0.3630236,
        0.3534219,
        334537.3,
        "Financial",
        "BME:ALNT",
        2.22918e+08,
        1.24987e+08,
        2.444e+06,
        6.529300000000001e+07,
        3.3516240000000004e+07,
        3.3516240000000004e+07,
        "http://www.alantra.com"
      ],
      "s": "BME:ALNT"
    },
    {
      "f": [
        9.51957e+06,
        0.06352,
        1.38614,
        "Ercros SA is a Spain-based company engaged, together with its subsidiaries, in the chemical industry. The Company’s products are structured into three business lines: Businesses Associated to Chlorine, which comprises the production of chlorine, ethyl acetate, caustic soda, sodium hypochlorite, dichloroethane, chloromethane, sodium chlorate and caustic potash, polyvinyl chloride (PCV), as well as water disinfectants; Intermediate Chemicals, which produces formaldehyde, glues and resins for the fiberboard and plywood industries, and Pharmaceuticals, which comprises raw material and intermediate products used in the pharmaceutical industry. The Company owns such subsidiaries as Marcoating SLU, Gades Ltd and Ercekol AIE, among others. In April 2014, it sold Fosfatos de Cartagena SLU to Timab Iberica.",
        0.23783,
        0.94038,
        "Spain",
        "EUR",
        1.04965,
        72.59445,
        -430000,
        0.18673,
        0.18673,
        4.848e+07,
        4.42e+06,
        "EUR",
        null,
        0.5392675,
        0.5392675,
        3.1972e+08,
        "Commodity Chemicals - NEC",
        0.06352,
        null,
        2.122008e+08,
        null,
        7.24e+06,
        1353,
        null,
        0.0472647,
        0.036329799999999995,
        2.405,
        0.442,
        1.08782,
        9.96091,
        5.19463,
        -1.74326,
        186.15385,
        0.34633,
        0.81796,
        0.0741256,
        0.0396093,
        0.1154814,
        0.0741256,
        454877.5,
        "Basic Materials",
        "BME:ECR",
        5.3858e+08,
        2.5094e+08,
        1.4161e+08,
        6.1827e+08,
        1.1408647e+08,
        1.1408647e+08,
        "http://www.ercros.es"
      ],
      "s": "BME:ECR"
    },
    {
      "f": [
        1370,
        0.02599,
        0.10415,
        "Grino Ecologic SA is a Spain-based holding company engaged in the renewable energy business sector. The Company, through three business divisions, Environment, Energy and Construction, focuses the core activity in the waste management and treatment in order to obtain environmental services and green energy. The Environment sector is active in the research of possible reuses and new applications of recoverable materials; the Energy area covers the development of projects for generating energy through energy recovery plants from waste and biomass, and synthetic diesel production; and the Construction sector provides solutions to all the needs, both those of private companies in the environmental industry and of public administrations. As of December 31, 2012, Corporacio Grino SL had 88.28% of interest in the Company's shareholdings.",
        0.1041,
        0.94038,
        "Spain",
        "EUR",
        1.18632,
        50.41708,
        null,
        0.00743,
        0.00743,
        4.36791e+06,
        2.69734e+06,
        "EUR",
        1.907059e+07,
        0.6426927,
        0.6426927,
        1.587976e+07,
        "Environmental Services \u0026 Equipment - NEC",
        0.02599,
        null,
        3.916978e+07,
        null,
        795220,
        239,
        null,
        0.0362743,
        0.0213095,
        1.68,
        1.28,
        1.31769,
        172.2746,
        10.6677,
        0,
        -22.42424,
        1.52672,
        1.09502,
        0.0054471,
        0.0043023,
        0.0077301,
        0.0054471,
        null,
        "Services",
        "BME:GRI",
        5.270768e+07,
        1.333671e+07,
        1.486156e+07,
        2.577374e+07,
        3.034517e+07,
        3.034517e+07,
        "http://www.grinyo.com"
      ],
      "s": "BME:GRI"
    },
    {
      "f": [
        2.884054e+07,
        0.13307,
        1.03157,
        "Grupo Empresarial San Jose SA is a Spain-based holding company. The Company’s main activities are structured in four business areas: Construction, which comprises the construction, design and execution of public and private infrastructure projects; Real Estate, which specializes in the acquisition and development of residential and non-residential properties; Energy and Environment, focused on the initiation, development and operation of energy efficiency projects using renewable energy, and Concessions and Services, which includes the management, operation, exploitation and maintenance of infrastructure, hospitals, public and private facilities, urban real estate, parks and gardens. The Company is a parent of such a number of controlled entities as Constructora San Jose SA, Cartuja Inmobiliaria SAU, Desarrollos Urbanisticos Udra SAU, San Pablo Plaza SAU and Comercial Udra SA, among others.",
        0.19915,
        0.94118,
        "Spain",
        "EUR",
        1.37103,
        855.5533,
        null,
        0.1827,
        0.1827,
        2.7282e+07,
        4.0752e+07,
        "EUR",
        9.984e+06,
        0.3446988,
        0.3446988,
        1.91604e+08,
        "Construction \u0026 Engineering - NEC",
        0.13307,
        null,
        2.340939e+08,
        null,
        8.653e+06,
        2698,
        null,
        0.0363566,
        0.028761199999999997,
        4.95,
        0.7,
        4.65118,
        19.70443,
        14.81607,
        7.46269,
        339.02439,
        0.40576,
        1.17822,
        0.0208188,
        0.0106384,
        0.24669339999999998,
        0.0208188,
        211870.7,
        "Capital Goods",
        "BME:GSJ",
        9.50366e+08,
        6.3167e+08,
        4.306e+08,
        5.3609900000000006e+08,
        6.502607999999999e+07,
        6.502607999999999e+07,
        "http://www.grupo-sanjose.com"
      ],
      "s": "BME:GSJ"
    },
    {
      "f": [
        3.5222564e+08,
        0.37396,
        0.90987,
        "IBERDROLA, S.A. is engaged in carrying out electricity and gas activities in Spain and abroad. The Company's segments include Network business, Deregulated business, Renewable business and Other businesses. Its Network business includes a range of energy transmission and distribution activities, and other regulated activity originated in Spain, the United Kingdom, the United States and Brazil. Its Deregulated business includes electricity generation and sales businesses, as well as gas trading and storage businesses in Spain, Portugal, the United Kingdom and North America. Its Renewable business includes activities related to renewable energies in Spain, the United Kingdom, the United States and the rest of the world. Its Other businesses include the engineering and construction businesses, and the non-power businesses. Through its subsidiaries, it provides distribution and control; operation and maintenance of power generation facilities, and management and promotion of the ground.",
        0.85638,
        0.94038,
        "Spain",
        "EUR",
        0.80137,
        85.91744,
        -1.8713e+08,
        0.40596,
        0.40596,
        7.847634e+09,
        1.980829e+09,
        "EUR",
        8.519e+09,
        0.3840157,
        0.3840157,
        null,
        "Electric Utilities - NEC",
        0.37396,
        null,
        3.808977e+10,
        null,
        2.443033e+09,
        28298,
        null,
        0.1386857,
        0.11533620000000001,
        6.47041,
        4.70789,
        1.02578,
        14.74776,
        5.92562,
        3.671,
        -4.07469,
        1.30147,
        0.666,
        0.031253500000000004,
        0.026430500000000003,
        0.069151,
        0.031253500000000004,
        1.077213e+06,
        "Utilities",
        "BME:IBE",
        1.03264e+11,
        1.126e+10,
        3.1115e+10,
        3.1418693e+10,
        6.204882e+09,
        6.204882e+09,
        "http://www.iberdrola.es/inicio"
      ],
      "s": "BME:IBE"
    },
    {
      "f": [
        1.658191e+07,
        -0.07304,
        0.68202,
        "INYPSA Informes y Proyectos SA (INYPSA) is a Spain-based engineering and consulting company that is focused on the integrated management of infrastructure and geo-information projects. The Company is organized, along with its subsidiaries, into three operating divisions: Civil Engineering, Services Management and Geo-Information. The Civil Engineering division consists of water engineering, transport infrastructure, energy, environment, geology, social development, private sector development, project management, and construction and equipment. The Services Management division includes management technical unit, facilities maintenance electrical, air conditioning, elevators, plumbing and fire, among others. The Geo-Information division covers territorial development, cartographic engineering, geographic information systems, agronomy and cadastre and photogrammetric flights.",
        -0.06646,
        0.94038,
        "Spain",
        "EUR",
        1.6607,
        137.4576,
        0,
        0.06275,
        0.06275,
        832210,
        -8.00182e+06,
        "EUR",
        null,
        0.7115511999999999,
        0.7115511999999999,
        1.200333e+07,
        "Construction \u0026 Engineering - NEC",
        -0.07304,
        null,
        3.480745e+07,
        null,
        -7.66115e+06,
        179,
        null,
        0.0129502,
        0.337393,
        0.255,
        0.13,
        4.06878,
        3.74502,
        5.86376,
        2.17391,
        38.23529,
        2.12735,
        null,
        0.2812479,
        0.16849029999999998,
        6.760928,
        0.2812479,
        124900,
        "Capital Goods",
        "BME:INY",
        2.8913e+07,
        1.6416e+07,
        1.1754e+07,
        1.63199e+07,
        1.480518e+08,
        1.480518e+08,
        "http://www.inypsa.es"
      ],
      "s": "BME:INY"
    },
    {
      "f": [
        1.688257e+07,
        0.38827,
        0.09314,
        "Grifols SA is a Spain-based company engaged in the biopharmaceuticals manufacture. The Company’s activities are divided into four business segments: Bioscience, Hospital, Diagnostic and Raw materials. The Bioscience division focuses on the research, development, manufacturing and marketing of products derived from human plasma for therapeutic use. The Hospital division offers non-biological pharmaceutical products and medical supplies for hospital pharmacy. The Diagnostic division provides clinical analysis and laboratory testing tools to laboratories, hospitals and blood banks. The Raw materials division includes sales of intermediate biological products, as well as manufacturing services to third parties. The Company operates production facilities in Spain, the United States, Mexico and Australia, among others. It controls numerous subsidiaries.",
        0.52591,
        0.94038,
        "Spain",
        "EUR",
        3.19017,
        133.4785,
        -2.21772e+08,
        0.51865,
        0.51855,
        1.145835e+09,
        -4.6014e+07,
        "EUR",
        null,
        0.34263599999999994,
        0.34263599999999994,
        1.930998e+09,
        "Biopharmaceuticals",
        0.38805,
        null,
        1.092417e+10,
        null,
        5.32145e+08,
        13997,
        null,
        0.2352744,
        0.173212,
        21.625,
        16.48,
        3.33889,
        33.14049,
        15.47565,
        0.20408,
        -16.17073,
        2.72119,
        1.52166,
        0.0637233,
        0.057231500000000005,
        0.1595507,
        0.0637233,
        272186.5,
        "Healthcare",
        "BME:GRF",
        9.567865e+09,
        2.953073e+09,
        4.709655e+09,
        3.934563e+09,
        6.8553562e+08,
        6.8553562e+08,
        "http://www.grifols.com/es/web/"
      ],
      "s": "BME:GRF"
    },
    {
      "f": [
        1.932653e+07,
        -3.91267,
        0.70964,
        "Indra Sistemas SA is a Spain-based company engaged in the field of information technology (IT). The Company divides its activities into two segments: Solutions and Services. The Solutions segment provides consulting and technology solutions, such as systems and components for compiling, processing, transmitting and presenting data for use in the control and management processes. The Services segment offers the IT and business processes outsourcing. The Company is present in various sectors, such as transportation, energy and industry, public administration and healthcare, financial, security and defense, telecommunications and touristic. The Company is a parent of numerous subsidiaries, which operate in Europe, Africa, North and South America, Asia, as well as Middle East and Pacific region.",
        -3.04912,
        0.94038,
        "Spain",
        "EUR",
        1.1952,
        305.0276,
        0,
        -0.19683,
        -0.20898,
        -6.49787e+08,
        1.3031e+07,
        "EUR",
        4.706e+08,
        0.8221204,
        0.8221204,
        1.996128e+09,
        "IT Services \u0026 Consulting - NEC",
        -3.91267,
        null,
        1.642146e+09,
        null,
        -6.41189e+08,
        37980,
        null,
        0.0077388000000000005,
        -0.0086433,
        12.55,
        7.61,
        4.7648,
        null,
        null,
        3.30408,
        8.27922,
        0.59888,
        null,
        -0.0224638,
        -0.010727599999999999,
        -0.0894318,
        -0.0224638,
        73962.51,
        "Technology",
        "BME:IDR",
        3.0281e+09,
        1.903e+09,
        1.0495999999999999e+09,
        2.902535e+09,
        1.638748e+08,
        1.638748e+08,
        "http://www.indracompany.com/"
      ],
      "s": "BME:IDR"
    },
    {
      "f": [
        2.904607e+07,
        0.14873,
        1.54672,
        "Liberbank SA is a Spain-based company engaged in the commercial banking activities. It specializes in providing consumer loans. Furthermore, the Bank offers a range of services for entrepreneurs: savings accounts, loans, factoring, payments management, investment funds, import and export financing, guarantees, as well as commercial insurance, among others. The Bank operates through a chain of retail offices in Asturias, Cantabria, Castile La Mancha and Extremadura. It also manages such brands as Cajastur, Caja Extramadura, Caja Cantabria and CCM.",
        0.16017,
        0.94038,
        "Spain",
        "EUR",
        null,
        0,
        -8.906e+06,
        0.06811,
        0.06106,
        1.3993e+07,
        -1.00096e+08,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.14474,
        null,
        9.092868e+08,
        null,
        1.28548e+08,
        5096,
        null,
        -0.014396899999999999,
        -0.014396899999999999,
        1.77,
        0.503,
        0.34837,
        16.37733,
        11.78642,
        9.28962,
        -40.79337,
        0.91718,
        null,
        null,
        0.0009853000000000002,
        0.0242727,
        null,
        null,
        "Financial",
        "BME:LBK",
        4.1823e+10,
        null,
        0,
        null,
        9.012355e+08,
        9.012355e+08,
        "http://www.liberbank.es/"
      ],
      "s": "BME:LBK"
    },
    {
      "f": [
        218630,
        1.47814,
        0.17913,
        "Miquel y Costas \u0026 Miquel SA is a Spain-based company primarily engaged, through its subsidiaries, in the production of fine and lightweight paper used in the tobacco industry. The Company’s products are distributed both domestically and abroad, and also include printing, writing, rolling and specialty papers, as well as textile pulps. The Company is a parent of Grupo Miquel y Costas, a group which comprises such companies as SA Paya Miralles, Celulosa de Levante SA, Papeles Anoia SA, Desvi SA, Sociedad Espanola Zig Zag SA, MB Papeles Especiales SA, Miquel y Costas Tecnologias SA, Proyectos Energeticos MB SA and Terranova Papers SA. In addition, it operates the Besos and Pla de la Barquera production plants, which are located in the province of Barcelona, and the Mislata production plant, located in the province of Valencia.",
        2.33854,
        0.94038,
        "Spain",
        "EUR",
        2.06788,
        26.99114,
        -7.347e+06,
        1.54669,
        1.54669,
        5.5473e+07,
        1.3761e+07,
        "EUR",
        0,
        0.6762634,
        0.6762634,
        1.35593e+08,
        "Paper Mills \u0026 Products",
        1.47814,
        null,
        4.68755e+08,
        null,
        3.064e+07,
        808,
        null,
        0.17641749999999998,
        0.1873127,
        23.65,
        17.70858,
        1.90321,
        14.6765,
        9.78142,
        0.53144,
        19.2226,
        2.09396,
        0.88167,
        0.1060848,
        0.0894804,
        0.1343452,
        0.1060848,
        280176.5,
        "Basic Materials",
        "BME:MCM",
        3.6109e+08,
        1.15177e+08,
        6.626999999999999e+07,
        2.23331e+08,
        2.058524e+07,
        2.058524e+07,
        "http://www.miquelycostas.com"
      ],
      "s": "BME:MCM"
    },
    {
      "f": [
        18310,
        5.45698,
        0.41555,
        "Baron de Ley SA is a Spain-based company engaged in the wine industry. The Company’s main activities include farming, production, ageing and sale of red, white and pink wines. The Company provides also sales of canned and cured pork products. Its facilities are located in a cultivable land located in Navarra. The Company is a parent of Grupo Baron del Ley, a group which comprises such a number of controlled entities as El Coto de Rioja SA, Bodegas Maximo SL, Bodegas El Meson SL, Inversiones Coto de Rioja SL, Vinedos Baron de Ley SL, Finca Museum SL, Dehesa Baron de Ley SL and Carbonera Bergasa SL. In addition, the Company distributes its products not only in Europe, but also in the North and South America and Asia. ",
        7.13465,
        0.94038,
        "Spain",
        "EUR",
        3.23658,
        3.02123,
        null,
        6.06116,
        6.06116,
        2.8595e+07,
        2.0899e+07,
        "EUR",
        null,
        0.5561817,
        0.5561817,
        4.9668e+07,
        "Wineries",
        5.45698,
        null,
        4.7816e+08,
        null,
        2.3465e+07,
        192,
        null,
        0.2225666,
        0.36140590000000006,
        114,
        90.55,
        2.00587,
        18.34632,
        14.09254,
        4.07113,
        8.91283,
        4.99003,
        1.55574,
        0.1076173,
        0.08734769999999999,
        0.1141917,
        0.1076173,
        501691.1,
        "Consumer/Non-Cyclical",
        "BME:BDL",
        2.97118e+08,
        1.49546e+08,
        7.202e+06,
        9.2651e+07,
        4.3e+06,
        4.3e+06,
        "http://www.barondeley.com"
      ],
      "s": "BME:BDL"
    },
    {
      "f": [
        2.963471e+07,
        0.21971,
        null,
        "Merlin Properties SOCIMI SA is a Spain-based company engaged in the operation of real estate investment trust (REIT). The Company focuses on the acquisition, management and rental of commercial properties located in the Iberian Peninsula, primarily in Spain. The Company's activities are divided into six segments: Office buildings, operating a portfolio of office space; High-street retail, leasing retail stores; Shopping centers, managing department stores; Logistics, operating logistics warehouses and distribution centers; Hotels, leasing hotel buildings, and Other, including residential real estate rental. The Company controls a number of subsidiaries, such as Tree Inversiones Inmobiliarias SOCIMI SAU, MPEP - Properties Escritorios Portugal SA, Testa Inmuebles en Renta SOCIMI SA and Obraser SA.",
        1.57244,
        0.94038,
        "Spain",
        "EUR",
        2.60065,
        114.2617,
        -2.5035e+07,
        1.40969,
        1.40969,
        2.6548899999999997e+08,
        -2.11031e+08,
        "EUR",
        null,
        0.2479735,
        0.2479735,
        2.04193e+08,
        "Commercial REITs - NEC",
        0.21971,
        null,
        4.676098e+09,
        null,
        4.9078e+07,
        27,
        null,
        0.3653415,
        1.473336,
        12.06373,
        8.23334,
        1.04596,
        7.06113,
        18.10581,
        4.41624,
        -13.37502,
        15.35216,
        null,
        0.0699916,
        0.06324550000000001,
        0.148529,
        0.0699916,
        1.128107e+07,
        "Services",
        "BME:MRL",
        7.034149e+09,
        6.85035e+08,
        3.512589e+09,
        2.14429e+08,
        3.2303e+08,
        3.2303e+08,
        "http://www.merlinproperties.com/"
      ],
      "s": "BME:MRL"
    },
    {
      "f": [
        650430,
        0.11079,
        1.10976,
        "Nicolas Correa SA is a Spain-based company primarily engaged in the design and manufacture of milling machines. The Company mainly specializes in the provision of milling solutions for the manufacturers of dies and large moulds, monolithic elements for aerospace, railway, as well as energy and general mechanical sectors, among others. The Company's activities are divided into two segments: Industrial and Commercial. The Industrial division designs and produces gantries, travelling columns, as well as bed- and bridge-type milling machines, which are distributed under the Correanayak brand name. The Commercial division is responsible for the distribution of its milling machines, as well as provision of technical advisory and maintenance services. The company operates in Spain, Portugal, Germany, China and the United States, among others, through a number of subsidiaries, such as NC Manufacturing SA, Nicolas Correa Deutschland GmbH and Tiger Machinery Parts Co.",
        0.23547,
        0.94038,
        "Spain",
        "EUR",
        1.18213,
        63.05521,
        null,
        null,
        null,
        null,
        1.697e+06,
        "EUR",
        9.523e+06,
        null,
        null,
        3.0327e+07,
        "Machine Tools",
        0.11079,
        null,
        2.216993e+07,
        null,
        1.356e+06,
        381,
        null,
        null,
        null,
        2.18,
        1.06,
        0.58878,
        null,
        null,
        -0.27701,
        56.52174,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:NEA",
        7.8749e+07,
        3.5527e+07,
        1.8266e+07,
        5.589e+07,
        1.223943e+07,
        1.223943e+07,
        "http://www.correa.es"
      ],
      "s": "BME:NEA"
    },
    {
      "f": [
        1.268601e+07,
        0.09465,
        1.56677,
        "Natra SA is a Spain-based company principally engaged in the production and commercialization of cocoa derivates and chocolate products. The Company’s product portfolio is divided into two areas: Consumer Goods and Industrial Goods. The Consumer Goods area focuses on manufacturing chocolate slabs, countlines, spreads, pralines and Belgian specialties, among others. The Industrial Goods division is responsible for cocoa grinding and distributing cocoa mass, butter and powder, bulk chocolate and chocolate powder, as well as industrial spreads and fillings, among others. The Company operates in Europe, North America and Asia. It owns a number of subsidiaries, such as Txocal Belgium NV, Natra US Inc, Habitat Natra SA, Natrajacali NV and Natra Chocolate UK Ltd.",
        0.33229,
        0.94038,
        "Spain",
        "EUR",
        1.66546,
        457.5483,
        null,
        0.20501,
        0.20501,
        2.4505e+07,
        -2.609e+06,
        "EUR",
        null,
        0.31749310000000003,
        0.31749310000000003,
        1.17749e+08,
        "Chocolate \u0026 Confectionery",
        0.09465,
        null,
        3.29974e+07,
        null,
        4.464e+06,
        935,
        null,
        0.0345566,
        0.0415146,
        0.755,
        0.23,
        0.9492,
        3.39008,
        1.65625,
        0.72464,
        110.60606,
        0.08848,
        0.72666,
        0.05343,
        0.0376084,
        0.3268676,
        0.05343,
        368166.8,
        "Consumer/Non-Cyclical",
        "BME:NAT",
        2.5297e+08,
        1.04719e+08,
        1.57996e+08,
        3.68708e+08,
        4.716076e+07,
        4.716076e+07,
        "http://www.natra.es"
      ],
      "s": "BME:NAT"
    },
    {
      "f": [
        1.06542e+06,
        -0.05859,
        1.30582,
        "Montebalito SA is a Spain-based company primarily engaged in the real estate sector. The Company's activities are divided into four business segments: Promotion, Rental, Renewable Energy and Other. The Promotion division is responsible for the development of residential and commercial real estate properties. The Rental segment provides leasing of residential and commercial real estate assets. The Renewable Energy area generates power energy using solar sources. The Other segment includes operations related to touristic and hospitality industry, as well as corporate cash management services. The Company is present in Spain, France, Germany, Romania, Brazil, Chile and Dominican Republic, among others. It owns a number of subsidiaries, such as Meridional Europa SL, Hoteles Balito SA, Montebalito Energias Renovables SL, Fotovoltaica Fuerteventura SL and Meridional Canarias SA.",
        -0.01929,
        0.94038,
        "Spain",
        "EUR",
        7.78407,
        13.85861,
        -1.439e+06,
        0.26344,
        0.26344,
        636000,
        4.733e+06,
        "EUR",
        null,
        0.2928361,
        0.2928361,
        4.361e+06,
        "Real Estate Development \u0026 Operations - NEC",
        -0.05859,
        null,
        2.67e+07,
        null,
        259000,
        49,
        null,
        1.191757,
        1.370167,
        1.87,
        1.04334,
        0.52152,
        6.75676,
        7.61769,
        14.83871,
        56.26918,
        5.24043,
        0.94376,
        0.0516343,
        0.0430009,
        0.06328210000000001,
        0.0516343,
        108404.3,
        "Capital Goods",
        "BME:MTB",
        1.25933e+08,
        8.0137e+07,
        1.3897e+07,
        7.157e+06,
        2.938e+07,
        2.938e+07,
        "http://www.montebalito.com"
      ],
      "s": "BME:MTB"
    },
    {
      "f": [
        4.80603e+06,
        0.02886,
        1.16383,
        "Reno De Medici SpA is an Italy-based manufacturer of cardboard. The Company produces and distributes cardboard made from recycled fibers. The Company operates production units in Italy, Germany, France and Spain. The Company operates subsidiaries, including Cartiera Alto Milanese SpA, Reno De Medici Arnsberg GmbH, Redno De Medici UK Ltd, Cascades Grundstuck GmbH, RDM Blendecques SAS, RDM Ovaro SpA and Careo Srl, among others. The main shareholder of the Company is Cascades Inc.",
        0.08821,
        0.94038,
        "Italy",
        "EUR",
        1.23674,
        41.1513,
        0,
        0.00802,
        0.00802,
        3.1121e+07,
        1.6254999999999998e+07,
        "EUR",
        null,
        0.36947969999999997,
        0.36947969999999997,
        9.8696e+07,
        "Paper Packaging - NEC",
        0.02886,
        null,
        1.154055e+08,
        null,
        9.79e+06,
        1536,
        null,
        0.018872299999999998,
        0.013338399999999999,
        0.3698,
        0.2652,
        0.73606,
        37.98005,
        4.57759,
        3.81731,
        -13.71105,
        0.2569,
        0.6662,
        0.0154499,
        0.0100593,
        0.024253300000000002,
        0.0154499,
        385273.6,
        "Basic Materials",
        "BME:RDM.Q",
        3.88515e+08,
        1.75562e+08,
        6.4238e+07,
        4.38037e+08,
        3.7721939e+08,
        3.7721939e+08,
        "http://www.renodemedici.it"
      ],
      "s": "BME:RDM.Q"
    },
    {
      "f": [
        862300,
        0.10184,
        2.05972,
        "Promotora de Informaciones SA (PRISA) is a Spain-based company primarily engaged in the consumer publishing sector. The Company’s activities are divided into four business segments: Education, which focuses on the sale of educational books, as well as services and materials related to the education systems under Santillana brand name; Radio, which operates radio network stations, such as Cadena Ser, Kebuena and ADN Radio, as well as organizes and manages entertainment events; Press, which includes the release and distribution of newspapers, magazines, supplements, collectible products and other periodical publications, such as El Pais, Cinco Dias and El Huffington Post, and Audiovisual, which provides cable and satellite television services intended for the production of audiovisual content, as well as production and marketing of digital content for news, entertainment and education. It operates in Spain, Portugal, Chile, Colombia, Brazil and Mexico, among others.",
        2.15847,
        0.94118,
        "Spain",
        "EUR",
        1.53086,
        null,
        -4.289e+06,
        null,
        null,
        null,
        8.3312e+07,
        "EUR",
        5.89918e+08,
        null,
        null,
        7.53822e+08,
        "Consumer Publishing - NEC",
        0.10184,
        null,
        4.26931e+08,
        null,
        5.294e+06,
        8727,
        null,
        null,
        null,
        6.783,
        4.26,
        null,
        null,
        null,
        4.88838,
        10.59253,
        null,
        1.25661,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:PRS",
        2.1434250000000002e+09,
        7.98722e+08,
        1.968814e+09,
        1.348006e+09,
        7.787892e+07,
        7.787892e+07,
        "http://www.prisa.com/"
      ],
      "s": "BME:PRS"
    },
    {
      "f": [
        1.342544e+08,
        -0.84289,
        1.07471,
        "Repsol, S.A. is an integrated energy company. The Company's segments include Upstream and Downstream. Its activities are divided into two business areas: Upstream, relating to the exploration, development and production of crude oil and natural gas reserves, and Downstream, corresponding to refining, trading and crude oil and product transportation, as well as commercialization of oil products, petrochemicals products and liquefied petroleum gas (LPG); commercialization, transportation and regasification of natural gas and liquefied natural gas (LNG), and renewable energy power projects. It also has participation in the Gas Natural Fenosa group, which is engaged in distribution and commercialization of natural gas and the generation, distribution and commercialization of electricity activities. It owns and operates over five refineries in Spain (Cartagena, A Coruna, Bilbao, Puertollano and Tarragona) with a combined distillation capacity of over 900 thousand barrels of oil per day.",
        1.23858,
        0.94038,
        "Spain",
        "EUR",
        1.03322,
        56.21762,
        -4.88e+08,
        -0.65129,
        -0.65129,
        3.115e+09,
        1.457e+09,
        "EUR",
        3.01e+09,
        0.2752469,
        0.2752469,
        1.038e+10,
        "Oil \u0026 Gas Refining and Marketing - NEC",
        -0.84289,
        null,
        1.933185e+10,
        null,
        -1.227e+09,
        25905,
        null,
        -0.044590500000000005,
        -0.0491962,
        13.285,
        7.82353,
        0.65563,
        null,
        11.73761,
        2.24806,
        34.7477,
        0.56712,
        0.77675,
        -0.0179381,
        -0.014038299999999998,
        -0.0316108,
        -0.0179381,
        1.381871e+06,
        "Energy",
        "BME:REP",
        6.1475e+10,
        1.3685e+10,
        1.6275e+10,
        3.9737e+10,
        1.43901023e+09,
        1.43901023e+09,
        "http://www.repsol.com"
      ],
      "s": "BME:REP"
    },
    {
      "f": [
        37230,
        0.18577,
        0.2689,
        "Bodegas Riojanas SA is a Spain-based company engaged in the production and distribution of wine. The Company’s activities include viticulture, as well as the production, ageing and sale of wines. Bodegas Riojanas SA operates two production centers in the municipalities of Cenicero and San Vincente de la Sonsierra, both located in the autonomous community of La Rioja . The Company’s brand portfolio includes Azuel, Viore, Penamonte, Monte Real, Veiga Naum, Cruceiro Vello and Vina Albina, among others. Its products are exported to Switzerland, Germany, Denmark and Mexico, among others. The Company operates through subsidiaries, including Bodegas Torreduero SA and Bodegas Riojanas USA Corporation. ",
        0.42871,
        0.94118,
        "Spain",
        "EUR",
        3.67959,
        97.92983,
        -646000,
        0.18785,
        0.18785,
        3.063e+06,
        -2.009e+06,
        "EUR",
        null,
        0.6267897,
        0.6267897,
        1.1011e+07,
        "Wineries",
        0.18577,
        null,
        2.207086e+07,
        null,
        988000,
        91,
        null,
        0.0985459,
        0.0684004,
        4.87,
        3.67,
        0.8768,
        22.09209,
        9.59603,
        1.21951,
        3.49127,
        1.23439,
        0.76656,
        0.0241602,
        0.0192617,
        0.0399265,
        0.0241602,
        198666.7,
        "Consumer/Non-Cyclical",
        "BME:RIO",
        5.4521e+07,
        3.6726e+07,
        2.4646e+07,
        1.7537e+07,
        5.31724e+06,
        5.31724e+06,
        "http://www.bodegasriojanas.com"
      ],
      "s": "BME:RIO"
    },
    {
      "f": [
        5.16179e+06,
        -1.33029,
        0.86997,
        "Abengoa SA is a Spain-based company primarily engaged in the construction and engineering sector. The Company's activities are divided into three business segments: Engineering and construction, Concession-type infrastructure and Industrial production. The Engineering and construction division focuses on the execution of turnkey projects for electric generation plants, water infrastructure and transmission lines, among others. The Concession-type infrastructure division is structured into four lines: Solar, operating solar energy plants; Water, operating water utilities; Transmission, managing transmission line infrastructure, as well as Cogeneration and other, managing conventional cogeneration electricity plants. The Industrial production division includes the production and development of biofuels, mainly bioethanol. The Company operates through numerous subsidiaries in Europe, the Americas, Africa and Asia. The Company's shareholder is Natural Chem Group LLC.",
        -1.04199,
        0.94038,
        "Spain",
        "EUR",
        0.57418,
        null,
        -9.0235e+07,
        null,
        null,
        null,
        -3.727247e+09,
        "EUR",
        0,
        null,
        null,
        2.004888e+09,
        "Construction \u0026 Engineering - NEC",
        -1.33029,
        null,
        2.096697e+08,
        null,
        -1.213478e+09,
        16617,
        null,
        null,
        null,
        1,
        0.338,
        null,
        null,
        null,
        -1.44628,
        -33.00562,
        null,
        0.56607,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:ABG",
        1.1126109e+10,
        8.625661e+09,
        9.15204e+09,
        5.755482e+09,
        9.3610947e+08,
        9.3610947e+08,
        "http://www.abengoa.com"
      ],
      "s": "BME:ABG"
    },
    {
      "f": [
        1.0287929e+08,
        -2.06735,
        1.7245,
        "Codere SA is a Spain-based company engaged, together with its subsidiaries, in the operation of activities related to the private gaming sector, principally in the operation of arcade and slot machines, sports betting houses, bingo halls, casinos and racetracks. The Company has presence in Spain, Italy, Argentina, Brazil, Colombia, Mexico, Panama and Uruguay. The Company owns such fully consolidated subsidiaries as Codere Apuestas Espana SLU, Codere Internacional SLU, Codere Interactiva SL, Desarollo Online Juegos Regulados SA and Codere Finance Luxembourg SA, among others. In addition, Masampe Holding BV is the Company’s majority shareholder with 51.35% of its interest.",
        -0.41176,
        0.94038,
        "Spain",
        "EUR",
        1.49607,
        1134.602,
        -4.627e+06,
        -1.65877,
        -1.65877,
        1.92924e+08,
        1.35159e+08,
        "EUR",
        1.799e+08,
        0.9681869000000001,
        0.9681869000000001,
        1.580826e+09,
        "Casinos \u0026 Gaming - NEC",
        -2.06735,
        null,
        2.30204e+09,
        null,
        -1.13192e+08,
        13398,
        null,
        0.0334326,
        -0.7579094000000001,
        1.1,
        0.34,
        27.36973,
        null,
        null,
        -13.33333,
        16.66667,
        1.51368,
        1.46898,
        -2.785952,
        -0.7966444,
        null,
        -2.785952,
        114081.4,
        "Services",
        "BME:CDR",
        1.5338e+09,
        5.908e+08,
        9.542e+08,
        1.630617e+09,
        2.52944383e+09,
        2.52944383e+09,
        "http://www.codere.es"
      ],
      "s": "BME:CDR"
    },
    {
      "f": [
        8.94056e+06,
        1.9638613805999998,
        1.88356,
        "Aperam SA is a Luxembourg-based stainless and specialty steel producer. It is also a producer of high value-added specialty steels products, including grain oriented and non-grain oriented electrical steels and nickel alloys. Its production capacity is concentrated in production facilities located in Brazil, Belgium and France. The Company's distribution network is comprised of steel service centers, transformation facilities and sales offices. The Company sells its products to customers in over 30 countries, including customers in the aerospace, automotive, catering, construction, household appliances and electrical engineering, industrial processes, medical and oil \u0026 gas industries. Aperam SA operates through its numerous subsidiaries.",
        3.73604,
        1,
        "Luxembourg",
        "USD",
        2.04104,
        18.83426,
        0,
        null,
        null,
        null,
        2.30117380584e+08,
        "EUR",
        null,
        null,
        null,
        5.25e+08,
        "Iron, Steel Mills \u0026 Foundries",
        1.86263,
        null,
        3.3049137891e+09,
        null,
        1.72e+08,
        9500,
        null,
        null,
        null,
        45.575,
        25.415,
        1.47258,
        null,
        null,
        3.66359,
        54.20737,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Basic Materials",
        "BME:APAM",
        4.484e+09,
        1.704e+09,
        4.72e+08,
        4.716e+09,
        7.76268e+07,
        7.76268e+07,
        "http://www.aperam.com"
      ],
      "s": "BME:APAM"
    },
    {
      "f": [
        889800,
        0.04525,
        1.37021,
        "Catenon SA, also known as Catenon, is a Spain-based holding company engaged in the provision of Information Technology (IT) services in the field of human resources, and specifically in the processes of dearching, selection and screening of personnel, training, recruitment and motivation. The Company operates on five continents in over 100 countries. As of December 31, 2013, the Company had eleven fully-owned subsidiaries, including Netselcom HR SAU, Catenon Iberia SAU, Catenon SAS, Catenon Global BV, Catenon ApS, Catenon GmbH, Servicos de Conlutoria, Formacao e Recrutamento em Recursos Humanos Ltda, Catenon India Private Limited and Catenon SA de CV, among others. As of June 30, 2014, D. Javier Ruiz de Azcarate Varela has 25,93% of the Company's shareholdings and D. Miguel Angel Navaroo Barquin had 13,25%.",
        0.09142,
        0.94038,
        "Spain",
        "EUR",
        1.64533,
        107.0996,
        null,
        0.04527,
        0.04527,
        2.44067e+06,
        -502370,
        "EUR",
        null,
        0.6954491,
        0.6954491,
        9.31358e+06,
        "Employment Services - NEC",
        0.04525,
        null,
        8.99225e+06,
        null,
        849480,
        80,
        null,
        0.11588480000000001,
        0.0808942,
        1.24,
        0.3,
        1.66656,
        10.60305,
        5.23938,
        33.33333,
        -41.46341,
        0.67146,
        null,
        0.0965062,
        0.0669314,
        0.1705927,
        0.0965062,
        null,
        "Services",
        "BME:COM",
        1.253296e+07,
        6.98477e+06,
        5.77876e+06,
        1.339218e+07,
        1.873385e+07,
        1.873385e+07,
        "http://www.catenon.com"
      ],
      "s": "BME:COM"
    },
    {
      "f": [
        0,
        -0.96903,
        null,
        "Caja de Ahorros Del Mediterraneo (CAM), also known as Fundacion Caja Mediterraneo, is a Spain-based non-profit organization. The foundation is involved in a range of social issues, which are related to art, culture, science, environment, and education. The Organization’s main activities include promoting employment and entrepreneurial initiatives: trainings for unemployed, creation of additional workplaces, promotion of self-employment, disabled people support, collaboration with local companies, and social events organization, among others. The Foundation’s facilities are located in a number of Spanish cities, such as Alicante, Murcia, Monovar, Madrid, Orihuela, Torrent, Valencia, Cartagena and Elche.",
        -0.89771,
        0.94038,
        "Spain",
        "EUR",
        null,
        222.2568,
        -1.9165e+07,
        -0.79485,
        -0.79485,
        -3.100113e+09,
        -1.084759e+09,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        -0.96903,
        null,
        6.7e+07,
        null,
        -2.71329e+09,
        6478,
        null,
        -2.207553,
        -2.207553,
        null,
        null,
        2.41907,
        null,
        null,
        0,
        0,
        0.04287,
        null,
        null,
        -0.0400904,
        -1.627346,
        null,
        null,
        "Financial",
        "BME:CAM",
        6.6852628e+10,
        null,
        6.462301e+09,
        null,
        5.249e+09,
        5.249e+09,
        "https://obscajamediterraneo.wordpress.com/"
      ],
      "s": "BME:CAM"
    },
    {
      "f": [
        5.16179e+06,
        -1.33029,
        0.86997,
        "Abengoa SA is a Spain-based company primarily engaged in the construction and engineering sector. The Company's activities are divided into three business segments: Engineering and construction, Concession-type infrastructure and Industrial production. The Engineering and construction division focuses on the execution of turnkey projects for electric generation plants, water infrastructure and transmission lines, among others. The Concession-type infrastructure division is structured into four lines: Solar, operating solar energy plants; Water, operating water utilities; Transmission, managing transmission line infrastructure, as well as Cogeneration and other, managing conventional cogeneration electricity plants. The Industrial production division includes the production and development of biofuels, mainly bioethanol. The Company operates through numerous subsidiaries in Europe, the Americas, Africa and Asia. The Company's shareholder is Natural Chem Group LLC.",
        -1.04199,
        0.94038,
        "Spain",
        "EUR",
        0.57418,
        null,
        -9.0235e+07,
        null,
        null,
        null,
        -3.727247e+09,
        "EUR",
        0,
        null,
        null,
        2.004888e+09,
        "Construction \u0026 Engineering - NEC",
        -1.33029,
        null,
        2.096697e+08,
        null,
        -1.213478e+09,
        16617,
        null,
        null,
        null,
        1,
        0.338,
        null,
        null,
        null,
        -1.44628,
        -33.00562,
        null,
        0.56607,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:ABG.P",
        1.1126109e+10,
        8.625661e+09,
        9.15204e+09,
        5.755482e+09,
        9.3610947e+08,
        9.3610947e+08,
        "http://www.abengoa.com"
      ],
      "s": "BME:ABG.P"
    },
    {
      "f": [
        4.498628e+07,
        -0.05307,
        0.95617,
        "Deoleo SA, formerly SOS Corporacion Alimentaria SA, is a Spain-based company, which is primarily engaged, together with its subsidiaries, in the food processing sector. The Company’s activities are structured in one area: vegetable oils. It specializes in the production and sell of bottled olive oil under a range of brands, such as Carbonell, Bertolli, Carapelli, Koipe, Koipesol, Hojiblanca and Sasso. Furthermore, the Company distributes seed oils, table olives, vinegars, sauces and confectionary products. Deoleo SA is a parent of Grupo Deoleo, a group which comprises a number of controlled entities with operations established in Europe, the Middle East, Asia, as well as North and South America.",
        -0.03496,
        0.94038,
        "Spain",
        "EUR",
        2.09786,
        117.6317,
        null,
        -0.05675,
        -0.05675,
        -2.8888e+07,
        -3.5742e+07,
        "EUR",
        9.4058e+07,
        0.2308509,
        0.2308509,
        1.82738e+08,
        "Starch, Vegetable Fat \u0026 Oil Manufacturing",
        -0.05307,
        null,
        2.828961e+08,
        null,
        -6.1273e+07,
        725,
        null,
        -0.06489639999999999,
        -0.10991390000000001,
        0.265,
        0.155,
        0.58395,
        null,
        null,
        16.66667,
        2.08333,
        0.37918,
        0.99105,
        -0.0509686,
        -0.0457605,
        -0.1262325,
        -0.0509686,
        1.02341e+06,
        "Consumer/Non-Cyclical",
        "BME:OLE",
        1.363238e+09,
        2.70559e+08,
        5.69868e+08,
        8.17284e+08,
        1.15467795e+09,
        1.15467795e+09,
        "http://deoleo.eu"
      ],
      "s": "BME:OLE"
    },
    {
      "f": [
        1.05462256e+09,
        0.04401,
        1.51553,
        "Banco Popular Espanol SA is a Spain-based commercial bank. The Bank divides its business into four segments: Commercial Banking, Corporate and Markets; Insurance Activity, and Asset Management. The Bank’s services and products include saving and current accounts, fixed-term deposits, investment funds, commercial and consumer loans, mortgages, cash management, financial assessment and other banking operations aimed at individuals and small and medium enterprises (SMEs). The Bank is a parent company of Grupo Banco Popular, a group which comprises a number of controlled entities, such as Targobank SA, GAT FTGENCAT 2005 FTA, Inverlur Aguilas I SL, Platja Amplaries SL, and Targoinmuebles SA, among others. In January 2014, the Company sold its entire 4.6% stake in Inmobiliaria Colonial SA during a restructuring of the property firm's capital.",
        0.10015,
        0.94038,
        "Spain",
        "EUR",
        null,
        129.4264,
        -6.242e+07,
        -0.02974,
        -0.02974,
        4.66499e+08,
        9.57083e+08,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.04345,
        null,
        4.243023e+09,
        null,
        1.05432e+08,
        14935,
        270114,
        -0.043861,
        -0.043861,
        2.94185,
        0.766,
        0.28978,
        null,
        null,
        6.08604,
        -63.47025,
        1.15801,
        null,
        null,
        -0.0004865,
        -0.0057410000000000004,
        null,
        null,
        "Financial",
        "BME:POP",
        1.56631912e+11,
        null,
        1.8951178e+10,
        null,
        4.196858e+09,
        4.196858e+09,
        "http://www.grupobancopopular.com/"
      ],
      "s": "BME:POP"
    },
    {
      "f": [
        5.068632e+07,
        0.41822,
        1.2304,
        "Bankinter SA is a Spain-based financial institution (the Bank) primarily engaged in the banking sector. The Bank's activities are divided into four business segments: Commercial banking, which offers current accounts, fixed-term deposits, investment management and advisory, as well as mortgage loans, among others, to individual customers; Corporate banking, which provides financial services to small and medium-sized companies, corporations and government bodies; Consumer finance, which focuses on personal loans and credit card services through Bankinter Consumer Finance EFC, and Other, which includes online savings accounts, among others. The Company operates through numerous subsidiaries, such as Bankinter Gestion de Activos SGIIC, Hispamarket SA, Bankinter Capital Riesgo SGECR SA and Bankinter Sociedad de Financiacion SAU.",
        0.4863,
        0.94038,
        "Spain",
        "EUR",
        null,
        223.0729,
        -2.06215e+08,
        0.53013,
        0.53013,
        null,
        -4.2308e+07,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.41822,
        null,
        6.826889e+09,
        null,
        3.7592e+08,
        5477,
        61386,
        0.29811119999999997,
        0.29811119999999997,
        7.618,
        5.497,
        1.67403,
        14.32667,
        null,
        2.16573,
        17.42424,
        3.13567,
        null,
        null,
        0.0076278000000000006,
        0.1215729,
        null,
        null,
        "Financial",
        "BME:BKT",
        6.629371700000001e+10,
        null,
        9.095664e+09,
        null,
        8.9871607e+08,
        8.9871607e+08,
        "https://www.bankinter.com/"
      ],
      "s": "BME:BKT"
    },
    {
      "f": [
        158240,
        0.29933,
        0.77671,
        "Clinica Baviera SA is a Spain-based company engaged in the healthcare sector. The Company focuses on providing services within the field of ophthalmic medicine. The Company is specialized in the diagnosis and treatment of eye disorders, including myopia, hyperopia, astigmatism, cataracts, glaucoma, vitreous-retina and strabismus, among others. The Company operates a network of clinics located in various European countries, such as Spain, Germany, Austria and Italy. In addition, the Company is a parent of the Baviera Group, a group that comprises a number of controlled entities, including Clinica Baviera Italia Srl, Clinica Baviera Mallorca SL, Care Vision Germany GmbH and Castellana de Intermediacion Sanitaria SL, among others.",
        0.59413,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        -3.60396e+06,
        0.53058,
        0.53058,
        1.667584e+07,
        1.5118e+06,
        "EUR",
        null,
        null,
        null,
        7.39232e+07,
        "Hospitals, Clinics \u0026 Primary Care Services",
        0.29933,
        null,
        1.464421e+08,
        null,
        4.87972e+06,
        730,
        null,
        0.1303408,
        0.1271612,
        10.15,
        4.63,
        null,
        16.92487,
        11.00274,
        -6.45833,
        71.37405,
        1.59474,
        null,
        null,
        null,
        null,
        null,
        106406,
        "Healthcare",
        "BME:CBAV",
        null,
        null,
        null,
        8.552735e+07,
        null,
        null,
        "http://www.clinicabaviera.com/"
      ],
      "s": "BME:CBAV"
    },
    {
      "f": [
        4.66443e+06,
        0.29415,
        null,
        "Applus Services SA is a Spain-based company that provides inspection, testing and quality assurance services. The Company's activities are divided into five segments: Applus+ RTD, which provides non-destructive testing services mainly to the oil industry; Applus+ Velosi-Norcontrol, which offers solutions for technical assistance, supervision, inspection, quality control testing, certification and consulting services mainly to industrial, electrical, oil and telecommunications facilities; Applus+ Laboratories, which focuses on laboratory testing, system certification and product development services within aerospace, industrial and consumer goods sectors, among others; Applus+ Automotive, which is responsible for the vehicle roadworthiness testing services, and Applus+ IDIADA, which delivers design, engineering, testing and certification services mainly to car manufacturers. The Company operates in Europe, Africa, Asia and the Americas.",
        1.19112,
        0.94038,
        "Spain",
        "EUR",
        1.60086,
        130.6516,
        -1.6902e+07,
        0.23,
        0.23,
        1.85293e+08,
        9.2021e+07,
        "EUR",
        5.47202e+08,
        0.8608258999999999,
        0.8608258999999999,
        1.454983e+09,
        "Testing Laboratories",
        0.29415,
        null,
        1.231389e+09,
        null,
        3.8244e+07,
        18819,
        null,
        0.0491768,
        0.0348232,
        9.84,
        6.598,
        2.02728,
        41.17826,
        8.44192,
        4.07692,
        14.95327,
        0.75789,
        1.57405,
        0.024539,
        0.019440100000000002,
        0.0489101,
        0.024539,
        89488.27,
        "Services",
        "BME:APPS",
        1.958209e+09,
        5.67803e+08,
        7.91818e+08,
        1.701473e+09,
        1.2972631000000001e+08,
        1.2972631000000001e+08,
        "http://www.applus.com"
      ],
      "s": "BME:APPS"
    },
    {
      "f": [
        4.4532183e+08,
        0.1364,
        1.4314,
        "Caixabank SA is a Spain-based bank. Its activities are divided into two business segments: Banking and insurance, as well as Investments. The Banking and insurance division provides financial services for individual customers, including retail, private and personal banking, business customers, such as commercial and corporate banking, cash management and markets solutions, as well as offers insurance products. The Investments division includes investments in the international banking investee portfolio, as well as stakes in other companies, such as Repsol SA and Telefonica SA. The Bank operates through domestic and foreign branches, as well as representative offices in Europe, the Americas, Africa and Asia. It is a subsidiary of Criteria Caixa SA.",
        0.18887,
        0.94118,
        "Spain",
        "EUR",
        null,
        119.6618,
        -4.97709e+08,
        0.1323,
        0.1323,
        5.493866e+09,
        1.20432e+09,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.1364,
        null,
        1.959492e+10,
        null,
        8.1446e+08,
        32315,
        null,
        0.10587339999999999,
        0.10587339999999999,
        3.57953,
        1.7931,
        0.83822,
        24.71655,
        17.68834,
        6.96762,
        -1.24685,
        1.98174,
        null,
        null,
        0.0023332,
        0.0333416,
        null,
        null,
        "Financial",
        "BME:CABK",
        3.42863e+11,
        null,
        2.7953e+10,
        null,
        5.98799987e+09,
        5.98799987e+09,
        "http://www.caixabank.com"
      ],
      "s": "BME:CABK"
    },
    {
      "f": [
        1.688257e+07,
        0.38827,
        0.09314,
        "Grifols SA is a Spain-based company engaged in the biopharmaceuticals manufacture. The Company’s activities are divided into four business segments: Bioscience, Hospital, Diagnostic and Raw materials. The Bioscience division focuses on the research, development, manufacturing and marketing of products derived from human plasma for therapeutic use. The Hospital division offers non-biological pharmaceutical products and medical supplies for hospital pharmacy. The Diagnostic division provides clinical analysis and laboratory testing tools to laboratories, hospitals and blood banks. The Raw materials division includes sales of intermediate biological products, as well as manufacturing services to third parties. The Company operates production facilities in Spain, the United States, Mexico and Australia, among others. It controls numerous subsidiaries.",
        0.52591,
        0.94038,
        "Spain",
        "EUR",
        3.19017,
        133.4785,
        -2.21772e+08,
        0.51865,
        0.51855,
        1.145835e+09,
        -4.6014e+07,
        "EUR",
        null,
        0.34263599999999994,
        0.34263599999999994,
        1.930998e+09,
        "Biopharmaceuticals",
        0.38805,
        null,
        1.092417e+10,
        null,
        5.32145e+08,
        13997,
        null,
        0.2352744,
        0.173212,
        21.625,
        16.48,
        3.33889,
        33.14049,
        15.47565,
        0.20408,
        -16.17073,
        2.72119,
        1.52166,
        0.0637233,
        0.057231500000000005,
        0.1595507,
        0.0637233,
        272186.5,
        "Healthcare",
        "BME:GRF.P",
        9.567865e+09,
        2.953073e+09,
        4.709655e+09,
        3.934563e+09,
        6.8553562e+08,
        6.8553562e+08,
        "http://www.grifols.com/es/web/"
      ],
      "s": "BME:GRF.P"
    },
    {
      "f": [
        1.08771e+06,
        2.27234,
        1.02275,
        "Grupo Catalana Occidente SA is a Spain-based company engaged in the insurance and reinsurance sectors. The Company's activities are divided into three business segments: Life insurance, Non-life insurance and Others. The Life insurance division offers insurance policies related to health and life coverage. The Life insurance division provides property, vehicle, home, casualty and credit guarantee insurance, among others. The Others division includes services offered by Atradius NV, such as credit insurance and reinsurance, financial advisory and debt collection. The Company operates through Grupo Previsora Bilbaina, Azkaran SL, Seguros Catalana Occidente Sociedad Anonima de Seguros y Reaseguros, Grupo Compania Espanola de Credito y Caucion SL and Bilbao Compania Anonima de Seguros y Reaseguros SA, among others. The Company is a subsidiary of Inoc SA.",
        2.9761,
        0.94038,
        "Spain",
        "EUR",
        null,
        34.85139,
        -7.6812e+07,
        2.41906,
        2.41906,
        4.68121e+08,
        1.16713e+08,
        "EUR",
        null,
        null,
        null,
        null,
        "Multiline Insurance \u0026 Brokers - NEC",
        2.27234,
        null,
        3.6324e+09,
        null,
        2.6812e+08,
        6527,
        null,
        0.1130179,
        0.1121737,
        32.5,
        22.6,
        1.45597,
        12.51312,
        null,
        2.99422,
        -2.41779,
        0.94938,
        null,
        null,
        0.0232953,
        0.12263199999999999,
        null,
        589894.9,
        "Financial",
        "BME:GCO",
        1.39019e+10,
        null,
        8.548e+08,
        3.421099e+09,
        1.1797343e+08,
        1.1797343e+08,
        "http://www.grupocatalanaoccidente.com/"
      ],
      "s": "BME:GCO"
    },
    {
      "f": [
        1.199236e+07,
        0.30646,
        0.33828,
        "Prosegur Compania de Seguridad SA is a Spain-based company engaged in the provision of security services. The Company’s activities are divided into business segments: Integrated Security Solutions (ISS), Cash in Transit (CIT) and Alarms. The ISS division provides surveillance and protection of premises, property and persons, as well as activities related to technological security solutions. The CIT division offers transportation, storage, safekeeping, counting and classification of coins and banknotes, deeds, securities and other goods that require special protection. The Alarms division comprises installation and monitoring of home alarms. The Company operates through numerous subsidiaries in Europe, Latin America, Asia, Africa and Australia. It is controlled by Gubel SL.",
        0.51145,
        0.94038,
        "Spain",
        "EUR",
        1.16351,
        193.4495,
        -6.3906e+07,
        null,
        null,
        null,
        9.0869e+07,
        "EUR",
        5.15225e+08,
        null,
        null,
        8.14919e+08,
        "Security Services",
        0.30646,
        null,
        3.776803e+09,
        null,
        1.83378e+08,
        167032,
        null,
        null,
        null,
        6.86,
        3.73,
        4.98708,
        null,
        null,
        6.06586,
        43.32553,
        null,
        1.09269,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:PSG",
        2.875977e+09,
        1.323951e+09,
        9.66247e+08,
        3.959384e+09,
        5.9842977e+08,
        5.9842977e+08,
        "http://www.prosegur.com/"
      ],
      "s": "BME:PSG"
    },
    {
      "f": [
        181010,
        0.67247,
        0.42936,
        "Lingotes Especiales SA is a Spain-based company engaged in the metal production. The Company’s product portfolio comprises design, development and transformation of all types of ingots and metal parts. The Company’s products are generally aimed at client demands and sales of cast iron parts, such as grey and nodular iron pieces parts used in automotive industry, electro domestic appliances and civil construction, among others. The Company's production is based on the melting process which consists of use of a medium frequently electric ovens as much as induction furnaces and gas cupolas. The Company utilizes also vertical moulding by using green sand in Disamatic machines.The Company owns fully consolidated subsidiary Frenos y Conjuntos SA, which is engaged in the production of disc brakes. ",
        1.07106,
        0.94038,
        "Spain",
        "EUR",
        1.07895,
        0,
        -3.78771e+06,
        null,
        null,
        null,
        6.20071e+06,
        "EUR",
        null,
        null,
        null,
        4.862183e+07,
        "Automotive Body Parts",
        0.67247,
        null,
        1.392e+08,
        null,
        6.72465e+06,
        568,
        null,
        null,
        null,
        17.5,
        6.97,
        3.33214,
        null,
        null,
        -3.93375,
        88.36265,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Consumer Cyclical",
        "BME:LGT",
        7.2864e+07,
        3.3076e+07,
        7.122e+06,
        7.781542e+07,
        1e+07,
        1e+07,
        "http://www.lingotes.com/es/"
      ],
      "s": "BME:LGT"
    },
    {
      "f": [
        4.11184e+06,
        0.76222,
        0.24094,
        "Almirall SA is a Spain-based company principally engaged in the pharmaceuticals manufacture. The Company focuses on development and marketing of drugs applied in various therapeutic areas, such as nervous system, gastrointestinal, dermatological, respiratory system, antiinfectives, as well as antineoplastic and immunomodulating agents. The Company's activities are divided into four business segments: Own network, which focuses on the commercialization of pharmaceuticals through own brand names; Licenses, which sells product rights to third parties; Research and development (R\u0026D), which is responsible for the creation of drug candidates, as well as Dermatology, which includes sale of dermatological medicines in the United States. The Company operates through numerous subsidiaries in Europe, the Americas, Africa, Asia and Australia.",
        1.19153,
        0.94038,
        "Spain",
        "EUR",
        2.19153,
        20.77871,
        -3.5e+07,
        0.96072,
        0.96072,
        1.65471e+08,
        1.09113e+08,
        "EUR",
        4.265e+08,
        0.7832385,
        0.7832385,
        5.34198e+08,
        "Pharmaceuticals - NEC",
        0.76222,
        null,
        2.428234e+09,
        null,
        1.31826e+08,
        2072,
        null,
        0.2383571,
        0.2831446,
        19.09,
        12.13,
        1.59166,
        14.61404,
        12.78947,
        4.77612,
        -17.46032,
        3.27969,
        1.93027,
        0.0714552,
        0.062648,
        0.11338530000000001,
        0.0714552,
        391945.5,
        "Healthcare",
        "BME:ALM",
        2.8004e+09,
        7.449e+08,
        3.17e+08,
        6.84985e+08,
        1.7295112e+08,
        1.7295112e+08,
        "http://www.almirall.com"
      ],
      "s": "BME:ALM"
    },
    {
      "f": [
        5.233055e+07,
        0.92337,
        0.61282,
        "Industria de Diseno Textil SA, known as Inditex SA, is a Spain-based company primarily engaged in the textile industry. The Company’s activities include the design, confection, manufacturing, distribution and retail of men, women and children apparel, footwear and fashion accessories, as well as home furnishings and household textile products. The Company’s business is divided into three segments: Zara, which provides various fashion and home items under the Zara brand name; Bershka, offering clothes under the Bershka brand name, which aims at teenagers, and Other, which retails apparel under Stradivarius, Oysho, Pull\u0026Bear and Massimo Dutti brand names, among others. The Company operates worldwide through numerous subsidiaries. It is controlled by Pontegadea Inversiones SL.",
        1.25401,
        0.94038,
        "Spain",
        "EUR",
        1.52052,
        1.97276,
        -1.625949e+09,
        0.95238,
        0.95238,
        4.841947e+09,
        1.355668e+09,
        "EUR",
        1.94483e+08,
        0.5866899,
        0.5866899,
        1.20893e+10,
        "Apparel \u0026 Accessories Retailers - NEC",
        0.92337,
        null,
        1.028184e+11,
        null,
        2.874584e+09,
        149948,
        null,
        0.17288209999999998,
        0.17522659999999998,
        33.55,
        26.595,
        9.49865,
        34.63953,
        25.58794,
        2.15204,
        4.99682,
        4.68532,
        1.05834,
        0.2551642,
        0.1733511,
        0.2860868,
        0.2551642,
        143567.1,
        "Services",
        "BME:ITX",
        1.7908814e+10,
        8.717362e+09,
        2.13302e+08,
        2.0900439e+10,
        3.113152e+09,
        3.113152e+09,
        "http://www.inditex.com/"
      ],
      "s": "BME:ITX"
    },
    {
      "f": [
        4.2686084e+08,
        0.26518,
        0.50101,
        "Amper SA is a Spain-based company primarily engaged in the communication and networking industry. The Company focuses on the manufacture and marketing of telecommunications equipment for voice, data and video transmission, design and installation of integrated communication networks, as well as development of solutions for emergency management and control centers, among others. Its activities are divided into two business lines: Telecommunications, as well as Communication and security. It offers products and services to customers active in various sectors, such as telecommunications, financial, public administration, defense and industrial. The Company operates in Spain, the United States, as well as in the Latin America and South Pacific region. It owns numerous subsidiaries, such as Amper Do Brasil Telecom Ltd, Amper Sistemas SA, DescaTransistemas SA and CTT Peru SAC.",
        0.19313,
        0.94038,
        "Spain",
        "EUR",
        0.70155,
        null,
        null,
        0.21602,
        0.20119,
        2.2508e+07,
        -1.8166e+07,
        "EUR",
        4.0882e+07,
        0.5594157,
        0.5594157,
        7.4371e+07,
        "Communications \u0026 Networking - NEC",
        0.16791,
        null,
        1.113116e+08,
        null,
        9.0044e+07,
        933,
        null,
        0.0929503,
        0.8254283,
        0.185,
        0.071,
        null,
        0.76545,
        1.01693,
        -4.93827,
        43.20886,
        0.87511,
        0.59115,
        null,
        0.5898490000000001,
        null,
        null,
        131810.4,
        "Technology",
        "BME:AMP",
        1.53988e+08,
        6.9427e+07,
        5.788e+07,
        1.29588e+08,
        7.0908931e+08,
        7.0908931e+08,
        "http://www.amper.es/"
      ],
      "s": "BME:AMP"
    },
    {
      "f": [
        1.70473e+06,
        0.99734,
        null,
        "Compania de Distribucion Integral Logista Holdings SA is a Spain-based company principally engaged in the logistics services. The Company focuses on developing an integrated logistics process, which connects manufacturers with points of sale and end customers. It provides services in the transportation of high-value documents, tobacco, tickets, phone cards, lottery games, pharmaceutical products, books and newspapers, among others. The Company offers full truckload (FTL) transport, warehousing, parcel and express courier delivery, as well as management of loyalty campaigns and promotional materials, among others. The Company operates in Europe through numerous group entities, such as Logista, Integra2, Logesta, Logistadis, MidSid, Nacex and Terzia. It is a subsidiary of Altadis SA.",
        1.68067,
        0.94038,
        "Spain",
        "EUR",
        0.84263,
        7.83483,
        -9.9373e+07,
        0.99745,
        0.99745,
        2.20789e+08,
        2.6436900000000003e+08,
        "EUR",
        9.19104e+08,
        0.10777419999999999,
        0.10777419999999999,
        1.0380820000000001e+09,
        "Integrated Logistics Operators",
        0.99734,
        null,
        2.903242e+09,
        null,
        1.3207900000000001e+08,
        5594,
        null,
        0.0183911,
        0.0194938,
        21.995,
        16.93,
        5.91587,
        21.92591,
        30.16074,
        4.74138,
        16.3917,
        0.30142,
        0.65748,
        0.158247,
        0.0200787,
        0.283582,
        0.158247,
        1.721846e+06,
        "Services",
        "BME:LOG",
        6.722817e+09,
        4.941695e+09,
        3.837e+07,
        9.632004e+09,
        1.3247439e+08,
        1.3247439e+08,
        "http://www.grupologista.com/"
      ],
      "s": "BME:LOG"
    },
    {
      "f": [
        8540,
        0.23297,
        0.08622,
        "Funespana SA is a Spain-based company principally engaged, through its subsidiaries, in the provision of funerary services. The Company’s activities include the construction and management of cemeteries, operation of funeral parlors and installation and maintenance of crematory ovens, as well as it provides hearse transport services. The Company is also active in the arrangement of burials, supply of gravestones and flowers, transport and repatriation of human remains, as well as in the organization of masses, memorials and wakes. The Company is a parent of Grupo Funespana, a group which comprises a number of controlled entities. In February 2013, the Company formalized the acquisition of a 100% stake in Funerarias Reunidas del Bierzo SA. It is a subsidiary of Mapfre Familiar de Seguros y Reaseguros Cia SA.",
        0.39833,
        0.94038,
        "Spain",
        "EUR",
        1.9947,
        44.76404,
        0,
        0.22207,
        0.22207,
        8.83e+06,
        2.575e+06,
        "EUR",
        2.5096e+07,
        0.3471799,
        0.3471799,
        3.8216e+07,
        "Funeral Services",
        0.23297,
        null,
        1.168203e+08,
        null,
        5.051e+06,
        477,
        null,
        0.0479684,
        0.045642800000000004,
        7.36,
        6.32,
        1.06266,
        28.59459,
        16.26797,
        -1.55039,
        -10.81461,
        1.10439,
        1.85313,
        0.0288352,
        0.024176700000000002,
        0.0383586,
        0.0288352,
        null,
        "Services",
        "BME:FUN",
        1.78652e+08,
        5.6837e+07,
        4.921e+07,
        1.10384e+08,
        1.83969e+07,
        1.83969e+07,
        "http://www.funespana.es/"
      ],
      "s": "BME:FUN"
    },
    {
      "f": [
        6.83912e+06,
        0.05614,
        null,
        "Euskaltel SA is a Spain-based company engaged in the provision of integrated telecommunication services. The Company's activities are divided into three segments: Residential, Business, as well as Wholesale and Other. The Residential segment provides fixed and mobile telecommunication services, broadband and wireless Internet, as well as digital television (TV) as a single service and in packages. The Business division primarily offers fixed and mobile telephony, as well as Internet access for enterprises. The Wholesale and Other area serves wholesale customers and is responsible for the delivery of communication services, such as infrastructure leasing, information technology (IT) outsourcing, as well as sell of installation material and electronics. The Company operates in the Basque Country, Spain.",
        0.71853,
        0.94038,
        "Spain",
        "EUR",
        0.94831,
        185.9683,
        -2.07033e+08,
        0.38968,
        0.38968,
        2.20598e+08,
        -1.76049e+08,
        "EUR",
        5.91442e+08,
        0.7930065999999999,
        0.7930065999999999,
        2.71832e+08,
        "Integrated Telecommunications Services - NEC",
        0.05614,
        null,
        1.231921e+09,
        null,
        7.241e+06,
        567,
        null,
        0.217579,
        0.1458736,
        11.6,
        7.614,
        1.68016,
        20.81965,
        7.03674,
        2.74823,
        -26.77798,
        2.65431,
        0.92394,
        0.0373467,
        0.034185099999999996,
        0.0964053,
        0.0373467,
        822909.6,
        "Services",
        "BME:EKT",
        2.316534e+09,
        1.60262e+08,
        1.361894e+09,
        3.43259e+08,
        1.5166118e+08,
        1.5166118e+08,
        "http://www.euskaltel.com"
      ],
      "s": "BME:EKT"
    },
    {
      "f": [
        1.540808e+07,
        1.56662,
        0.31848,
        "Amadeus IT Group SA, formerly Amadeus IT Holding SA, is a Spain-based company engaged in the provision of information technology (IT) services primarily for the tourism and travel industries. The Company’s activities are divided into two business segments: Distribution and IT Solutions. The Distribution division offers Global Distribution System (GDS), a worldwide computerized reservation system (CRS) used as a single point of access for booking airline seats, hotel rooms and other travel-related services by travel agencies and travel management companies. The IT Solutions division provides a range of technology solutions that automate core processes for travel providers. Its customers include full service carriers and low-cost airlines, hotel managers, rail operators, cruise and ferry operators, travel insurers and car rental companies, among others. The Company operates through numerous subsidiaries in Europe, the Americas, Asia, Africa and Australia.",
        2.48553,
        0.94118,
        "Spain",
        "EUR",
        0.65736,
        92.74253,
        -3.07257e+08,
        1.80533,
        1.80533,
        1.682999e+09,
        4.15595e+08,
        "EUR",
        2.7422e+09,
        0.7422631,
        0.7422631,
        2.86864e+09,
        "IT Services \u0026 Consulting - NEC",
        1.56662,
        null,
        1.857097e+10,
        null,
        6.83937e+08,
        13672,
        null,
        0.27007359999999997,
        0.2567229,
        45.24,
        32.29,
        6.81,
        23.4417,
        14.5179,
        0.73792,
        13.90122,
        4.28443,
        null,
        0.1530959,
        0.1095311,
        0.3155712,
        0.1530959,
        338450,
        "Technology",
        "BME:AMS",
        7.6639e+09,
        1.1187e+09,
        2.52e+09,
        3.912702e+09,
        4.372433e+08,
        4.372433e+08,
        "http://www.amadeus.com"
      ],
      "s": "BME:AMS"
    },
    {
      "f": [
        4.211535e+07,
        -0.87253,
        0.66243,
        "Abertis Infraestructuras SA is a Spain-based company primarily engaged in the management of highway infrastructure. The Company's activities are divided into two business segments: Toll roads and Telecommunications. The Toll roads division focuses on construction, maintenance and operation of highways, which are located in Spain, France, Brazil, Chile, the United States and Canada, among others. The Telecommunications division manages and operates satellite infrastructure, through Hispasat, and transmission towers for mobile telephony and audiovisual broadcasting, through Cellnex Telecom. The Company controls numerous subsidiaries, such as Abertis Autopistas Espana SA, Abertis Motorways UK Ltd, Autopistas Metropolitanas de Puerto Rico and Abertis Telecom Satelites SA.",
        -0.04482,
        0.94038,
        "Spain",
        "EUR",
        1.04221,
        264.6177,
        -5.78848e+08,
        0.81519,
        0.81519,
        1.349223e+09,
        -2.9776e+07,
        "EUR",
        null,
        null,
        null,
        4.229227e+09,
        "Highways \u0026 Rail Tracks - NEC",
        -0.87253,
        null,
        1.324635e+10,
        null,
        1.879912e+09,
        14912,
        null,
        0.3934569,
        0.2718903,
        14.385,
        11.56191,
        1.85834,
        16.40722,
        null,
        4.20725,
        4.60893,
        2.94745,
        null,
        0.0372585,
        0.0329126,
        0.12420909999999999,
        0.0372585,
        293698.9,
        "Transportation",
        "BME:ABE",
        3.1232e+10,
        4.716e+09,
        1.7306e+10,
        4.2101800000000005e+09,
        9.0867453e+08,
        9.0867453e+08,
        "http://www.abertis.com"
      ],
      "s": "BME:ABE"
    },
    {
      "f": [
        0,
        0.39868,
        null,
        "Let's Gowex SA is a Spain-based company engaged in the telecommunications sector. The Company’s main activities comprise the commercial transactions of Internet broadband with other telecommunication operators, the provision of information storage services and the offering of wireless Internet access in urban streets and transportation. The Company operates domestically and worldwide in such cities as Buenos Aires, Panama City, Bordeaux and Langreo. As of December 31, 2011, the Company owned such fully consolidated subsidiaries as Iber Wifimas SLU, Wifiactiva SLU, Gowex Wireless SLU and Gowex Caceres SLU, and Cash Devices SL was its major shareholder with 30.29% of its interest. In July 2013, the Company acquired Ideup. In March 2014, the Company started providing services in Africa through Yattoo, a Republic of Congo Internet provider. On July 2014, the Company filed for bankruptcy.",
        0.58381,
        0.94038,
        "Spain",
        "EUR",
        2.49635,
        31.32718,
        -1e+06,
        0.39868,
        0.39868,
        5.307599e+07,
        -2.103232e+07,
        "EUR",
        null,
        0.5359632,
        0.5359632,
        9.787926e+07,
        "Wi-Fi \u0026 Wi-Max Providers",
        0.39868,
        null,
        5.804247e+08,
        null,
        2.88301e+07,
        172,
        null,
        0.2128403,
        0.2159655,
        null,
        null,
        null,
        null,
        13.7484,
        null,
        null,
        3.17827,
        2.4961,
        0.2790626,
        0.2190264,
        0.3502349,
        0.2790626,
        1.061762e+06,
        "Services",
        "BME:GOW",
        1.6286593e+08,
        1.0048402e+08,
        2.978872e+07,
        1.8262309e+08,
        7.184942e+07,
        7.184942e+07,
        null
      ],
      "s": "BME:GOW"
    },
    {
      "f": [
        3.724928e+07,
        -0.38158,
        1.12292,
        "Corporacion Empresarial de Materiales de Construccion SA, formerly Uralita SA, is a Spain-based company primarily engaged in the production and distribution of construction materials. The Company’s activities are structured in two divisions: Gypsum and Pipes. The Gypsum division provides plasterboard and drywall systems, as well as a variety of plasters under the Pladur and Algiss brand names. The Pipes division includes the Adequa brand name that manufactures and sells pipes and fittings for drainage, sewerage and soundproof systems, gutters, as well as siphons, among others. The Company is a parent of the Uralita Group, a group which comprises a number of controlled entities. Furthermore, It is a subsidiary of Nefinsa SA.",
        -0.22089,
        0.94038,
        "Spain",
        "EUR",
        0.90942,
        217.8163,
        null,
        -0.33875,
        -0.33875,
        1.948e+06,
        -2.6961e+07,
        "EUR",
        null,
        0.5917574,
        0.5917574,
        7.6421e+07,
        "Construction Supplies \u0026 Fixtures - NEC",
        -0.38158,
        null,
        1.214624e+08,
        null,
        -7.5993e+07,
        569,
        null,
        -0.1478644,
        -0.1486481,
        0.79,
        0.215,
        10.90379,
        null,
        null,
        -6.10687,
        127.77778,
        0.93323,
        0.55019,
        -1.243167,
        -0.1360108,
        -22.04484,
        -1.243167,
        241471.3,
        "Capital Goods",
        "BME:CMC",
        2.05316e+08,
        4.8541e+07,
        2.3021e+07,
        1.2974600000000001e+08,
        1.8738559e+08,
        1.8738559e+08,
        "http://www.coemac.com/es-ES/Paginas/default.aspx"
      ],
      "s": "BME:CMC"
    },
    {
      "f": [
        959970,
        0.11563,
        0.62459,
        "Fluidra SA is a Spain-based company engaged, through its subsidiaries, in the provision of water use services. The Company mainly specializes in the manufacture and distribution of machinery and assemblies related to the handling, conservation and treatment of water under such brand names as AustralPool, Certikin, Gre, CTX, Idrania, Ath, Astramatic, WaterLinx, EGT Aqua and Cepex. The Pool and Wellness unit specializes in the production of components for both private and public swimming pools and wellness facilities. The Water Treatment area is focused on the treatment of water for domestic, industrial and leisure purposes. The Irrigation unit is responsible for the supply of the components needed to build irrigation systems for agricultural use, green spaces and residential gardens. The Fluid handling unit manufactures products for domestic and industrial use in variety of sectors. The Company operates worldwide in the Americas, Europe, Africa, Asia and Australia.",
        0.44067,
        0.94038,
        "Spain",
        "EUR",
        1.77428,
        85.50209,
        -8.806e+06,
        0.18869,
        0.18869,
        7.9364e+07,
        1.7788e+07,
        "EUR",
        1.90846e+08,
        0.507452,
        0.507452,
        3.36638e+08,
        "Construction Supplies \u0026 Fixtures - NEC",
        0.11563,
        null,
        4.538951e+08,
        null,
        1.2997e+07,
        4463,
        null,
        0.0466134,
        0.048100300000000006,
        4.6,
        2.95,
        1.3817,
        21.35778,
        6.57133,
        -0.86101,
        31.91489,
        0.64213,
        1.13056,
        0.03965,
        0.027136399999999998,
        0.0646739,
        0.03965,
        190681.7,
        "Capital Goods",
        "BME:FDR",
        8.44382e+08,
        4.7283e+08,
        2.77161e+08,
        6.61781e+08,
        1.1113808e+08,
        1.1113808e+08,
        "http://www.fluidra.com/"
      ],
      "s": "BME:FDR"
    },
    {
      "f": [
        22400,
        1.05339,
        0.53338,
        "Altia Consultores SA is a Spain-based company primarily engaged in the provision of information technology (IT) services. The Company's activities are divided into three business areas: Services, Products and Managed Services. The Services area offers IT and busness advisory services, development of IT systems, outsourcing, as well as complementary hardware and software, among others. The Products line is responsible for the development of software platforms, such as Flexia and Mercurio. The Managed Services division provides customized, long-term solutions, including business continuity plan in case of information loss, infrastructure as a service (IaaS), as well as management and monitoring of IT systems, among others. The Company cooperates with a numner of entites, such as IBM, McAfee, Hewlett-Packard (HP), Hitachi Data Systems, Oracle and Microsoft. It is a subsidiary of Boxleo Tic SL.",
        1.19257,
        0.94038,
        "Spain",
        "EUR",
        3.15857,
        1.40175,
        -1.10051e+06,
        1.14599,
        1.14599,
        1.137652e+07,
        6.55835e+06,
        "EUR",
        1.4505e+06,
        0.5801827,
        0.5801827,
        3.965696e+07,
        "IT Services \u0026 Consulting - NEC",
        1.05339,
        null,
        1.161038e+08,
        null,
        7.24539e+06,
        755,
        null,
        0.14987640000000002,
        0.1509959,
        19,
        11.43,
        4.10919,
        14.72962,
        13.26291,
        7.58445,
        38.58785,
        1.65309,
        3.10156,
        0.30321339999999997,
        0.20170349999999998,
        0.3125645,
        0.30321339999999997,
        95168.39,
        "Technology",
        "BME:ALC",
        3.920321e+07,
        3.2649459999999996e+07,
        396030,
        6.529367000000001e+07,
        6.87766e+06,
        6.87766e+06,
        null
      ],
      "s": "BME:ALC"
    },
    {
      "f": [
        710480,
        0.25347,
        0.60358,
        "Renta Corporacion Real Estate SA is a Spain-based company engaged in the real estate sector. The Company main activities comprise the acquisition, rehabilitation and sale of real estate properties in central locations of major cities. Its properties portfolio includes residential and urban buildings, as well as offices and large-scale property complexes. The Company is a parent of Grupo Renta Corporacion, a group which comprises such entities as Renta Corporacion Real Estate Finance SL, RC Real Estate Deutschland GmbH, Renta Properties (UK) LTD and Medas Corporacion Sarl, among others. On March 27, 2013, the Company entered bankruptcy proceedings. In December 2013, the Commercial Court No. 9 9 declared that the common phase of the proceedings 203/2013, 204/2013, 205/2013 and 206/2013 of the Company, Renta Corporacion Real Estate Finance, Renta Corporacion Real Estate and Renta Corporacion Core Business, was completed. In July 2014, it emerged from insolvency.",
        0.25506,
        0.94038,
        "Spain",
        "EUR",
        3.21212,
        84.22713,
        null,
        0.10319,
        0.10319,
        4.825e+06,
        -43000,
        "EUR",
        null,
        0.2849253,
        0.2849253,
        5.878e+06,
        "Real Estate Development \u0026 Operations - NEC",
        0.25347,
        null,
        5.985709e+07,
        null,
        8.247e+06,
        22,
        null,
        0.2364022,
        0.19009810000000002,
        2.23,
        1.41,
        1.85128,
        17.63737,
        29.42826,
        1.11111,
        8.98204,
        2.95168,
        0.47273,
        0.0654701,
        0.048041799999999996,
        0.11064460000000001,
        0.0654701,
        null,
        "Services",
        "BME:REN",
        7.01e+07,
        5.3e+07,
        2.67e+07,
        4.2079e+07,
        3.224478e+07,
        3.224478e+07,
        "http://www.rentacorporacion.com"
      ],
      "s": "BME:REN"
    },
    {
      "f": [
        8.829e+06,
        0.43961,
        1.26107,
        "Atresmedia Corporacion de Medios de Comunicacion SA is a Spain-based company primarily engaged in the television (TV) broadcasting. The Company’s activities are divided into three business segments: Television, which specializes in TV broadcasting through its network of channels, such as Antena 3, Neox, Nova, Atresseries and LaSexta; Radio, which focuses on radio broadcasting through a number of radio stations, including Onda Cero, Europa FM and Melodia FM, and Others, which offers advertising services, production of motion pictures and TV movies, as well as development of promotional events, among others. The Company transmits programs in Spain, Colombia, Mexico and the United States, among others.",
        0.51671,
        0.94038,
        "Spain",
        "EUR",
        1.09494,
        30.08185,
        -6.2913e+07,
        0.58219,
        0.58219,
        1.97641e+08,
        -750000,
        "EUR",
        1.50012e+08,
        0.5450953,
        0.5450953,
        4.5906e+08,
        "Television Broadcasting",
        0.43961,
        null,
        2.383738e+09,
        null,
        9.9234e+07,
        1901,
        null,
        0.17867750000000002,
        0.16865549999999999,
        11.79,
        7.42,
        4.42658,
        18.13841,
        15.96449,
        5.28415,
        4.14201,
        2.35436,
        0.40783,
        0.1848311,
        0.105573,
        0.2547102,
        0.1848311,
        540564.9,
        "Services",
        "BME:A3M",
        1.25015e+09,
        6.17135e+08,
        1.61424e+08,
        9.70206e+08,
        2.2494092e+08,
        2.2494092e+08,
        "http://www.atresmedia.com"
      ],
      "s": "BME:A3M"
    },
    {
      "f": [
        1.98386e+06,
        -0.03608,
        null,
        "Oryzon Genomics SA is a Spain-based biopharmaceutical company. It is engaged in the field of epigenetic medicine and in the development of therapeutic, biological solutions for cancer and neurodegenerative diseases. The Company’s business model focuses on identifying biomarkers that can be translated in new therapeutic targets, as well as on investing in programs, mainly through the development of small molecules for two main indications: cancer and neurodegeneration. The Company develops investigational medicines till proof of concept (POC) phase and then partners the program with pharmaceutical entities, which are able to get the approval from drug agencies to bring these medicines to the patients. It cooperates with Roche. The Company is a subsidiary of Laboratorio Reig Jofre SA.",
        -0.00347,
        0.94038,
        "Spain",
        "EUR",
        5.13075,
        98.78969,
        null,
        null,
        null,
        null,
        -2.53104e+06,
        "EUR",
        null,
        null,
        null,
        2.13535e+06,
        "Biotechnology \u0026 Medical Research - NEC",
        -0.03608,
        null,
        1.3009800000000001e+08,
        null,
        -991900,
        34,
        null,
        null,
        null,
        5.2,
        2.55,
        5.24698,
        null,
        null,
        -6.71566,
        -0.65217,
        null,
        5.12886,
        null,
        null,
        null,
        null,
        null,
        "Healthcare",
        "BME:ORY",
        5.067966e+07,
        3.02668e+07,
        2.369861e+07,
        4.25359e+06,
        2.754255e+07,
        2.754255e+07,
        "https://www.oryzon.com/"
      ],
      "s": "BME:ORY"
    },
    {
      "f": [
        4.26349e+06,
        0.1208,
        0.70534,
        "Faes Farma SA is a Spain-based company engaged in the pharmaceutical industry. The Company specializes in the research, production, distribution and sale of prescription and generic drugs, over-the-counter (OTC) medicines, food supplements and personal care treatments, as well as raw materials for the pharmaceutical use. The Company’s research lines are mainly focused on the development of new drugs for the treatment of allergy, venous insufficiency and irritable bowel syndrome, among others. The Company operates in Spain, Portugal, Chile and Mexico, among others. It controls a number of subsidiaries, such as Laboratorios Vitoria SA, Laboratorios Veris SA, Lazlo International SA, Ingaso Farm SLU, Esfion SA and Biotecnet I MAS D SA.",
        0.14357,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        -4.821e+06,
        0.13998,
        0.13984,
        5.343e+07,
        2.5945e+07,
        "EUR",
        null,
        0.4765974,
        0.4765974,
        1.33769e+08,
        "Pharmaceuticals - NEC",
        0.12066,
        null,
        8.71985e+08,
        null,
        3.0361e+07,
        838,
        null,
        0.2029432,
        0.2042902,
        3.8,
        2.3,
        null,
        24.45652,
        20.90339,
        2.24215,
        29.07387,
        4.00878,
        null,
        null,
        null,
        null,
        null,
        289254,
        "Healthcare",
        "BME:FAE",
        null,
        null,
        null,
        2.04724e+08,
        null,
        null,
        "http://faesfarma.com/"
      ],
      "s": "BME:FAE"
    },
    {
      "f": [
        58510,
        1.48492,
        0.26995,
        "Iberpapel Gestion SA is a Spain-based holding company engaged in the paper industry. The Company operates through three divisions: Forestry, involved in the acquisition and cultivation of eucalyptus plantations in Argentina, Uruguay and Spain; Industrial, focused on the production of bleached pulp and paper products, and Commercial, specialized on the distribution of products such as printing and photocopy paper, offset paper, light-coated paper, laser printing paper, paper bags and envelopes. The Company’s subsidiaries include Distribuidora Papelera SA, Moliner Dominguez y Cia SA, Ibereucaliptos SA, Papelera Guipuzcoana de Zicunaga SA, Central de Suministros de Artes Graficas Papel SA and Copaimex SA, among others. The Company’s major shareholders include ONCHENA, SL and BESTINVER GESTION, SA.",
        2.3971,
        0.94038,
        "Spain",
        "EUR",
        3.1235,
        1.8202,
        -4.8e+06,
        1.87331,
        1.87331,
        3.6312e+07,
        1.5671e+07,
        "EUR",
        null,
        0.5963052,
        0.5963052,
        1.2822999999999999e+08,
        "Paper Mills \u0026 Products",
        1.48492,
        null,
        2.328202e+08,
        null,
        1.6111e+07,
        300,
        null,
        0.1286237,
        0.12811730000000002,
        22,
        15.2647,
        1.05661,
        11.37025,
        7.79575,
        -2.29358,
        34.11113,
        1.15591,
        2.48005,
        0.0865658,
        0.0731616,
        0.090701,
        0.0865658,
        666943.7,
        "Basic Materials",
        "BME:IBG",
        2.64897e+08,
        1.10781e+08,
        3.992e+06,
        2.18237e+08,
        1.087942e+07,
        1.087942e+07,
        "http://www.iberpapel.es"
      ],
      "s": "BME:IBG"
    },
    {
      "f": [
        2.682029e+07,
        1.46699,
        0.87263,
        "Gas Natural SDG SA is a Spain-based company active in the energy sector. The Company's activities are divided into four main business segments: the Gas distribution, which includes gas distribution networks and distribution activity in Spain, Italy and Latin America; the Electricity distribution, which provides electricity distribution and network property in Spain, Moldova and Latin America; the Gas supply, which is active in gas midstream activity, as well as supply to retail, industrial, power plants and wholesale clients in Spain or international, and the Electricity Generation, which focuses on the generation of electric and supply in Spain and internationally. ",
        3.57853,
        0.94038,
        "Spain",
        "EUR",
        1.1224,
        133.8813,
        -1.07e+09,
        1.25913,
        1.25913,
        4.619e+09,
        5.36e+08,
        "EUR",
        null,
        0.33513800000000005,
        0.33513800000000005,
        null,
        "Natural Gas Utilities - NEC",
        1.46699,
        null,
        1.7141810000000002e+10,
        null,
        1.502e+09,
        19774,
        null,
        0.1276905,
        0.09133319999999999,
        19.715,
        14.685,
        1.18407,
        13.60463,
        5.18663,
        2.79028,
        -10.14949,
        0.75451,
        1.02957,
        0.043491999999999996,
        0.0336279,
        0.08717309999999999,
        0.043491999999999996,
        1.139425e+06,
        "Utilities",
        "BME:GAS",
        4.75e+10,
        8.996e+09,
        1.9382e+10,
        2.6015e+10,
        1.00068934e+09,
        1.00068934e+09,
        "http://www.gasnaturalfenosa.com"
      ],
      "s": "BME:GAS"
    },
    {
      "f": [
        2.4779e+07,
        0.1992,
        0.76567,
        "ENCE Energia y Celulosa SA, formerly Grupo Empresarial ENCE SA, is a Spain-based company engaged in the operation of pulp mills. The Company' activities are divided into two business units: Pulp and Energy. The Pulp business unit is subdivided into three segments: Pulp, manufacturing pulp and pulp derivatives, such as lignin and biomass, as well as co-generating energy; Forest Management, providing forest crops and wood raw materials, and Forest Services \u0026 Other, including residual business activities, as well as forest support services. The Energy business unit focuses on generating energy using forestry and agricultural biomass. The Company operates pulp mills and power generation plants in Spain. Its subsidiaries include Celulosa Energia SAU, Silvasur Agroforestal SAU and Ibersilva SAU, among others.",
        0.43487,
        0.94038,
        "Spain",
        "EUR",
        1.68366,
        71.82211,
        -3.584e+07,
        0.15261,
        0.15261,
        4.1371989999999995e+09,
        2.0807e+07,
        "EUR",
        null,
        0.43708640000000004,
        0.43708640000000004,
        2.43013e+08,
        "Paper Products - NEC",
        0.1992,
        null,
        5.73124e+08,
        null,
        4.9855e+07,
        884,
        null,
        0.11089750000000001,
        0.08343550000000001,
        3.645,
        1.8,
        1.0246,
        15.00557,
        5.07369,
        4.56621,
        -31.43713,
        0.94433,
        1.45,
        0.0398191,
        0.0326776,
        0.0704265,
        0.0398191,
        712338,
        "Basic Materials",
        "BME:ENC",
        1.1796e+09,
        3.401e+08,
        3.989e+08,
        6.63912e+08,
        2.4850001e+08,
        2.4850001e+08,
        "http://www.ence.es/"
      ],
      "s": "BME:ENC"
    },
    {
      "f": [
        2.823882e+07,
        1.12001,
        0.62456,
        "Red Electrica Corporacion SA is a Spain-based company engaged in the energy sector. The Company, through Red Electrica de Espana SAU (REE), focuses on the management of the Spanish high-voltage transmission grid, as well as is responsible for its development, maintenance and improvement of the network’s installations. Its activities also include the coordination among generation, transmission and distribution process of electric energy. In addition, the Company manages and leases telecommunications infrastructure, in particular fiber optic cables. The Company is a parent of the Red Electrica Group and operates through its subsidiaries and affiliates in a number of countries, such as Spain, the Netherlands, Luxembourg, Peru, Chile and France.",
        2.02604,
        0.94038,
        "Spain",
        "EUR",
        0.96416,
        0,
        -4.04825e+08,
        1.1631,
        1.1631,
        1.504243e+09,
        4.62425e+08,
        "EUR",
        null,
        0.9939235,
        0.9939235,
        1.911793e+09,
        "Electric Utilities - NEC",
        1.12001,
        null,
        9.506775e+09,
        null,
        6.06013e+08,
        1767,
        null,
        0.5199279,
        0.4387681,
        20.685,
        16.255,
        3.30327,
        15.10618,
        8.39897,
        3.29218,
        -9.12852,
        4.93109,
        null,
        0.0699901,
        0.05942529999999999,
        0.2250517,
        0.0699901,
        1.093548e+06,
        "Utilities",
        "BME:REE",
        1.0692338e+10,
        1.517122e+09,
        0,
        1.938939e+09,
        5.3961018e+08,
        5.3961018e+08,
        null
      ],
      "s": "BME:REE"
    },
    {
      "f": [
        6.2233655e+08,
        0.37456,
        1.31302,
        "Banco Bilbao Vizcaya Argentaria, S.A. is a diversified international financial company engaged in retail banking, asset management, private banking and wholesale banking. The Company operates through seven segments: Banking Activity in Spain, Real Estate Activity in Spain, Turkey, Rest of Eurasia, Mexico, South America and United States. In addition to these, the Company has a Corporate Center. Its Banking Activity in Spain segment includes all of its banking and non-banking businesses in Spain. It Real Estate Activity in Spain segment provides management of the real estate assets. Its Turkey segment represents its stake in the Turkish bank Turkiye Garanti Bankasi A.S. The Rest of Eurasia segment includes the retail and wholesale banking businesses. Its Mexico segment consists of the banking and insurance businesses. Its South America segment manages its banking and insurance businesses. The United States segment includes its business in the United States.",
        0.7092,
        0.94038,
        "Spain",
        "EUR",
        null,
        226.4007,
        -8.79e+08,
        0.5344,
        0.5344,
        1.6875e+10,
        1.948e+10,
        "EUR",
        6.692e+09,
        null,
        null,
        null,
        "Banks - NEC",
        0.37456,
        null,
        4.2486e+10,
        null,
        2.643e+09,
        137904,
        934244,
        0.20200949999999998,
        0.20200949999999998,
        7.01277,
        4.44089,
        0.88773,
        12.10704,
        6.70232,
        5.68442,
        -1.89382,
        1.28964,
        null,
        null,
        0.006712,
        0.0751287,
        null,
        null,
        "Financial",
        "BME:BBVA",
        7.24627e+11,
        null,
        1.07692e+11,
        null,
        6.52650372e+09,
        6.52650372e+09,
        "http://www.bbva.com"
      ],
      "s": "BME:BBVA"
    },
    {
      "f": [
        3.36582e+06,
        0.81624,
        null,
        "Lar Espana Real Estate SOCIMI SA is a Spain-based company primarily engaged in the operation of retail Real Estate Investment Trusts (REITs). The Company specializes in acquiring, managing and renting real estate assets within the Spanish market. Its business activities are divided into three segments: Shopping Centers, Offices, as well as Logistics. The Shopping Centers area is responsible for operation of a number of shopping malls, namely Txingudi, Las Huertas, Albacenter, Anec Blau, Hiper Albacenter, and Nuevo Alisal, among others. The Offices segment invests in office properties, such as Arturo Soria, Cardenal Marcelo Spinola, Egeo and Eloy Gonzalo. The Logistics division focuses on managing logistics warehouses, including Alovera I and Alovera II. The Company also owns a plot for residential properties development. It is a parent of a number of entities, such as Lar Espana Inversion Logistica SA, Gran Via Centrum Holdings SAU, Global Noctua and Puerta Maritima Ondara.",
        null,
        0.94038,
        "Spain",
        "EUR",
        2.74682,
        60.54067,
        -1.331e+06,
        1.021,
        1.021,
        3.1879e+07,
        -1.15509e+08,
        "EUR",
        null,
        0.5215739,
        0.5215739,
        1.6024e+07,
        "Retail REITs",
        0.81624,
        null,
        6.374056e+08,
        null,
        4.3559e+07,
        4,
        null,
        1.3812790000000001,
        1.171324,
        8.77603,
        5.9374,
        0.85415,
        6.8952,
        null,
        1.4117,
        -14.62831,
        11.70325,
        null,
        0.0622053,
        0.06077,
        0.0986708,
        0.0622053,
        1.815467e+07,
        "Services",
        "BME:LRE",
        1.240186e+09,
        7.8485e+07,
        4.51249e+08,
        3.5734e+07,
        9.043377e+07,
        9.043377e+07,
        "http://larespana.com"
      ],
      "s": "BME:LRE"
    },
    {
      "f": [
        5.604868e+07,
        4.87334,
        0.93232,
        "Bayer AG is a life science company. The Company's segments are Pharmaceuticals, Consumer Health, Crop Science, Animal Health and Covestro. The Pharmaceuticals segment is engaged in the development of prescription pharmaceuticals; contraceptives, and medical products, such as injection systems and contrast agents for diagnostic procedures. The Consumer Health segment is engaged in the development of over-the-counter medications, dermatology products and nutritional supplements. The Crop Science segment is engaged in the development of product portfolio in the areas of seeds and plant traits, crop protection, home and garden, the green industry and nonagricultural pest control. The Animal Health segment is engaged in the development of veterinary medicines and animal grooming products. Covestro is engaged in the development of raw materials for polyurethanes; polycarbonate resins and sheets; raw materials for coatings, adhesives and sealants; and selected chemical intermediates.",
        8.55072,
        0.94118,
        "Germany",
        "EUR",
        1.50926,
        82.19629,
        -1.869e+09,
        5.45379,
        5.45379,
        1.1326e+10,
        2.509e+09,
        "EUR",
        1.594e+10,
        0.5609493,
        0.5609493,
        2.5166e+10,
        "Pharmaceuticals - NEC",
        4.87334,
        null,
        7.956065e+10,
        null,
        4.11e+09,
        115176,
        null,
        0.1547722,
        0.1317109,
        119.05,
        83.45,
        3.4009,
        17.64094,
        9.92275,
        9.13113,
        -12.41693,
        1.71956,
        1.00827,
        0.0831946,
        0.0625281,
        0.196617,
        0.0831946,
        396130.1,
        "Healthcare",
        "BME:BAY",
        7.6534e+10,
        2.517e+10,
        1.9229e+10,
        4.6324e+10,
        8.2694781e+08,
        8.2694781e+08,
        "http://www.bayer.de/"
      ],
      "s": "BME:BAY"
    },
    {
      "f": [
        832630,
        0.01039,
        0.02023,
        "Inkemia IUCT Group SA is a Spain-based company primarily specialized in the biotechnological sector. The Company provides products and services for chemical, pharmaceutical, biopharmaceutical, life science and related industry. The Company’s activity is related to the generation, promotion, development and sale of products and services. The Company transforms its knowledge and know-how into a pipeline of products, processes, services and technological platforms. Its solutions are specialized, integrated and protected by patents. The main areas of expertise are related to drugs development, industrial biotechnology and green chemistry. The Company has a number of subsidiaries, including IUCT SA and IUCT Empren SL.",
        0.07311,
        0.94038,
        "Spain",
        "EUR",
        0.75227,
        62.37364,
        null,
        0.00318,
        0.00318,
        -364840,
        -2.0935000000000002e+06,
        "EUR",
        null,
        1.62698,
        1.62698,
        2.4462e+06,
        "Biopharmaceuticals",
        0.01039,
        null,
        5.676809e+07,
        null,
        265630,
        45,
        null,
        -0.4843806,
        -0.6905454,
        2.36,
        1.93,
        3.08354,
        688.6793,
        34.16554,
        -0.45455,
        13.4715,
        30.56485,
        null,
        0.0031174,
        0.0027264,
        0.0044615,
        0.0031174,
        null,
        "Healthcare",
        "BME:IKM",
        3.052667e+07,
        3.31673e+06,
        1.132361e+07,
        2.0381999999999998e+06,
        2.556166e+07,
        2.556166e+07,
        "http://www.inkemia.com"
      ],
      "s": "BME:IKM"
    },
    {
      "f": [
        0,
        -0.56613,
        null,
        "Reyal Urbis SA is a Spanish company engaged, together with its subsidiaries, in the real estate sector. Its activities are structured in four segments. The Residential Developments business area comprises the construction and promotion of urban properties and dwelling developments in Spain. The Assets business area includes the administration of residential and non-residential properties, such as offices, shopping centers, business premises and industrial units. In the Land Management area, the Company has a portfolio of land plots located in over 30 cities in Spain, Portugal and the United States. The Rafaelhoteles area is active in the management of the Rafaelhoteles hotel chain. As of December 31, 2011, Inversiones Globales Inveryal SL was its majority shareholder with 70.24% of its interest. In March 2013, the Company entered bankruptcy proceedings.",
        -0.56113,
        0.94038,
        "Spain",
        "EUR",
        0.2129,
        null,
        null,
        -0.45808,
        -0.45808,
        1.0909e+07,
        7.2191e+07,
        "EUR",
        null,
        0.531541,
        0.531541,
        1.3826e+07,
        "Real Estate Services - NEC",
        -0.56613,
        null,
        3.623363e+07,
        null,
        -1.55095e+08,
        336,
        null,
        0.1859363,
        -1.988656,
        null,
        null,
        null,
        null,
        null,
        0,
        0,
        0.54512,
        0.00931,
        null,
        -0.1054185,
        null,
        null,
        null,
        "Services",
        "BME:REY",
        1.232916e+09,
        9.50098e+08,
        3.851442e+09,
        1.14695e+08,
        2.7395794e+08,
        2.7395794e+08,
        "http://www.reyalurbis.com/"
      ],
      "s": "BME:REY"
    },
    {
      "f": [
        1.1781e+06,
        -0.0815,
        0.8972,
        "Fersa Energias Renovables SA is a Spain-based holding company that is primarily involved in the promotion and development of renewable energy projects. The Company generates electricity from renewable sources, such as wind energy and to lesser extent solar energy. The Company’s installed power in Spain is 139.3 Megawatt (MW), and in France is 12 MW, as well as the Company has two wind farms operating in India, Gadaj and Hanumanhati, with total installed capacity of 81.6 MW. The Company operates through its subsidiaries in Spain, France and India, which include Eolica El Pedregoso SL, Eolica del Pino SL, Parque Eolica Hinojal SL, Gestora Fotovoltaica de Castellon SL and Parc Eolic Mudefer SL, Eolinnes de Beausemblant SAS, Generacion Eolica India Limited and EN Renewable Energy Limited.",
        -0.0199,
        0.94038,
        "Spain",
        "EUR",
        0.90526,
        147.0835,
        -127000,
        -0.14096,
        -0.14096,
        1.5017e+07,
        -3.0042e+07,
        "EUR",
        3.489e+06,
        null,
        null,
        2.8671e+07,
        "Renewable IPPs",
        -0.0815,
        null,
        6.440174000000001e+07,
        null,
        -5.3467e+07,
        17,
        null,
        -0.5068538,
        -0.8425982999999999,
        0.52,
        0.335,
        0.69296,
        null,
        null,
        0,
        24.32432,
        2.32926,
        null,
        -0.0801915,
        -0.0680626,
        -0.19446290000000002,
        -0.0801915,
        1.626412e+06,
        "Utilities",
        "BME:FRS",
        2.79976e+08,
        2.1337e+07,
        1.36695e+08,
        2.8477e+07,
        1.4000378e+08,
        1.4000378e+08,
        "http://www.fersa.es"
      ],
      "s": "BME:FRS"
    },
    {
      "f": [
        2.01174e+06,
        0.00964,
        0.17249,
        "Neuron BioPharma SA is a Spain-based company engaged in the biotechnology sector. The Company is active in the discovery and development of pharmaceutical compounds aimed at the prevention and treatment of various neurodegenerative diseases, with a main focus in the research on Alzheimer's disease. In addition, the Company operates also in three platforms: Drug Discovery, Pre-clinical development and Clinical development. The Drug Discovery platform uses neuron and hepatic human cells for the research on chemical entities with neuroprotective and hypocholesterolemic activity; the Pre-clinical development platform analyses the bio-safety of its compounds by using cell cultures, zebrafish, mice and rats, and the Clinical development platform covers tests on humans. As of December 31, 2011, Rustrainvest SA was the Company’s major shareholder with 12% of its interest.",
        0.1641,
        0.94038,
        "Spain",
        "EUR",
        0.34921,
        288.473,
        null,
        -0.23617,
        -0.23617,
        -884380,
        -1.66297e+06,
        "EUR",
        null,
        2.9691899999999998,
        2.9691899999999998,
        138190,
        "Bio Therapeutic Drugs",
        0.00964,
        null,
        1.429994e+07,
        null,
        88500,
        24,
        null,
        -10.62557,
        -12.03183,
        1.63772,
        0.89,
        1.52303,
        null,
        null,
        3.66972,
        -6.99763,
        47.0207,
        null,
        -0.1031382,
        -0.0811608,
        -0.2984366,
        -0.1031382,
        null,
        "Healthcare",
        "BME:NEU",
        3.223124e+07,
        2.35959e+06,
        1.993305e+07,
        201450,
        9.31317e+06,
        9.31317e+06,
        "http://neuronbio.com/"
      ],
      "s": "BME:NEU"
    },
    {
      "f": [
        1.047946e+07,
        0.55685,
        1.89196,
        "Quabit Inmobiliaria SA, formerly Astroc Mediterraneo SA, is a Spain-based company principally engaged in the residential real estate development. The Company's activities are divided into three business segments: Land management, Promotion and Rental. The Land management division focuses on acquisition, transformation and sale of plots for further real estate development. The Promotion division is responsible for the development, construction and management of residential properties, mainly located in the central zone, Valencian Community and Aragon, Spain. The Rental division includes administration, leasing and sale of real estate portfolio. The Company operates through a number of subsidiaries, such as Grupo Mediterraneo Costa Blanca SL, Quabit Inmobiliaria Internacional SL and Iber Activos Inmobiliarios SL.",
        0.55185,
        0.94038,
        "Spain",
        "EUR",
        1.21268,
        223.3605,
        null,
        0.64849,
        0.64849,
        3.490194e+07,
        1.005593e+07,
        "EUR",
        null,
        -1.0252299999999999,
        -1.0252299999999999,
        -2.66349e+07,
        "Residential  Real Estate Development",
        0.55685,
        null,
        1.108564e+08,
        null,
        2.168715e+07,
        35,
        null,
        0.7030253999999999,
        0.4501284,
        2.95238,
        1.27429,
        1.13542,
        3.22287,
        4.58988,
        7.06967,
        -21.625,
        2.63777,
        0.07488,
        0.21845230000000002,
        0.0599448,
        0.3753183,
        0.21845230000000002,
        1.273532e+06,
        "Capital Goods",
        "BME:QBT",
        3.53053e+08,
        2.75711e+08,
        2.17982e+08,
        2.399456e+07,
        5.301829e+07,
        5.301829e+07,
        "http://www.grupoquabit.com"
      ],
      "s": "BME:QBT"
    },
    {
      "f": [
        8.43838e+06,
        0.03029,
        1.40816,
        "Pharma Mar SA is a Spain-based company engaged in the bio therapeutic drugs manufacture. The Company focuses on research, development and marketing of bio-active principles, primarily from marine origin, for application in human diseases treatment, including antitumour, antiviral and immunomodulation, as well as tropical diseases areas. It manufactures and sells Yondelis, a synthetically modified antitumor agent, which is derived from sea squirts and is implemented in the treatment of soft tissue sarcomas and relapsed ovarian cancer. Furthermore, the Company's products pipeline comprises drug candidates and agents for cancer treatment, such as Aplidin, PM01183 and PM060184. The Company operates through subsidiaries in Italy, Germany, France, and the United States, among others.",
        0.05829,
        0.94038,
        "Spain",
        "EUR",
        1.4099,
        167.0107,
        null,
        -0.07965,
        -0.07965,
        -4.592e+06,
        1.88e+06,
        "EUR",
        2.548e+06,
        0.7659016,
        0.7659016,
        1.48112e+08,
        "Biopharmaceuticals",
        0.0302,
        null,
        5.799548e+08,
        null,
        6.588e+06,
        690,
        null,
        -0.0524263,
        -0.0817563,
        3.195,
        1.69,
        9.63208,
        null,
        null,
        5.88235,
        -13.71901,
        2.80695,
        1.11471,
        -0.1178641,
        -0.0777389,
        -0.2511122,
        -0.1178641,
        295162.8,
        "Healthcare",
        "BME:PHM",
        2.09525e+08,
        1.09847e+08,
        1.00153e+08,
        1.93817e+08,
        2.213091e+08,
        2.213091e+08,
        "http://www.pharmamar.com"
      ],
      "s": "BME:PHM"
    },
    {
      "f": [
        0,
        0,
        null,
        "Pescanova SA is a Spain-based company primarily engaged, through its subsidiaries, in the fishing industry. The Company comprises the farming, capturing, cleaning, cutting, freezing, processing and packaging onboard factory-ships, as well as the transport, distribution and marketing of a variety of fish products. The Company’s activities are structured in three business areas: Wild Catch, where fish and shellfish are processed and frozen immediately after being caught; Farmed Fish, mainly involved in aquaculture operations and the development of technology for the fishing activities, and Food Products, which offers deep-frozen fish and shellfish products. The Company is a parent of Grupo Pescanova, a group which comprises a number of controlled entities with operations established worldwide. In March 2013, the Company entered bankruptcy proceedings. In December, 2013, the Company completed the sale of a 50% stake in Austral Fisheries Pty Ltd to Maruha Nichiro Seafood Inc.",
        null,
        0.94038,
        "Spain",
        "EUR",
        1.09875,
        418.7286,
        null,
        -0.01845,
        -0.01845,
        40000,
        -1.3939e+07,
        "EUR",
        null,
        -19.21739,
        -19.21739,
        null,
        "Fishing \u0026 Farming - NEC",
        0,
        null,
        1.780814e+08,
        null,
        7.3629e+07,
        4,
        null,
        1.73913,
        0.3913043,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        7742.668,
        null,
        null,
        1.55e-05,
        null,
        null,
        5750,
        "Consumer/Non-Cyclical",
        "BME:PVA",
        5.415e+07,
        2.1552e+07,
        2.4437e+07,
        0,
        2.873772e+07,
        2.873772e+07,
        "http://www.pescanova.com"
      ],
      "s": "BME:PVA"
    },
    {
      "f": [
        2.71279e+06,
        0.0512,
        1.14676,
        "REALIA Business SA (Realia) is a Spain-based company engaged in the promotion, development and exploitation of rural and urban real estate properties. The Company’s properties include office buildings and commercial centers in Madrid, Barcelona, Seville, Guadalajara, Soria, A Coruna and Murcia, as well as residential properties, garages, premises and storage areas in Alicante, Almeria, Girona, Balearic Islands, Las Palmas, Madrid, Malaga, Seville, Valencia and Valladolid. The Company operates through a number of real estate entities, such as Noralia SA, Valaise SL, Realia Business Portugal Unipersonal Ltda, Realia Polska Inwestycje Sp z oo, Realia Contesti SRL and Guillena Golf SL. In addition, the Company is a subsidiary of Inmobiliaria Carso SA de CV.",
        0.07883,
        0.94038,
        "Spain",
        "EUR",
        1.90306,
        156.0531,
        -4.0759999999999995e+06,
        0.23536,
        0.23536,
        -1.4183e+07,
        3.6209e+07,
        "EUR",
        null,
        0.54732,
        0.54732,
        6.1014e+07,
        "Real Estate Development \u0026 Operations - NEC",
        0.0512,
        null,
        5.351906e+08,
        null,
        1.7205e+07,
        94,
        null,
        -0.1687483,
        1.523314,
        1.14542,
        0.62924,
        0.64419,
        3.52651,
        5.71175,
        -1.19048,
        26.11349,
        6.43343,
        0.27041,
        0.066375,
        0.0551991,
        0.26992499999999997,
        0.066375,
        857618.6,
        "Services",
        "BME:RLI.D",
        1.968e+09,
        3.73e+08,
        9.41e+08,
        7.5983e+07,
        4.6800982e+08,
        4.6800982e+08,
        "http://www.realia.es"
      ],
      "s": "BME:RLI.D"
    },
    {
      "f": [
        3.57758e+06,
        2.08011,
        1.00493,
        "Bolsas y Mercados Espanoles Sociedad Holding de Mercados y Sistemas Financieros SA (BME) is a Spain-based company engaged in the securities exchange management. Its activities are divided into seven segments: Equities, trading on electronic platform and stock exchange floor, as well as corresponding post-trade activities; Derivatives, trading of financial and electricity derivatives; Fixed Income, trading of private fixed-income and public debt securities, as well as listing and maintenance services for issuers on the private fixed-income market; Clearing, including settlement, central counterparty and clearing activities of derivatives and public debt repos; Settlement, which offers registration, clearing and settlement of equity, private fixed-income and public debt trades; Information, including dissemination of information as a primary source and index licenses, among others, and IT \u0026 Consulting, providing information technology (IT)-related services, such as software development.",
        2.14477,
        0.94038,
        "Spain",
        "EUR",
        1.01007,
        0,
        -1.57603e+08,
        1.94164,
        1.92902,
        2.20572e+08,
        2.347e+07,
        "EUR",
        8.8718e+07,
        0.2300312,
        0.2300312,
        null,
        "Securities \u0026 Commodity Exchanges",
        2.06767,
        null,
        2.49258e+09,
        null,
        1.73463e+08,
        748,
        null,
        0.6675436,
        0.6784529,
        33.99,
        20.705,
        5.70058,
        15.45344,
        15.00795,
        3.14879,
        -7.99383,
        7.82514,
        null,
        0.3537074,
        0.0052013,
        0.36842149999999996,
        0.3537074,
        455050,
        "Financial",
        "BME:BME",
        2.8228072e+10,
        2.8052936e+10,
        0,
        3.35358e+08,
        8.326573e+07,
        8.326573e+07,
        "http://www.bolsasymercados.es/"
      ],
      "s": "BME:BME"
    },
    {
      "f": [
        3.00559e+07,
        0.15698,
        0.87267,
        "Acerinox SA is a Spain-based company active in the steel sector. It is engaged in the manufacturing, alloy and distribution of flat and long stainless steel products. The Company’s activities are divided into three business segments: Flat stainless steel products, which offers slabs, flats, coils, plates, sheets, circles and flat bars; Long stainless steel products, which provides bars, angles, wires and wire rod, and Other, which includes other stainless steel products. The Company owns factories, warehouses, service centers and representative office in Europe, the Americas, Asia, Oceania and Africa. The Company is a parent of the Acerinox Group, which comprises a number of subsidiaries, such as Acerinox Europa SAU, North American Stainless Inc, Columbus Stainless Pty Ltd, Bahru Stainless SDN BHD, Roldan SA and Inoxfil SA.",
        0.69761,
        0.94038,
        "Spain",
        "EUR",
        1.93278,
        68.67009,
        -4.7836e+07,
        -0.0456,
        -0.0456,
        2.00949e+08,
        -1.0053e+08,
        "EUR",
        6.9124e+07,
        0.2913032,
        0.2913032,
        9.2511e+08,
        "Iron, Steel Mills \u0026 Foundries",
        0.15698,
        null,
        3.577835e+09,
        null,
        4.2891e+07,
        6562,
        null,
        0.0095738,
        -1.2600000000000001e-05,
        12.975,
        6.79841,
        1.91257,
        null,
        26.31613,
        6.49137,
        52.70153,
        0.93827,
        1.17766,
        -0.0091988,
        -0.0064852,
        -0.0064922999999999995,
        -0.0091988,
        564420.3,
        "Basic Materials",
        "BME:ACX",
        4.236018e+09,
        1.983581e+09,
        1.284608e+09,
        4.2214260000000005e+09,
        2.7606754e+08,
        2.7606754e+08,
        "http://www.acerinox.es/"
      ],
      "s": "BME:ACX"
    },
    {
      "f": [
        2.882281e+07,
        1.02574,
        0.72803,
        "Endesa SA is a Spain-based holding company engaged in the business of electricity and gas generation, distribution, and sale, as well as related services. Its segments include Generation, along with Supply; Distribution, and Structure, including the balances and transactions of holding companies and financing companies. It is engaged in electricity business in its industrial and commercial areas. It is also engaged in the exploitation of primary energy resources; the provision of industrial services, particularly in the areas of telecommunications, water and gas, and investing in other companies. It generates, distributes and sells electricity mainly in Spain and Portugal. It also supplies electricity and gas to other European markets, in particular Germany, France, Belgium and the Netherlands, from its platform in Spain and Portugal. It is engaged in supplying value added services and products to customers. It distributes electricity to the consumption points.",
        2.26588,
        0.94038,
        "Spain",
        "EUR",
        0.95222,
        57.82997,
        -8.05e+08,
        1.11924,
        1.11924,
        3.156e+09,
        9.69e+08,
        "EUR",
        3.06e+08,
        0.2715054,
        0.2715054,
        null,
        "Electric Utilities - NEC",
        1.02574,
        null,
        2.141855e+10,
        null,
        1.086e+09,
        9836,
        null,
        0.08813309999999999,
        0.0739707,
        20.345,
        14.69,
        2.19655,
        18.07477,
        8.02494,
        3.00407,
        8.09511,
        1.12765,
        0.75667,
        0.048085899999999994,
        0.0394923,
        0.1241423,
        0.048085899999999994,
        1.8994e+06,
        "Utilities",
        "BME:ELE",
        3.045e+10,
        4.962e+09,
        5.639e+09,
        2.0299e+10,
        1.0587521200000001e+09,
        1.0587521200000001e+09,
        "http://www.endesa.com/es/Home"
      ],
      "s": "BME:ELE"
    },
    {
      "f": [
        3.821388e+07,
        0.95228,
        0.6644,
        "Ferrovial SA is a Spain-based company engaged in the transportation infrastructure sector. The Company’s activities are divided into four business segments: Services, Toll roads, Construction and Airports. The Services division focuses on cleaning and maintenance of public and private infrastructure, facilities and buildings, including such as sport centers, healthcare facilities and train stations, as well as waste collection and treatment. The Toll roads division offers toll highways development, financing and operation. The Construction division develops public and private infrastructure projects, including roads, railways, hydraulic projects and maritime works, among others. The Airports division specializes in the airport infrastructure construction and management. The Company operates through numerous subsidiaries in Europe, the Americas, Middle East and Australia.",
        1.17316,
        0.94038,
        "Spain",
        "EUR",
        1.14395,
        171.8682,
        -2.67e+08,
        0.70584,
        0.70584,
        8.6e+08,
        6.56e+08,
        "EUR",
        2.267e+09,
        null,
        null,
        8.558e+09,
        "Construction \u0026 Engineering - NEC",
        0.95228,
        null,
        1.286162e+10,
        null,
        7.2e+08,
        96494,
        null,
        0.0919823,
        0.04948349999999999,
        20.76787,
        14.97353,
        2.30892,
        24.33271,
        17.66706,
        3.09124,
        -14.73082,
        1.26529,
        1.07212,
        0.025,
        0.017920000000000002,
        0.0906774,
        0.025,
        137305.5,
        "Capital Goods",
        "BME:FER",
        2.4268e+10,
        8.09e+09,
        9.494e+09,
        9.701e+09,
        7.4261721e+08,
        7.4261721e+08,
        "http://www.ferrovial.com/es/"
      ],
      "s": "BME:FER"
    },
    {
      "f": [
        3.07854e+06,
        1.5152,
        null,
        "Axiare Patrimonio SOCIMI SA, formerly known as Axia Real Estate SOCIMI SA, is a Spain-based company engaged in the management of commercial real estate investment trust (REIT). The Company focuses on acquisition, development and leasing of urban properties, as well as on owning interest in entities involved in real estate sector. Its activities are divided into three segments: Offices, Logistics and Retail. The Offices division is responsible for managing buildings used for business purposes that are located in Madrid and Barcelona. The Logistics segment includes administration of logistics platforms in industrial parks. The Retail area is active in the operation of shopping malls and multiline department stores. Its real estate portfolio comprises Planetocio, Les Gavarres, Francisca Delgado and Manuel de Falla offices, as well as Constanti and Camarma de Esteruelas logistics parks, among others.",
        null,
        0.94038,
        "Spain",
        "EUR",
        15.40959,
        43.51319,
        -1.449e+06,
        2.16624,
        2.16624,
        2.6986e+07,
        -3.25232e+08,
        "EUR",
        null,
        2.82459,
        2.82459,
        null,
        "Commercial REITs - NEC",
        1.5152,
        null,
        9.494686e+08,
        null,
        8.534e+07,
        20,
        null,
        2.07041,
        3.3503,
        13.57,
        10.65,
        1.0537,
        6.09812,
        null,
        0.83969,
        2.00772,
        20.53838,
        null,
        0.13112069999999998,
        0.1291028,
        0.185075,
        0.13112069999999998,
        2.433105e+06,
        "Services",
        "BME:AXIA",
        1.313887e+09,
        2.8141e+08,
        3.89071e+08,
        4.2336e+07,
        7.132145e+07,
        7.132145e+07,
        "http://www.axiarealestate.com"
      ],
      "s": "BME:AXIA"
    },
    {
      "f": [
        1.621828e+07,
        2.30976,
        1.33099,
        "Acs Actividades de Construccion y Servicios SA, formerly ACS Actividades de Construccion y Servicios SA, is a Spain-based holding company primarily engaged in the construction and engineering sector, as well as communications. The Company's business is divided into three segments: Construction, which includes civil construction works, residence and non-residential building, concession activity, mining and real estate; Industrial Services, involved in engineering, installation and maintenance of industrial infrastructure in energy, communication and controlling system sectors; and Environment, which comprises such services as street cleaning, waste collection and transportation, waste recycling, commercial and industrial management of water circulation and urban gardening. ",
        5.8852,
        0.94038,
        "Spain",
        "EUR",
        1.08309,
        283.3137,
        -3.4451e+08,
        2.23245,
        2.23245,
        1.815359e+09,
        9.42825e+08,
        "EUR",
        null,
        null,
        null,
        1.2683125e+10,
        "Construction \u0026 Engineering - NEC",
        2.30976,
        null,
        9.369139e+09,
        null,
        7.25322e+08,
        199865,
        null,
        0.044635999999999995,
        0.0391223,
        29.95,
        19.31,
        2.69127,
        13.33736,
        6.04358,
        3.22413,
        16.63152,
        0.29343,
        1.02996,
        0.0752848,
        0.0278931,
        0.1944193,
        0.0752848,
        159235.6,
        "Capital Goods",
        "BME:ACS",
        3.4764e+10,
        2.328e+10,
        9.61e+09,
        3.4924662e+10,
        3.0659286e+08,
        3.0659286e+08,
        "http://www.grupoacs.com/"
      ],
      "s": "BME:ACS"
    },
    {
      "f": [
        0,
        -1.31053,
        null,
        "Compania Levantina de Edificacion y Obras Publicas SA (CLEOP) is a Spain-based company primarily engaged in the construction and public works sectors. The Company’s activities include the construction of such public infrastructure as industrial buildings, care centers and hospitals, as well as road and highway paving. In addition, the Company is involved in the development, promotion and sale of residential and non-residential properties. The Company is a parent of Grupo CLEOP, a group which comprises such controlled entities as Servicleop SL, Aricleop SAU, Compania Levantina de Consultoria y Proyectos SAU, Inmocleop SAU, Gerocleop SLU, Geriatrico Manacor SA and Novaedat Picafort SA, among others. ",
        -1.65724,
        0.94038,
        "Spain",
        "EUR",
        0.24897,
        964.6777,
        null,
        -0.93819,
        -0.93819,
        7.429e+06,
        3.439e+06,
        "EUR",
        145000,
        0.8145032000000001,
        0.8145032000000001,
        2.7464e+07,
        "Construction \u0026 Engineering - NEC",
        -1.31053,
        null,
        1.132016e+07,
        null,
        -1.2708e+07,
        775,
        null,
        -0.41562109999999997,
        -0.36397779999999996,
        null,
        null,
        0.68704,
        null,
        null,
        0,
        0,
        0.32954,
        0.21178,
        -0.1472547,
        -0.0652038,
        -0.5316664,
        -0.1472547,
        null,
        "Capital Goods",
        "BME:CLEO",
        2.01871e+08,
        2.7616e+07,
        1.57146e+08,
        3.3995e+07,
        9.73205e+06,
        9.73205e+06,
        "http://www.cleop.es/"
      ],
      "s": "BME:CLEO"
    },
    {
      "f": [
        13040,
        -0.41597,
        0.43118,
        "Imaginarium SA is a Spain-based company, which primarily provides toys and juvenile products. The Company distributes and sells toys, recreational electronic devices, hygiene and childcare products, decoration and furniture, as well as outdoor products, such as swimming pools, bicycles, garden playhouses and climbing frames. It operates worldwide through a network of own stores and franchises under the brands Imaginarium and ItsImagical in Spain, Portugal, Italy, Ireland, Germany, Russia, Turkey, Israel, Mexico, Colombia, and Hong Kong, among others. Furthermore, the Company controls a range of subsidiaries, such as ItsImagical HK Ltd, Imag Operations GmbH, Imagijodos Lda, Imaginarium Travel Lines SL and Imagination Hellas SA.",
        -0.19217,
        0.94038,
        "Spain",
        "EUR",
        0.88691,
        1426.578,
        null,
        -0.458,
        -0.458,
        443790,
        -2.83663e+06,
        "EUR",
        776980,
        0.5591908999999999,
        0.5591908999999999,
        5.543459e+07,
        "Toys \u0026 Juvenile Products - NEC",
        -0.41597,
        null,
        1.007084e+07,
        null,
        -9.06167e+06,
        931,
        null,
        -0.057288500000000006,
        -0.0945773,
        0.7,
        0.43,
        3.80498,
        null,
        null,
        0,
        -35.71429,
        0.10159,
        0.35225,
        -0.44938290000000003,
        -0.1402448,
        -1.5768739999999999,
        -0.44938290000000003,
        null,
        "Services",
        "BME:IMG",
        5.788636e+07,
        3.3302909999999996e+07,
        3.675365e+07,
        9.913357e+07,
        2.178437e+07,
        2.178437e+07,
        "http://www.imaginarium.es"
      ],
      "s": "BME:IMG"
    },
    {
      "f": [
        2.30803e+06,
        16.27382,
        null,
        "Global Dominion Access SA is a Spain-based company primarily engaged in the construction and engineering sector. The Company's activities are divided into two segments: Multi-technological Services, which offers design, implementation and maintenance of fixed and mobile telecommunications networks, manages sales and distribution processes for telecommunications carriers, as well as renders of inspection, maintenance, repair and renovation services for industrial and energy firms, and Solutions and EPCs, which executes turnkey Engineering-Procurement-Construction (EPC) projects, provides construction, repair and renovation of industrial heating installations, as well as develops processes and other technological and business solutions in numerous sectors. Its services are provided in three areas: Technology and Telecommunications (T\u0026T), Industry and Renewable energies. It operates worldwide in Europe, the Americas, Asia and Africa. The Company is a subsidiary of CIE Automotive SA.",
        32.44866,
        0.94038,
        "Spain",
        "EUR",
        0.97169,
        29.66011,
        null,
        null,
        null,
        null,
        4.0217e+07,
        "EUR",
        2.1808e+08,
        null,
        null,
        2.76812e+08,
        "Construction \u0026 Engineering - NEC",
        16.27382,
        null,
        5.084909e+08,
        null,
        1.7025e+07,
        5404,
        null,
        null,
        null,
        3.09,
        2.152,
        1.93833,
        null,
        null,
        1.69492,
        null,
        null,
        0.91105,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:DOM",
        7.37266e+08,
        3.97269e+08,
        7.7097e+07,
        5.2502099999999994e+08,
        1.6794636e+08,
        1.6794636e+08,
        "http://www.dominion-global.com"
      ],
      "s": "BME:DOM"
    },
    {
      "f": [
        35930,
        0.35692,
        0.31593,
        "Inmobiliaria del Sur SA (Insur) is a Spain-based company engaged in the real estate sector. The Company is primarily involved in the construction, acquisition, management, promotion, rental and sale of residential and non-residential properties, which are located in Cordoba, Malaga, Cadiz, Madrid, Huelva, and Seville, among others. Its main activities are divided into three areas: Housing, Offices \u0026 Commercials and Parking. Furthermore, the Company is a parent of Parking Insur SAU, Hacienda la Cartuja SA, Coopinsur SAU, Inversiones Sevillanas SAI, Bellasur Patrimonial SA, Innovacion en Desarrollos Urbanos del Sur SA, and Viasur Soluciones Inmobiliarias SLU, among others, which together form Insur Group.",
        0.51528,
        0.94038,
        "Spain",
        "EUR",
        1.39079,
        257.3327,
        -1.584e+06,
        0.31638,
        0.31638,
        1.1131e+07,
        1.0125e+07,
        "EUR",
        null,
        0.3703492,
        0.3703492,
        2.094e+07,
        "Homebuilding - NEC",
        0.35692,
        null,
        1.444304e+08,
        null,
        5.655e+06,
        112,
        null,
        0.2290144,
        0.1178851,
        10.42,
        5.87,
        1.78899,
        26.89803,
        19.20617,
        6.375,
        16.57534,
        2.35689,
        0.29728,
        0.023974099999999998,
        0.0155589,
        0.0650181,
        0.023974099999999998,
        594951.4,
        "Services",
        "BME:ISUR",
        3.22287e+08,
        1.5525e+08,
        2.01754e+08,
        5.5844e+07,
        1.648181e+07,
        1.648181e+07,
        "http://www.grupoinsur.com"
      ],
      "s": "BME:ISUR"
    },
    {
      "f": [
        39620,
        -0.04157,
        0.45327,
        "Bioorganic Research and Services SA (Bionaturis) is a Spain-based company engaged in the management and advice in the development of organic chemical processes carried out by third party entities. Among the chemical projects, the Company comprises the examination and interpretation of samples from waste treatment works, valuation of biological activities and retrosynthetic analysis. In May 2014, the Company acquired BBD BioPhenix SL, a San Sebastian-based biotechnology company.",
        0.08977,
        0.94038,
        "Spain",
        "EUR",
        2.0845,
        69.04605,
        null,
        null,
        null,
        null,
        -910020,
        "EUR",
        2.9021e+06,
        null,
        null,
        1.73711e+06,
        "Bio Therapeutic Drugs",
        -0.04157,
        null,
        1.588136e+07,
        null,
        -192600,
        16,
        null,
        null,
        null,
        5.23,
        2.65,
        1.72343,
        null,
        null,
        4,
        -23.15271,
        null,
        2.05411,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:BNT",
        1.655163e+07,
        3.20913e+06,
        6.32216e+06,
        1.05036e+06,
        5.05784e+06,
        5.05784e+06,
        "http://www.bionaturis.com/"
      ],
      "s": "BME:BNT"
    },
    {
      "f": [
        4.1845e+06,
        0.94127,
        0.29633,
        "Ebro Foods SA is a Spain-based holding company primarily engaged in the food industry. The Company's product portfolio includes rice, pasta, cereals and diet products, among others. Ebro Foods SA is also involved in the production of soft drinks, pharmaceutical products, animal feeds and biofuels. It markets its products under a variety of brands, such as SOS, Brillante, La Cigala, La Fallera, Saludaes, American Beauty, San Giorgio, 3 Glocken, Skinner and Ronzoni, among others. The Company operates through such subsidiaries as Herba Ricemills SL, Herba Nutricion SL, Panzani SAS, Dosbio 2010 SL, Riviana Foods Inc, Ebro Foods Alimentacion SA, Azucarera Energias SA, Pastificio Lucio Garofalo SpA, and Roland Monterrat SA, among others.",
        1.42335,
        0.94038,
        "Spain",
        "EUR",
        1.75546,
        35.85123,
        -1.02657e+08,
        1.12292,
        1.12292,
        3.43706e+08,
        7.0017e+07,
        "EUR",
        9.95408e+08,
        0.45885420000000005,
        0.45885420000000005,
        1.0837e+09,
        "Cookie, Cracker \u0026 Pasta Manufacturing",
        0.94127,
        null,
        3.036533e+09,
        null,
        1.44846e+08,
        6039,
        null,
        0.1072499,
        0.1071063,
        21.38,
        16.81,
        1.55569,
        17.57472,
        12.10064,
        1.4653,
        13.94342,
        1.22169,
        1.06514,
        0.0661552,
        0.0533913,
        0.0902865,
        0.0661552,
        451255.1,
        "Consumer/Non-Cyclical",
        "BME:EBRO",
        3.436003e+09,
        1.11518e+09,
        6.99774e+08,
        2.461915e+09,
        1.5386539e+08,
        1.5386539e+08,
        "http://www.ebrofoods.es"
      ],
      "s": "BME:EBRO"
    },
    {
      "f": [
        64390,
        0.3473,
        0.18114,
        "Renta 4 Banco SA is a Spain-based financial institution principally engaged, through its subsidiaries, in the investment banking sector. The Bank divides its activities into three main areas: Brokerage Services, which involves the sale and purchase of securities in the domestic and international markets, as well as the sale of Collective Investment Institutions (CIIs) and Pension Plans; Asset Management, which involves CII, Pension Fund and Private Wealth management; and Corporate Services, which includes security and CII custodian services, corporate advice, public debt management, the underwriting and placement of issues and public offers, the outsourcing of various services and other corporate services. The Bank operates a network of branches located nationwide, as well as it ownes such subsidiaries as Renta 4 Sociedad de Valores SA, Renta 4 Aragon SA, Renta 4 Huesca SA and Renta 4 Pensiones EGFP SA, among others.",
        0.45504,
        0.94038,
        "Spain",
        "EUR",
        null,
        1127.629,
        -9.573e+06,
        0.28138,
        0.28138,
        1.6582999999999998e+07,
        6.456999999999999e+07,
        "EUR",
        1.5291e+07,
        13.93935,
        13.93935,
        6.6444e+07,
        "Investment Management \u0026 Fund Operators - NEC",
        0.3473,
        null,
        2.319513e+08,
        null,
        1.4019e+07,
        436,
        null,
        3.512415,
        3.51637,
        6,
        5.25,
        2.57569,
        20.2573,
        15.58812,
        -1.38408,
        1.60428,
        50.9671,
        null,
        0.127523,
        0.0097608,
        0.1331621,
        0.127523,
        10633.18,
        "Financial",
        "BME:R4",
        1.113084e+09,
        null,
        1.013941e+09,
        4.191e+06,
        4.063166e+07,
        4.063166e+07,
        "http://www.renta4banco.com"
      ],
      "s": "BME:R4"
    },
    {
      "f": [
        4.964911e+07,
        0.41595,
        1.26247,
        "Obrascon Huarte Lain SA (OHL) is a Spain-based company engaged in the construction and engineering sectors. The Company’s activities are structured into three segments: Concessions, Engineering and construction, as well as Development. The Concessions division focuses on the promotion, development and management of a range of transportation infrastructure, such as highways, railways, airports and ports. The Engineering and construction division comprises three business lines: Construction, which is responsible for building civil infrastructure; Industrial, which is involved in the construction, maintenance and operation of industrial plants, and Services, which includes cleaning and maintenance of buildings and public roads, waste management and green area conservation. The Development division promotes and manages tourist resorts and commercial centers. The Company, through its subsidiaries, is present in the Americas, Europe, Asia, Africa and Oceania.",
        3.17284,
        0.94038,
        "Spain",
        "EUR",
        1.26689,
        170.5093,
        -3.4961e+07,
        -0.06031,
        -0.06031,
        7.39716e+08,
        -4.7321e+07,
        "EUR",
        null,
        null,
        null,
        1.294024e+09,
        "Construction \u0026 Engineering - NEC",
        0.41595,
        null,
        8.595297e+08,
        null,
        5.5632e+07,
        23839,
        null,
        0.1936632,
        0.0929415,
        6.35,
        1.731,
        0.29368,
        null,
        2.74038,
        -0.92975,
        -44.39505,
        0.19881,
        1.19114,
        0.021307299999999998,
        0.0134172,
        -0.0043082,
        0.021307299999999998,
        162157.8,
        "Capital Goods",
        "BME:OHL",
        1.33e+10,
        3.939e+09,
        4.8515e+09,
        4.368866e+09,
        2.9044528e+08,
        2.9044528e+08,
        "http://www.ohl.es"
      ],
      "s": "BME:OHL"
    },
    {
      "f": [
        1.1948024e+08,
        0.16958,
        1.25894,
        "Mapfre SA is a Spain-based company engaged in the insurance sector. The Company's activities are divided into four business units: Insurance, Assistance, Reinsurance and Global Risks. The Insurance line offers insurance policies, including life, accident, health, property and casualty and automotive insurance, among others. The Assistance line focuses on developing assistance services for insurance products, including road and travel assistance. The Reinsurance line is responsible for reinsurance activities. The Global Risks line offers integrated insurance services, such as risk prevention and protection, audit and control, for business customers. In addition, the Company is active in the management of pension funds, retirement plans and investment funds, as well as the provision of healthcare services in Spain. The Company operates in Europe, Africa, Asia and the Americas. It is a parent of the Mapfre Group.",
        0.41454,
        0.94038,
        "Spain",
        "EUR",
        null,
        24.75896,
        -7.848e+08,
        0.21888,
        0.21888,
        7.00105e+09,
        -1.25719e+09,
        "EUR",
        1.9702e+09,
        null,
        null,
        null,
        "Multiline Insurance \u0026 Brokers - NEC",
        0.16958,
        null,
        9.639002e+09,
        null,
        7.0877e+08,
        37552,
        null,
        0.0710855,
        0.07502360000000001,
        3.148,
        1.617,
        1.05249,
        14.30007,
        null,
        7.74527,
        32.73961,
        0.43666,
        null,
        null,
        0.017186,
        0.0757093,
        null,
        574779.1,
        "Financial",
        "BME:MAP",
        6.856e+10,
        null,
        2.2675e+09,
        2.140357e+10,
        3.07955327e+09,
        3.07955327e+09,
        "http://www.mapfre.es/seguros/es/index.shtml"
      ],
      "s": "BME:MAP"
    },
    {
      "f": [
        336820,
        0.13841,
        1.45568,
        "Laboratorio Reig Jofre SA, formerly Natraceutical SA, is a Spain-based company primarily engaged in the research, development, manufacturing and marketing of drugs. The Company’s activities are divided into four business divisions: Industrial Services, providing production services for third parties; Pharma, selling own pharmaceuticals under a range of brands, such as Reig Jofre, Medea, Orravan, Bioglan and Sala; Reaserch and Development (R\u0026D) and Regulatory, including the development of indications for existing molecules, as well as generics and molecular diagnostics, among others; and Biotech, offering biopharmaceutical support services, such as analytical and process development, quality control and assurance, as well as stability studies. The Company also provides nutritional cosmetics, and food supplements, among others. It operates worldwide in Europe, Africa, the Americas, Australia and Asia through a number of subsidiaries, including Chiesi Espana SA and Oryzon Genomics SA.",
        0.24651,
        0.94038,
        "Spain",
        "EUR",
        1.77452,
        21.24763,
        -26100,
        0.08049,
        0.08049,
        1.574885e+07,
        2.36981e+06,
        "EUR",
        2.562553e+07,
        0.643934,
        0.643934,
        9.777597e+07,
        "Pharmaceuticals - NEC",
        0.13841,
        null,
        2.016534e+08,
        null,
        8.7497e+06,
        909,
        null,
        0.053284599999999994,
        0.0452216,
        3.785,
        2.522,
        1.54451,
        39.63225,
        19.53095,
        4.21431,
        -11.36427,
        1.25999,
        1.01431,
        0.0342514,
        0.026840600000000003,
        0.0394518,
        0.0342514,
        182074.4,
        "Healthcare",
        "BME:RJF",
        1.9282861e+08,
        7.675848e+07,
        2.763723e+07,
        1.5690966e+08,
        6.297739e+07,
        6.297739e+07,
        "http://reigjofre.com/"
      ],
      "s": "BME:RJF"
    },
    {
      "f": [
        1.541099e+07,
        1.30394,
        0.56008,
        "Inmobiliaria Colonial SA is a Spain-based company primarily engaged in the real estate sector. The Company's activities are divided into two business segments: Property rental, as well as Land and development. The Property rental division focuses on the acquisition, development, leasing and sale of office buildings in Europe. The Land and development division includes shopping centers managed by the Riofisa subgroup. The Company’s real estate portfolio comprises office buildings located in Barcelona and Madrid, Spain, as well as Paris, France. The Company controls a number of subsidiaries, such as Torre Marenostrum SL, Societe Fonciere Lyonnaise SA, Danieltown Spain SLU and Colonial Invest SLU.",
        2.21236,
        0.94038,
        "Spain",
        "EUR",
        1.78889,
        146.6028,
        -5.7305e+07,
        1.41864,
        1.41864,
        2.08229e+08,
        -2.70159e+08,
        "EUR",
        null,
        0.210855,
        0.210855,
        null,
        "Office Real Estate Development",
        1.30394,
        null,
        2.292233e+09,
        null,
        4.15413e+08,
        143,
        null,
        0.7338234,
        3.081227,
        7.25,
        5.26,
        0.9962,
        4.52828,
        2.86952,
        4.62541,
        -0.55728,
        8.47945,
        null,
        0.1499094,
        0.1099924,
        0.2297852,
        0.1499094,
        1.944806e+06,
        "Services",
        "BME:COL",
        7.786e+09,
        3.22e+08,
        3.366e+09,
        2.34328e+08,
        3.5605229e+08,
        3.5605229e+08,
        "http://www.inmocolonial.com/"
      ],
      "s": "BME:COL"
    },
    {
      "f": [
        6.23233e+06,
        -0.29808,
        0.39686,
        "Carbures Europe SA is a Spain-based company principally engaged in the engineering and manufacturing sector, specializing in carbon fiber. It has three business lines: Consultancy, Manufacture, and Research and Development (R\u0026D). In the Consultancy area it concentrates on technical education, lean manufacturing and recurrent and non-recurrent engineering, among others. In the Manufacture sector it produces the composite materials structures through such technologies as: Hand Lay-UP (HLU), which consists in pilling different layers of pre-impregnated material; Resin Transfer Moulding (RTM), where a resin is mixed with a catalyst and injected into a closed mould that contains dry fiber; and Vacuum Assistant Transfer Molding (VARTM). The R\u0026D is related to the projects in the transport and civil construction. In May 2014, the Company acquired Capital House Australasia, a Perth-based provider of project management and civil and structural engineering services.",
        -0.22231,
        0.94038,
        "Spain",
        "EUR",
        0.85775,
        1305.388,
        null,
        null,
        null,
        null,
        -2.6738e+07,
        "EUR",
        1.5611e+07,
        null,
        null,
        3.8011e+07,
        "Aircraft Parts Manufacturing - NEC",
        -0.29808,
        null,
        5.13422e+07,
        null,
        -3.6624e+07,
        897,
        null,
        null,
        null,
        0.95,
        0.47,
        6.23085,
        null,
        null,
        6,
        -18.46154,
        null,
        0.64155,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:CAR",
        1.47962e+08,
        5.398e+07,
        1.07564e+08,
        6.544e+07,
        9.687208e+07,
        9.687208e+07,
        "http://www.carbures.com/"
      ],
      "s": "BME:CAR"
    },
    {
      "f": [
        4.86013e+06,
        0.11849,
        null,
        "eDreams Odigeo SA is a Luxembourg-based company principally engaged in the travel and recreational services. The Company is a travel group composed of four brands, namely eDreams, GO Voyages, Opodo, and Travellink. It offers flights, cruises, car rental, travel insurance, short and long-stay packages. It offers such services as online travel, with a range of products, like scheduled, charter and low-cost flights hotels, self-catering accommodation and cruises, traditional and not traditional package holidays, car hire, train tickets and bus tickets and travel insurance; corporate travel; white-label services, which allow access to various Web platforms; media services like targeted advertising; and venture farm to invest in companies with different types of business models and technologies. ",
        0.27385,
        0.94038,
        "Luxembourg",
        "EUR",
        0.55359,
        112.2065,
        null,
        0.18555,
        0.17667,
        1.00241e+08,
        5.0864e+07,
        "EUR",
        7.21437e+08,
        0.9398508,
        0.9398508,
        4.54135e+08,
        "Leisure \u0026 Recreation - NEC",
        0.11323,
        null,
        3.048057e+08,
        null,
        1.2427e+07,
        1608,
        null,
        0.1572358,
        0.06841649999999999,
        3.076,
        1.152,
        0.78138,
        16.30158,
        8.3051,
        0,
        38.79518,
        0.61824,
        0.55359,
        0.0220801,
        0.0159167,
        0.051941600000000004,
        0.0220801,
        297360.7,
        "Services",
        "BME:EDR",
        1.226616e+09,
        1.9248e+08,
        4.33743e+08,
        4.8465e+08,
        1.0487805e+08,
        1.0487805e+08,
        "http://www.edreamsodigeo.com"
      ],
      "s": "BME:EDR"
    },
    {
      "f": [
        208000,
        0.39988,
        0.44015,
        "Laboratorios Farmaceuticos ROVI SA (ROVI) is a Spain-based company principally engaged in the pharmaceutical industry. The Company’s main activities include the development and commercialization, nationwide and abroad, of medicines and drugs. Its products are structured into three fields: Diagnostic, which offers contrast mediums for use in magnetic resonance, ultrasound and X-ray diagnostics; Prescription, which distributes medicines under such brands as Hibor, Osseor, Hepadren, Pneumovax-23, Glufan, Corlentor, Exxiv, Calcio y Vitamina D3 Rovi and Absorcol, among others; and Over The Counter (OTC), which comprises the Perspirex, Enerzona, Dentimelo and ColdPack brands. The Company owns such fully consolidated subsidiaries as Gineladius SL, Frosst Iberica SA, Rovi Contract Manufacturing SL and Bertex Pharma GmbH, among others. ",
        0.60125,
        0.94038,
        "Spain",
        "EUR",
        2.62855,
        21.01914,
        -8.346e+06,
        0.50347,
        0.50347,
        3.7585e+07,
        1.145e+06,
        "EUR",
        null,
        0.5762011,
        0.5762011,
        1.48934e+08,
        "Pharmaceuticals - NEC",
        0.39988,
        null,
        6.025e+08,
        null,
        1.9809e+07,
        1126,
        null,
        0.1035836,
        0.1010319,
        15.38,
        10.8,
        3.3185,
        23.9339,
        18.07572,
        1.34567,
        -12.93353,
        2.31892,
        1.54314,
        0.119048,
        0.0930386,
        0.1454352,
        0.119048,
        236629.3,
        "Healthcare",
        "BME:ROVI",
        2.71324e+08,
        1.58888e+08,
        3.7627e+07,
        2.46009e+08,
        4.929915e+07,
        4.929915e+07,
        "http://www.rovi.es/"
      ],
      "s": "BME:ROVI"
    },
    {
      "f": [
        3.262578e+07,
        -0.03112,
        1.23306,
        "General de Alquiler de Maquinaria SA (GAM) is a Spain-based company principally engaged in the acquisition, repair and rental of heavy equipment and vehicles. The Company’s rental fleet includes compactors, compressors, dumpers, electric machinery, platforms, cranes, scaffolds and transport vehicles, as well as auxiliary equipment and machinery used in the infrastructure, agricultural, port, construction, industrial and energy sectors. In addition, the Company is involved in the sale of second-hand equipment. The Company operates through Barquero, GAM Noroeste SLU, GAM Divisiones Especializadas SLU, Aldaiturriaga SA, GAM Renove SAU, GAM Canarias SLU and Grupo Internacional de Inversiones en Maquinaria GAM SA, among others.",
        0.09728,
        0.94038,
        "Spain",
        "EUR",
        1.464,
        null,
        null,
        -0.00635,
        -0.00635,
        1.7299e+07,
        -2.625e+06,
        "EUR",
        1.6192e+07,
        0.846279,
        0.846279,
        9.068e+07,
        "Commercial Equipment Rental",
        -0.03112,
        null,
        1.0314e+08,
        null,
        -5.82e+06,
        1014,
        null,
        -0.09974970000000001,
        -0.0081448,
        0.33,
        0.19,
        null,
        null,
        5.05217,
        10.71429,
        29.16667,
        0.99297,
        1.24357,
        -0.0479085,
        -0.012242900000000001,
        null,
        -0.0479085,
        103045.6,
        "Services",
        "BME:GALQ",
        2.25372e+08,
        6.3725e+07,
        1.84741e+08,
        1.05143e+08,
        3.3177515e+08,
        3.3177515e+08,
        "http://www.gamalquiler.es/"
      ],
      "s": "BME:GALQ"
    },
    {
      "f": [
        1.17096e+06,
        0.06,
        null,
        "Parques Reunidos Servicios Centrales SA is a Spain-based company primarily engaged in the operation of leisure parks. The Company holds over 50 parks located in European countries, such as Spain, Belgium, Norway, Denmark, France, Italy and the United Kingdom, as well as in the Americas, including the United States and Argentina. Its assets portfolio comprises: Amusement and theme parks, Marine life parks, Water parks, Zoo Parks, as well as Cable Cars. The Company operates under Marineland, Bo Sommarland, Faunia, Aqualud, Miami Seaquarium, Warner, Grant Leisure, Hawaii, Movie Park, Palac Group (FECs) and Dutch Wonderland brand names, among others. The main shareholder of the Company is Candover Investments PLC.",
        1.10629,
        0.94038,
        "Spain",
        "EUR",
        1.06098,
        57.60806,
        null,
        null,
        null,
        null,
        7.2615e+07,
        "EUR",
        6.40631e+08,
        null,
        null,
        5.1282500000000006e+08,
        "Amusement Parks and Zoos",
        0.06,
        null,
        1.154611e+09,
        null,
        3.91e+06,
        8590,
        null,
        null,
        null,
        15.53,
        11.99,
        1.02011,
        null,
        null,
        5.96517,
        null,
        null,
        0.91125,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:PQR",
        2.207954e+09,
        1.69009e+08,
        6.52034e+08,
        5.7856e+08,
        8.074204e+07,
        8.074204e+07,
        "http://www.parquesreunidos.com/"
      ],
      "s": "BME:PQR"
    },
    {
      "f": [
        3.98304e+06,
        5.55691,
        null,
        "Aena SA is a Spain-based company primarily engaged in the airports operation. The Company’s activities are divided into four segments: Airports, which comprises Aeronautical subdivision, responsible for the management of airports, jetways, security, handling, cargo and fuel services, among others, as well as Commercial subdivision, including duty-free and specialty stores, restaurant services, car rental, as well as banking services and advertising; Services outside the terminal, which manages real estate assets, such as parking lots, warehouses and lands; International, which comprises operations of Company’s subsidiary, Aena Desarrollo Internacional SA, that invests in other airport owners principally in Mexico, Colombia and the United Kingdom; and Others, encompassing corporate activities. The Company manages tourism, hub and regional airports, as well as heliports and general aviation areas. Furthermore, its destination range comprises Europe, the Americas, Asia, as well as Africa.",
        11.13919,
        0.94038,
        "Spain",
        "EUR",
        0.71431,
        197.2731,
        -1.0727e+07,
        7.59169,
        7.59169,
        2.268854e+09,
        1.363595e+09,
        "EUR",
        null,
        0.9508799,
        0.9508799,
        3.282429e+09,
        "Airport Services - NEC",
        5.55691,
        null,
        1.9635e+10,
        null,
        8.33537e+08,
        7940,
        null,
        0.3937287,
        0.40644379999999997,
        137.25,
        92.99,
        4.1578,
        17.24254,
        10.00765,
        3.93013,
        24.54805,
        5.36678,
        0.7109,
        0.0774389,
        0.0675346,
        0.2580206,
        0.0774389,
        460783.5,
        "Transportation",
        "BME:AENA",
        1.6208848e+10,
        1.552856e+09,
        9.316114e+09,
        3.459185e+09,
        1.5e+08,
        1.5e+08,
        "http://www.aena.es"
      ],
      "s": "BME:AENA"
    },
    {
      "f": [
        3.51979e+06,
        0.16293,
        1.05909,
        "Fomento de Construcciones y Contratas SA (FCC) is a Spain-based company primarily engaged in the provision of environmental services. The Company's activities are divided into four business areas: Environmental services, Construction, Water management and Cement. The Environmental services division focuses on street cleaning, maintenance of urban parks and gardens, industrial waste management, waste treatment and recycling, among others. The Construction division offers engineering and construction of civil works, such as roads, railways, airports and hydraulic projects, as well as residential and non-residential buildings. The Water management division operates an integrated water management cycle, which includes intake, purification, treatment and distribution of the waste water. The Cement division manufactures cement, concrete, aggregate and mortar. The Company operates through numerous subsidiaries in Europe, the Americas, Africa and the Middle East region.",
        1.77221,
        0.94118,
        "Spain",
        "EUR",
        1.18098,
        714.9428,
        -1.5041e+07,
        null,
        null,
        null,
        2.46345e+08,
        "EUR",
        null,
        null,
        null,
        3.961829e+09,
        "Construction \u0026 Engineering - NEC",
        0.16293,
        null,
        2.898015e+09,
        null,
        -4.6291e+07,
        55259,
        null,
        null,
        null,
        9.382,
        5.39584,
        3.80449,
        null,
        null,
        -1.16279,
        34.56202,
        null,
        0.98361,
        null,
        null,
        null,
        null,
        null,
        "Transportation",
        "BME:FCC",
        1.133e+10,
        3.82e+09,
        5.44e+09,
        6.476024e+09,
        3.7841001e+08,
        3.7841001e+08,
        "http://www.fcc.es"
      ],
      "s": "BME:FCC"
    },
    {
      "f": [
        8260,
        0.06015,
        0.27046,
        "Medcom Tech SA is a Spain-based company primarily engaged in the distribution and wholesale of technologically advanced products in the areas of Orthopedics, Biologicals, Traumatology and Neurosurgery in Spain, Portugal and Italy. The Company comprises of four departments: Department of Goods, Department of medical professionals, Department of Administration and Logistics and Department of Finance. The product range offered by the Company includes devices treating spine disorders (Dervical, Dorsal of Lumbar pathologies), thousands of patented prosthetic implants for surgery, implants used to synthesize fractures, prosthetic implants for upper limb and foot, as well as medical instruments and precision accessories, among others. The Company also has a license to distribute the patents of such companies as United Ortopedic Corporation, K2M, Bone Support, PAN Medical Ltd, Ranier Technology Ltd, Ascencion Orthopedics and Extremity Medical LLC, among others.",
        0.17074,
        0.94038,
        "Spain",
        "EUR",
        1.39433,
        73.15483,
        0,
        0.06218,
        0.06218,
        3.0551e+06,
        -2.35339e+06,
        "EUR",
        null,
        0.5665426,
        0.5665426,
        1.370007e+07,
        "Medical Equipment Wholesale",
        0.06015,
        null,
        4.588683e+07,
        null,
        395120,
        111,
        null,
        0.0680435,
        0.0389651,
        6.55,
        4.55,
        2.79506,
        73.97877,
        25.56569,
        -3.56394,
        -26.4,
        1.84891,
        0.77704,
        0.0317829,
        0.016509199999999998,
        0.0383491,
        0.0317829,
        245726.5,
        "Healthcare",
        "BME:MED",
        4.077074e+07,
        2.953962e+07,
        1.195211e+07,
        2.304093e+07,
        9.9274e+06,
        9.9274e+06,
        "http://www.medcomtechgroup.com/"
      ],
      "s": "BME:MED"
    },
    {
      "f": [
        4.58401e+06,
        0.84303,
        null,
        "Hispania Activos Inmobiliarios SOCIMI SA is a Spain-based company primarily engaged in the operation of commercial real estate investment trust (REIT). The Company focuses on the acquisition, management and rental of commercial properties in Spain. The Company's activities are divided into five segments: Offices, which leases assets for business purposes; Residential, which provides residential units; Hotels, which rents hotel real estate; Hotels under management, which includes operation and development of hotels within concession agreement, and Other, which leases other real estate assets, such as logistics centers and shopping malls. The Company operates through a number of subsidiaries, such as Hispania Real SOCIMI SAU and Eco Resort San Blas SLU.",
        0.9278,
        0.94038,
        "Spain",
        "EUR",
        5.67187,
        52.76522,
        null,
        2.55132,
        2.55132,
        9.6023e+07,
        -3.5568e+08,
        "EUR",
        null,
        0.655115,
        0.655115,
        3.6788e+07,
        "Real Estate Development \u0026 Operations - NEC",
        0.84303,
        null,
        1.231026e+09,
        null,
        6.6681e+07,
        244,
        null,
        2.08231,
        1.9266329999999998,
        12.96366,
        9.6716,
        0.97027,
        4.4526,
        5.65914,
        3.50797,
        -9.63405,
        10.40518,
        null,
        0.1386992,
        0.1290569,
        0.176722,
        0.1386992,
        869919.1,
        "Services",
        "BME:HIS",
        2.191786e+09,
        4.5654e+08,
        6.68863e+08,
        3.7798e+07,
        1.0826893e+08,
        1.0826893e+08,
        "http://www.hispania.es"
      ],
      "s": "BME:HIS"
    },
    {
      "f": [
        1.713919e+07,
        -0.04626,
        1.79528,
        "Grupo Ezentis SA, also known as Ezentis, is a Spain-based company engaged in the infrastructure and telecommunications sectors. The Company’s activities are structured into three segments: Telecommunications, Electricity and Others. The Telecommunications segment provides design, construction, operation, as well as maintenance services of fiber optic and mobile telephone networks, among others. The Electricity area offers a variety of services within the electric power infrastructure, such as assembly of transmission and distribution lines, installation of substations, smart grids and maintenance of public lighting network. The Others segment encompasses operations in water, oil and gas, as well as mining sector, including construction, repairs, inspections, project management, and engineering services, among others. Ezentis is present in over 15 million households and has over 95 million mobile users in Brazil, Chile, Peru, Argentina, Colombia, Panama, Jamaica and Haiti, among others.",
        -0.00689,
        0.94038,
        "Spain",
        "EUR",
        1.06228,
        694.1072,
        -207000,
        null,
        null,
        null,
        1.1832e+07,
        "EUR",
        3.4813e+07,
        null,
        null,
        2.29989e+08,
        "Communications \u0026 Networking - NEC",
        -0.04626,
        null,
        1.284322e+08,
        null,
        -1.0888e+07,
        9221,
        null,
        null,
        null,
        0.644,
        0.282,
        8.75533,
        null,
        null,
        2.25141,
        20.84257,
        null,
        1.01098,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:EZE",
        2.22067e+08,
        1.04388e+08,
        9.7171e+07,
        2.95451e+08,
        2.3526933e+08,
        2.3526933e+08,
        "http://www.ezentis.com"
      ],
      "s": "BME:EZE"
    },
    {
      "f": [
        925280,
        0.34266,
        0.69355,
        "Papeles y Cartones de Europa SA (Europac) is a Spain-based company primarily engaged in the operation of paper mills. The Company’s activities are divided into two business segments: Paper and Corrugated board. The Paper division is responsible for the manufacture and sale of kraftliner and recycled paper for use in packaging and paper recovery, production of electric and thermal power, as well as paper recovery. The Corrugated board division focuses on the manufacture and sale of corrugated board sheets and boxes. It is also active in the collection and treatment of solid waste, as well as management of forest land. The Company operates in a number of countries, such as Spain, Portugal, France and Morocco. It is a parent of the Europac Group, a group, which comprises Europac Recicla SA, Europa\u0026c Portugal SGPS SA and Europac Integra SL, among others. ",
        0.85596,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        -1.239e+07,
        0.45961,
        0.45961,
        1.18651e+08,
        1.0928e+07,
        "EUR",
        null,
        0.5070881,
        0.5070881,
        4.03139e+08,
        "Paper Mills \u0026 Products",
        0.34266,
        null,
        4.761313e+08,
        null,
        3.2448e+07,
        2289,
        null,
        0.0880261,
        0.0715119,
        5.40384,
        4.065,
        null,
        10.63946,
        5.30343,
        -0.81136,
        0.40676,
        0.5912,
        null,
        null,
        null,
        null,
        null,
        351840.5,
        "Basic Materials",
        "BME:PAC",
        null,
        null,
        null,
        8.0566e+08,
        null,
        null,
        "http://www.europacgroup.com/"
      ],
      "s": "BME:PAC"
    },
    {
      "f": [
        9.15632e+07,
        0.48039,
        0.5861,
        "Distribuidora Internacional de Alimentacion SA (DIA SA) is a Spain-based company primarily engaged in the operation of supermarket chains. The Company focuses on the retail sale of food products through owned or franchised self-service stores under the DIA brand name. Its brand names range includes DIA Market, Fresh by DIA, DIA Maxi, La Plaza de DIA, Max Descuento, Clarel, el Arbol, Cada DIA, Minipreco and Mais Perto, among others. The Company also retails personal care, health and household products, as well as wholesales furniture and related equipment to hospitality, catering and food industry. The Company operates in a number of countries, such as Spain, Portugal, Brazil, Argentina and China.",
        0.81932,
        0.94038,
        "Spain",
        "EUR",
        0.44557,
        1038.925,
        -1.12614e+08,
        null,
        null,
        null,
        -4.19681e+08,
        "EUR",
        5.58042e+08,
        null,
        null,
        1.906573e+09,
        "Discount Stores - NEC",
        0.48039,
        null,
        2.82782e+09,
        null,
        2.99221e+08,
        42225,
        null,
        null,
        null,
        5.8,
        4.151,
        22.7392,
        null,
        null,
        7.55208,
        -15.00468,
        null,
        0.23652,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:DIA",
        3.721562e+09,
        1.275285e+09,
        1.339103e+09,
        8.925454e+09,
        6.1465411e+08,
        6.1465411e+08,
        "http://www.diacorporate.com"
      ],
      "s": "BME:DIA"
    },
    {
      "f": [
        4.80603e+06,
        0.02886,
        1.16383,
        "Reno De Medici SpA is an Italy-based manufacturer of cardboard. The Company produces and distributes cardboard made from recycled fibers. The Company operates production units in Italy, Germany, France and Spain. The Company operates subsidiaries, including Cartiera Alto Milanese SpA, Reno De Medici Arnsberg GmbH, Redno De Medici UK Ltd, Cascades Grundstuck GmbH, RDM Blendecques SAS, RDM Ovaro SpA and Careo Srl, among others. The main shareholder of the Company is Cascades Inc.",
        0.08821,
        0.94038,
        "Italy",
        "EUR",
        1.23674,
        41.1513,
        0,
        0.00802,
        0.00802,
        3.1121e+07,
        1.6254999999999998e+07,
        "EUR",
        null,
        0.36947969999999997,
        0.36947969999999997,
        9.8696e+07,
        "Paper Packaging - NEC",
        0.02886,
        null,
        1.154055e+08,
        null,
        9.79e+06,
        1536,
        null,
        0.018872299999999998,
        0.013338399999999999,
        0.3698,
        0.2652,
        0.73606,
        37.98005,
        4.57759,
        3.81731,
        -13.71105,
        0.2569,
        0.6662,
        0.0154499,
        0.0100593,
        0.024253300000000002,
        0.0154499,
        385273.6,
        "Basic Materials",
        "BME:RDM",
        3.88515e+08,
        1.75562e+08,
        6.4238e+07,
        4.38037e+08,
        3.7721939e+08,
        3.7721939e+08,
        "http://www.renodemedici.it"
      ],
      "s": "BME:RDM"
    },
    {
      "f": [
        5.7819056e+08,
        0.09065,
        2.27237,
        "Bankia SA is a Spain-based bank. It represents a universal banking business model based on multi-brand and multi-channel management, offering its products and services to individuals, small and medium enterprises, corporations, as well as public and private institutions. The Bank's activities are divided into three segments: Retail banking, which provides financial services to consumers, private banking, asset management, as well as insurance products; Business banking, which focuses on serving legal entities and self-employed, and Corporate center, which includes portfolio of investees and held for sale assets. The Bank operates branches and representative offices in Spain and China. It is a subsidiary of BFA Tenedora de Acciones SAU.",
        0.10525,
        0.94038,
        "Spain",
        "EUR",
        null,
        170.1226,
        -2.01553e+08,
        0.07989,
        0.07989,
        1.262519e+09,
        -4.541024e+09,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.09065,
        null,
        1.126395e+10,
        null,
        1.039963e+09,
        13478,
        null,
        0.33136580000000004,
        0.33136580000000004,
        1.17,
        0.528,
        0.85802,
        12.24183,
        10.84297,
        8.90869,
        -10.27523,
        3.01602,
        null,
        null,
        0.0044453,
        0.0709494,
        null,
        null,
        "Financial",
        "BME:BKIA",
        1.95804e+11,
        null,
        2.2201e+10,
        null,
        1.144910348e+10,
        1.144910348e+10,
        "http://www.bankia.com"
      ],
      "s": "BME:BKIA"
    },
    {
      "f": [
        40180,
        -0.13689,
        0.5522,
        "Ab-Biotics SA, also known as Ab-Biotics, is a Spain-based company engaged in the biotechnology industry business sector. It is dedicated to the research and development (R\u0026D) of functional ingredients, drugs and tools for genetic analysis, as well as the nutriceutical and pharmaceutical industries. The Company’s pipeline includes a range of supplements designed to improve health, from products that can lower the risk of cardiovascular disease to those that can help in the management of diabetes. It covers the development spectrum from marketed product, to proof-of-concept, and includes products that have been licensed to global food and pharmaceutical companies. The Company also provides outsourced R\u0026D solutions to pharmaceutical companies, as well as functional food industry related companies. The products offered by the Company are: AB-LIFE\u003c AB-FORTIS, AB-DENTALAC and AB-COLIC, among others.",
        -0.05137,
        0.94038,
        "Spain",
        "EUR",
        0.48362,
        208.9846,
        null,
        -0.50223,
        -0.50223,
        -459250,
        -1.12583e+06,
        "EUR",
        null,
        0.6087078,
        0.6087078,
        1.0160800000000001e+06,
        "Bio Diagnostics \u0026 Testing",
        -0.13689,
        null,
        2.039298e+07,
        null,
        -1.23804e+06,
        38,
        null,
        -0.35270670000000004,
        -0.36748939999999997,
        1.99,
        1.3,
        5.90097,
        null,
        null,
        1.25,
        -16.92308,
        5.27219,
        0.41396,
        -0.5314107,
        -0.41598579999999996,
        -0.9234190999999999,
        -0.5314107,
        104541.4,
        "Healthcare",
        "BME:ABB",
        9.59359e+06,
        1.67294e+06,
        5.18309e+06,
        3.45047e+06,
        9.03406e+06,
        9.03406e+06,
        "http://www.ab-biotics.com/"
      ],
      "s": "BME:ABB"
    },
    {
      "f": [
        210640,
        -0.14333,
        0.67704,
        "Masmovil Ibercom SA, formerly World Wide Web Ibercom SA, is a Spain-based company primarily engaged in the telecommunication sector. The Company focuses on the sale and distribution services for Internet, Data Center and Telecommunications. The Company’s product and services portfolio comprises Internet access through Asymmetric Digital Subscriber Line (ADSL) and Symmetric Digital Subscriber Line (SDSL) technologies, Internet domains and Domains Management and Registration Service through IberDNS application, Web hosting, virtual servers, dedicated servers, telephony services and routers. The Company also offers collocation services through two Internet Data Centers located in Madrid and San Sebastian. It operates through subsidiaries, such as Embou Nuevas Tecnologias SL and Ebesis Sistemas SL, among others. The Company owns a number of brand names, such as Pepephone and Yoigo.",
        0.84408,
        0.94038,
        "Spain",
        "EUR",
        0.80489,
        185.2594,
        null,
        -0.70282,
        -0.70282,
        1.2203e+07,
        -242000,
        "EUR",
        7.8257e+07,
        0.3610931,
        0.3610931,
        4.3564e+07,
        "Integrated Telecommunications Services - NEC",
        -0.14333,
        null,
        5.099501e+08,
        null,
        -1.507e+06,
        409,
        null,
        -0.0146254,
        -0.0588014,
        26.43,
        17.07,
        3.76661,
        null,
        84.55482,
        -1.69231,
        26.78571,
        3.55324,
        0.80396,
        -0.045293,
        -0.030344799999999998,
        -0.0908582,
        -0.045293,
        null,
        "Services",
        "BME:MAS",
        3.53343e+08,
        1.10688e+08,
        1.46279e+08,
        1.30249e+08,
        1.163567e+07,
        1.163567e+07,
        "http://www.ibercom.com"
      ],
      "s": "BME:MAS"
    },
    {
      "f": [
        376950,
        -0.04678,
        0.64019,
        "Ebioss Energy AD, formerly Ebioss Energy AD Sofia, is a Bulgaria-based company engaged in the environmental services and equipment industry. The Company manages companies developing projects in the waste to energy sector. It operates on three business areas: creating value from waste utilisation through analysis of the chemical composition of waste and residue; technology for power generation that includes engineering a proper technological solution (power plant equipment) for the particular waste blend, installing and maintaining the power plants; generating and selling energy, encompassing development and operation of power plants. The Company’s subsidiaries portfolio includes companies engaged in power generation, such as Heat Biomass EOOD, Brila EOOD, Karlovo Biomass EOOD, among others; engineering, including EQTEC Iberia SL; and waste valorisation and distribution, such as Biomass Distribution EOOD.",
        -0.04713,
        0.94038,
        "Bulgaria",
        "EUR",
        1.84565,
        55.41834,
        null,
        -0.06816,
        -0.06816,
        -7.958e+06,
        -9.92e+06,
        "EUR",
        4.736e+06,
        0.5114255,
        0.5114255,
        6.501e+06,
        "Waste Management, Disposal \u0026 Recycling Services",
        -0.04678,
        null,
        4.418541e+07,
        null,
        -1.87e+06,
        null,
        null,
        -0.6376496,
        -0.7629670000000001,
        1.46,
        0.88,
        1.2635,
        null,
        null,
        2.85714,
        -21.16788,
        8.01331,
        1.57224,
        -0.0790038,
        -0.0688928,
        -0.0780002,
        -0.0790038,
        null,
        "Services",
        "BME:EBI",
        5.879e+07,
        1.4588e+07,
        1.9341e+07,
        4.451e+06,
        4.082985e+07,
        4.082985e+07,
        "http://www.ebioss.com"
      ],
      "s": "BME:EBI"
    },
    {
      "f": [
        8.42105e+06,
        0.18143,
        0.96432,
        "Melia Hotels International SA, formerly Sol Melia SA, is a Spain-based company primarily engaged in the hospitality sector. The Company focuses on the management and exploitation of hotel chains. Its activities are divided into three business segments: Hotels, Real Estate and Club Melia. The Hotels division administrates hotels under management and franchise agreements, operates own or leased hotels, as well as offers other entertainment activities, such as casino games and organized tours. The Real Estate division includes real estate development and operations. The Club Melia division operates vacation club complexes. The Company’s brand names portfolio comprises Gran Melia, Paradisus, Melia, Innside by Melia, Tryp by Wyndham and Sol Hotels, among others. The Company operates through numerous subsidiaries in Europe, the Americas, Africa and Asia.",
        0.66177,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        -6.882e+06,
        0.01659,
        0.01659,
        2.9535e+08,
        1.99489e+08,
        "EUR",
        null,
        0.876811,
        0.876811,
        1.356253e+09,
        "Hotels, Motels \u0026 Cruise Lines - NEC",
        0.18143,
        null,
        2.406107e+09,
        null,
        3.5975e+07,
        19880,
        null,
        0.07781640000000001,
        0.0428383,
        12.39,
        7.155,
        null,
        631.4045,
        20.28793,
        2.79686,
        -12.3431,
        1.36207,
        null,
        null,
        null,
        null,
        null,
        88800.33,
        "Services",
        "BME:MEL",
        null,
        null,
        null,
        1.738207e+09,
        null,
        null,
        "http://www.meliahotelsinternational.com"
      ],
      "s": "BME:MEL"
    },
    {
      "f": [
        2.96734e+06,
        1.00641,
        0.46134,
        "CIE Automotive SA is a Spain-based company engaged, through its subsidiaries, in the production of biofuels, as well as in the supply of components and subassemblies for the automotive industry. The Company is also involved in the Information Technology (IT) sector, with the provision of technological solutions for the healthcare, education, sustainability, transport and communications sectors. The Company is a parent of Grupo CIE Automotive, a group which comprises a number of controlled entities with operations established in Spain, Portugal, France, Lithuania, Morocco, Czech Republic, Romania, Brazil, Argentina, China, Russia, Guatemala and Mexico, among others. The Company has such subsidiaries as Global Dominion Access SA, CIE Inversiones e Inmuebles Sociedad Limitada and CIE Berriz Sociedad Limitada, among others. In February 2014, the Company acquired a 50% stake in RS Automotive NV owned by VEP Fund I Holding Cooperatief WA.",
        2.07473,
        0.94038,
        "Spain",
        "EUR",
        0.92392,
        155.5354,
        -2.58e+07,
        1.10804,
        1.10804,
        3.79279e+08,
        1.62885e+08,
        "EUR",
        9.29296e+08,
        0.4418538,
        0.4418538,
        1.164289e+09,
        "Auto, Truck \u0026 Motorcycle Parts - NEC",
        1.00641,
        null,
        2.316195e+09,
        null,
        1.29064e+08,
        22597,
        null,
        0.097987,
        0.07740949999999999,
        18.98,
        11.985,
        3.44863,
        16.20429,
        8.27653,
        3.90625,
        25.12195,
        0.87655,
        0.69554,
        0.0898688,
        0.0467854,
        0.2207552,
        0.0898688,
        114747.3,
        "Consumer Cyclical",
        "BME:CIE",
        3.548222e+09,
        1.273078e+09,
        1.0446189999999999e+09,
        2.63152e+09,
        1.29e+08,
        1.29e+08,
        "http://www.cieautomotive.com"
      ],
      "s": "BME:CIE"
    },
    {
      "f": [
        2.71279e+06,
        0.0512,
        1.14676,
        "REALIA Business SA (Realia) is a Spain-based company engaged in the promotion, development and exploitation of rural and urban real estate properties. The Company’s properties include office buildings and commercial centers in Madrid, Barcelona, Seville, Guadalajara, Soria, A Coruna and Murcia, as well as residential properties, garages, premises and storage areas in Alicante, Almeria, Girona, Balearic Islands, Las Palmas, Madrid, Malaga, Seville, Valencia and Valladolid. The Company operates through a number of real estate entities, such as Noralia SA, Valaise SL, Realia Business Portugal Unipersonal Ltda, Realia Polska Inwestycje Sp z oo, Realia Contesti SRL and Guillena Golf SL. In addition, the Company is a subsidiary of Inmobiliaria Carso SA de CV.",
        0.07883,
        0.94038,
        "Spain",
        "EUR",
        1.90306,
        156.0531,
        -4.0759999999999995e+06,
        0.23536,
        0.23536,
        -1.4183e+07,
        3.6209e+07,
        "EUR",
        null,
        0.54732,
        0.54732,
        6.1014e+07,
        "Real Estate Development \u0026 Operations - NEC",
        0.0512,
        null,
        5.351906e+08,
        null,
        1.7205e+07,
        94,
        null,
        -0.1687483,
        1.523314,
        1.14542,
        0.62924,
        0.64419,
        3.52651,
        5.71175,
        -1.19048,
        26.11349,
        6.43343,
        0.27041,
        0.066375,
        0.0551991,
        0.26992499999999997,
        0.066375,
        857618.6,
        "Services",
        "BME:RLIA",
        1.968e+09,
        3.73e+08,
        9.41e+08,
        7.5983e+07,
        4.6800982e+08,
        4.6800982e+08,
        "http://www.realia.es"
      ],
      "s": "BME:RLIA"
    },
    {
      "f": [
        3.378498e+07,
        0.6424,
        0.97391,
        "Gamesa Corporacion Tecnologica SA is a Spain-based company engaged in the renewable energy equipment manufacture. The Company specializes in the promotion and development of wind farms, as well as the engineering, design, production and sale of wind turbines. Its activities are divided into two business segments: Wind Turbines and Operation and maintenance (O\u0026M). The Wind Turbines division offers wind turbines for various pitch and speed technology, as well as provides development, construction and sale of energy plants. The O\u0026M division is responsible for the management, monitoring and maintenance of wind farms. In addition, through Gamesa Electric, the Company develops electronic equipment, such as power station inverters, electrical system components, motors and generators, as well as drives and converters. It operates through numerous subsidiaries in Spain, Brazil, Mexico, India, China and the United States, among others.",
        0.90604,
        0.94038,
        "Spain",
        "EUR",
        1.38555,
        37.48524,
        -2.2782e+07,
        0.93111,
        0.93111,
        5.96252e+08,
        1.34424e+08,
        "EUR",
        3.88166e+08,
        0.31557670000000004,
        0.31557670000000004,
        1.105238e+09,
        "Wind Systems \u0026 Equipment",
        0.6424,
        null,
        5.135753e+09,
        null,
        1.70216e+08,
        8027,
        null,
        0.09917730000000001,
        0.0841563,
        22.12,
        13.325,
        3.06658,
        19.75062,
        12.01084,
        -1.42053,
        21.14625,
        1.19165,
        1.02224,
        0.1059151,
        0.0529606,
        0.1647411,
        0.1059151,
        591758.5,
        "Capital Goods",
        "BME:GAM",
        5.064107e+09,
        3.475909e+09,
        6.22348e+08,
        3.503802e+09,
        2.7685026e+08,
        2.7685026e+08,
        "http://www.gamesacorp.com/"
      ],
      "s": "BME:GAM"
    },
    {
      "f": [
        7.97736e+06,
        -0.00548,
        1.38656,
        "Biosearch SA, formerly Puleva Biotech SA, is a Spain-based company primarily engaged in the research, development and commercialization of functional food products based on natural ingredients aimed at the consecution of health positive effects that may improve the quality of life. The Company specializes in the nutrition research, which includes patents on infant formulas; the process for extraction and purification of Omega-3 acids; biotechnology projects focused on the microbial fermentation, enzymatic transformations and purification of functional lipids, and the development of functional dairy products, healthy fats, probiotics bacteria and antioxidants, among others, which are distributed under the Eupoly-Epa and Hereditum brands. ",
        0.04283,
        0.94038,
        "Spain",
        "EUR",
        1.32682,
        45.08402,
        null,
        -0.00163,
        -0.00163,
        3.386e+06,
        1.06e+06,
        "EUR",
        7.141e+06,
        0.6796522,
        0.6796522,
        7.331e+06,
        "Special Foods \u0026 Welbeing Products",
        -0.00548,
        null,
        3.519671e+07,
        null,
        -316000,
        135,
        null,
        0.0299777,
        0.0091216,
        0.665,
        0.365,
        1.57281,
        null,
        14.26701,
        8.92857,
        48.78049,
        1.67213,
        0.7389,
        -0.0033138,
        -0.0025272,
        -0.0042052,
        -0.0033138,
        153642.3,
        "Healthcare",
        "BME:BIO",
        3.7572e+07,
        1.3304e+07,
        1.0088e+07,
        1.921e+07,
        5.76939e+07,
        5.76939e+07,
        "http://www.biosearchlife.com"
      ],
      "s": "BME:BIO"
    },
    {
      "f": [
        1.516083e+07,
        -0.01503,
        1.22736,
        "NH Hotel Group SA is a Spain-based company primarily engaged in the hospitality sector. The Company’s activities are divided into two business segments: Hotels and Real estate. The Hotels division is active in the management and exploitation of hotel chains under the NH Hoteles, NH Collection, Hesperia Resorts and nhow brand names. The Real estate division includes operations related to assets management. Apart from accommodation, the Company’s services also include gastronomy and organization of banquets. Its hotels are located in Europe, the Americas and Africa. The Company is a parent of the NH Hotels Group, which comprises numerous subsidiaries, such as Nuevos Espacios Hoteleros SA, Latinoamerica de Gestion Hotelera SL and NH Hotel Ciutat De Reus SA.",
        0.30301,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        null,
        0.02876,
        0.02876,
        1.75957e+08,
        -7.7927e+07,
        "EUR",
        null,
        null,
        null,
        1.309045e+09,
        "Hotels \u0026 Motels",
        -0.01503,
        null,
        1.32753e+09,
        null,
        938000,
        13850,
        null,
        0.061621100000000005,
        0.0188541,
        5.185,
        3.165,
        null,
        131.7802,
        10.34345,
        2.71003,
        -22.01646,
        0.91225,
        null,
        null,
        null,
        null,
        null,
        105002.6,
        "Services",
        "BME:NHH",
        null,
        null,
        null,
        1.376634e+09,
        null,
        null,
        "http://www.nh-hotels.com"
      ],
      "s": "BME:NHH"
    },
    {
      "f": [
        7.00294e+06,
        -0.4784,
        0.81037,
        "Duro Felguera SA is a Spain-based company primarily engaged in the electric construction sector. The Company's activities are divided into six business segments: Energy, which manages turnkey projects related to the construction of power generation facilities, biomass, cogeneration, desulphurization and denitrification plants, among others; Industrial Plants, which comprises activities related to the execution of turnkey projects in the mining and handling fields; Oil and Gas, which specializes in execution of oil and gas projects; Specialized Services, which offers electrical and mechanical erection, maintenance, as well as the supply of thermal, cryogenic and acoustic insulation, among others; Manufacturing, which produces pressure vessels, wind generator components, rail turnouts and crossings, among others, and Others, which includes design and installation of integrated systems for the defense, communications, energy, environmental and civil infrastructure sectors, among others.",
        -0.50526,
        0.94038,
        "Spain",
        "EUR",
        1.3764,
        257.8018,
        -1.6e+07,
        null,
        null,
        null,
        -1.87778e+08,
        "EUR",
        null,
        null,
        null,
        2.31494e+08,
        "Electric Construction",
        -0.4784,
        null,
        1.824e+08,
        null,
        -6.8889e+07,
        2008,
        null,
        null,
        null,
        1.77,
        1.01,
        1.1692,
        null,
        null,
        8.57143,
        -14.28571,
        null,
        1.3239,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:MDF",
        9.95865e+08,
        7.34555e+08,
        3.61964e+08,
        7.71069e+08,
        1.44e+08,
        1.44e+08,
        "http://www.durofelguera.com"
      ],
      "s": "BME:MDF"
    },
    {
      "f": [
        0,
        0.11143,
        null,
        "Nyesa Valores Corporacion SA is a Spain-based company primarily engaged in the real estate sector. The Company’s activities include the acquisition and development of land, as well as the promotion and construction of non-residential properties, such as hotels, office buildings, shopping centers, senior residences, as well as logistics and industrial properties. The Company owns such companies as Gestora Inmobiliaria Besos SA, Edutaimet Sant Adria de Besos SA, Promociones Industriales y Financieras SA, Constructora Inbesos SA, Inbesos Sur SA and Nalcar 2000 SL, among others. On December 5, 2013, Commercial Court No. 1 of Zaragoza completed the common phase of insolvency proceedings. In December 2013, the trustee in bankruptcy presented final report of the Company required under article 96 of the Insolvency Act. On July 15, 2014, the Court announced rules cessation of insolvency of the Company and its subsidiaries.",
        0.11154,
        0.94038,
        "Spain",
        "EUR",
        0.85142,
        null,
        null,
        0.00832,
        0.00832,
        639540,
        -6.82088e+06,
        "EUR",
        null,
        null,
        null,
        null,
        "Real Estate Development \u0026 Operations - NEC",
        0.11143,
        null,
        1.701381e+08,
        null,
        1.0635741e+08,
        23,
        null,
        -0.6851075,
        2.8855,
        null,
        null,
        null,
        null,
        21.79037,
        null,
        null,
        63.18801,
        0.00995,
        0.39299979999999995,
        0.0665557,
        null,
        0.39299979999999995,
        null,
        "Services",
        "BME:NYE",
        1.15894e+08,
        7.6443e+07,
        1.36019e+08,
        2.87157e+06,
        9.5449584e+08,
        9.5449584e+08,
        "http://www.nyesavalorescorporacion.com"
      ],
      "s": "BME:NYE"
    },
    {
      "f": [
        56970,
        0.62384,
        0.49918,
        "Prim SA is a Spain-based company principally engaged in the provision of hospital supplies. The Company’s products portfolio comprises implantable orthopedic products, silicone foot products, abduction splints, mastectomy lingerie, prosthetic components, as well as articulated electric beds and various types of accessories for geriatric centers. Through its subsidiary Inmobiliaria Catharsis SA, the Company is also active in the Real State sector. Prim SA is a parent of Grupo Prim, a group which comprises such a number of controlled entities as Enraf Nonius Iberica SA, Establecimientos Ortopedicos Prim SA, and Luga Suministros Medicos SL, among others.",
        0.73508,
        0.94038,
        "Spain",
        "EUR",
        3.53246,
        2.18221,
        -9.13644e+06,
        0.66022,
        0.66022,
        1.480733e+07,
        -150620,
        "EUR",
        1.574e+06,
        0.5363615,
        0.5363615,
        3.994756e+07,
        "Medical Supplies",
        0.62384,
        null,
        1.495322e+08,
        null,
        1.070285e+07,
        501,
        null,
        0.119781,
        0.1426962,
        9.4,
        7.9,
        1.56224,
        13.05625,
        11.20709,
        -4.22222,
        -3.79464,
        1.3971,
        2.20607,
        0.1170913,
        0.0943002,
        0.1235299,
        0.1170913,
        214919.8,
        "Healthcare",
        "BME:PRM",
        1.2436237e+08,
        8.466705e+07,
        2.0560200000000002e+06,
        9.922778e+07,
        1.707546e+07,
        1.707546e+07,
        "http://www.prim.es/"
      ],
      "s": "BME:PRM"
    },
    {
      "f": [
        541640,
        0.381,
        null,
        "Naturhouse Health SA is a Spain-based company primarily engaged in the special foods and wellbeing products manufacture. The Company specializes in developing, manufacturing and selling products within the nutrition, as well as weight management sector. Its activities are divided into three business areas: Food Supplements, which provides products with natural extracts to facilitate the slimming process; Healthy Foods and Drinks, which offers dietary snacks and meals for breakfast; as well as Cosmetics and Body Care, which includes cosmetics for skin treatment during the slimming process. The Company distributes products through a network of own and franchised stores. Furthermore, It operates in Spain, France, Poland, Italy, Mexico, the United Kingdom, and Canada, among others. The Company is a subsidiary of Kiluva SA, as well as controls a number of entities, such as SAS Naturhouse, Kiluva Diet SLU, Zamodiet Mexico SA de CV and Naturhouse Sp z o o.",
        0.3983,
        0.94038,
        "Spain",
        "EUR",
        2.13102,
        19.66325,
        -1.5806e+07,
        0.38442,
        0.38442,
        3.3849e+07,
        4.259e+06,
        "EUR",
        null,
        0.7100677000000001,
        0.7100677000000001,
        6.796e+07,
        "Special Foods \u0026 Welbeing Products",
        0.381,
        null,
        2.811e+08,
        null,
        2.286e+07,
        489,
        null,
        0.3302946,
        0.3377525,
        5.5,
        3.29,
        11.79036,
        12.18719,
        11.59653,
        2.20332,
        16.83292,
        2.86005,
        1.85652,
        0.8774211,
        0.544094,
        1.0976730000000001,
        0.8774211,
        211365.6,
        "Consumer/Non-Cyclical",
        "BME:NTH",
        4.4159e+07,
        3.3000999999999996e+07,
        4.683e+06,
        9.5792e+07,
        5.99358e+07,
        5.99358e+07,
        "http://www.naturhouse.com/"
      ],
      "s": "BME:NTH"
    },
    {
      "f": [
        0,
        0.00881,
        null,
        "Service Point Solutions SA is a Spain-based company primarily engaged in the provision of commercial printing services. The Company is structured into four business lines: Digital Reprographics, which operates approximately 100 service centers specializing in printing and reproducing documents digitally; Document Management, which is mainly engaged in archiving digital documents and offering computer applications aimed to optimize operational costs related to the document flow; Postage, which provides distribution and mail delivery services, and Mailroom, which offers outsourcing services of mail-related activities. The Company is a parent of Grupo Service Point. The main shareholder of the Company is Paragon.",
        0.00957,
        0.94118,
        "Spain",
        "EUR",
        0.73524,
        null,
        null,
        0.00059,
        0.00059,
        289040,
        70270,
        "EUR",
        null,
        0.6962916,
        0.6962916,
        6.57526e+06,
        "Commercial Printing Services - NEC",
        0.00881,
        null,
        1.314033e+07,
        null,
        1.77591e+06,
        138,
        null,
        0.0158577,
        0.0260607,
        null,
        null,
        null,
        null,
        34.30536,
        null,
        null,
        1.39962,
        0.73524,
        null,
        0.0921599,
        null,
        null,
        67543.02,
        "Services",
        "BME:SPS",
        2.49768e+06,
        2.21733e+06,
        808110,
        9.41122e+06,
        1.01937943e+09,
        1.01937943e+09,
        "http://www.servicepoint.net"
      ],
      "s": "BME:SPS"
    },
    {
      "f": [
        1.950529e+07,
        0.47706,
        0.79652,
        "Mediaset Espana Comunicacion SA is a Spain-based company engaged in the television (TV) broadcasting. The Company's activities are structured in one business segment: Free-to-air TV. It focuses on the acquisition, production and distribution of audiovisual content through the broadcasting of various channels, such as Telecinco, Factoria de Ficcion, Boing, Cuatro, Divinity and Energy. In addition, it operates an online platform, named mitele, for distributing Internet video content, as well as creates and produces movies through Telecinco Cinema. The Company controls a number of subsidiaries, such as Publiesmana SAU, Premiere Megaplex SA, Grupo Editorial Tele 5 SAU, Telcicno Cinema SAU and Conecta 5 Telcicno SAU.",
        1.08908,
        0.94038,
        "Spain",
        "EUR",
        1.25871,
        1.71154,
        -4.7541e+07,
        0.57012,
        0.56992,
        3.74954e+08,
        1.60613e+08,
        "EUR",
        null,
        null,
        null,
        5.55888e+08,
        "Television Broadcasting",
        0.47673,
        null,
        3.678639e+09,
        null,
        1.66166e+08,
        1281,
        null,
        0.2422703,
        0.23818280000000003,
        12.085,
        8.141,
        3.89612,
        19.16936,
        11.68645,
        11.90208,
        8.27552,
        3.64608,
        null,
        0.1755873,
        0.1400548,
        0.18153390000000003,
        0.1755873,
        791939.6,
        "Services",
        "BME:TL5",
        1.24252e+09,
        3.3644e+08,
        1.616e+07,
        9.71931e+08,
        3.3671749e+08,
        3.3671749e+08,
        "http://www.mediaset.es"
      ],
      "s": "BME:TL5"
    },
    {
      "f": [
        1.64126e+06,
        0.21,
        null,
        "Saeta Yield SA is a Spain-based company engaged in the utility industry. The Company specializes in the production of energy from renewable sources. Its business activities are divided into two segments: Solar thermal plants and Wind farms. The Solar thermal plants segment comprises solar energy generation installations in Spain. The Wind farms sector is responsible for the operation of a range of wind farms located in Almeria, Cadiz, Valencia, Burgos, and Zamora, among others. It cooperates with Actividades de Construccion y Servicios SA (ACS). Furthermore, the Company is a parent of a number of entities, such as Extresol 1 SL, Al-Andalus Wind Power SL, Parque Eolico Valcaire SL, which are active within the energy production sector.",
        1.21975,
        0.94038,
        "Spain",
        "EUR",
        1.68458,
        289.6366,
        -3.5192e+07,
        0.31443,
        0.31443,
        1.82185e+08,
        7.609e+07,
        "EUR",
        null,
        null,
        null,
        2.18467e+08,
        "Renewable IPPs",
        0.21,
        null,
        6.689308e+08,
        null,
        1.6055e+07,
        38,
        null,
        0.4316219,
        0.1838671,
        9.463,
        7.34,
        1.24014,
        26.07894,
        5.64837,
        0.34263,
        -1.20482,
        2.61657,
        1.68295,
        0.0159573,
        0.0147169,
        0.0526362,
        0.0159573,
        6.727684e+06,
        "Utilities",
        "BME:SAY",
        2.2468e+09,
        3.103e+08,
        1.5623e+09,
        2.18693e+08,
        8.157693e+07,
        8.157693e+07,
        "http://www.saetayield.com"
      ],
      "s": "BME:SAY"
    },
    {
      "f": [
        4.34262e+06,
        -0.01528,
        null,
        "Telepizza Group SA, formerly Foodco Pastries Spain SA, is a Spain-based company primarily engaged in the operation of quick service restaurants. The Company focuses on developing pizzerias under telepizza, Pizza World and Jeno's Pizza brand name. Its menu includes pizzas, pasta meals, onion rings, chips, kebabs, salads, sandwiches, hamburgers, as well as desserts, such as ice-creams, and non-alcoholic beverages and beer. It offers on-site dishes, orders for takeaway and home delivery. The Company operates own retail pizzerias network in Spain, Portugal, Chile, Colombia and Poland, among others, as well as numerous franchise restaurants located in Guatemala, El Salvador, Russian Federation, Panama and the United Arab Emirates, among others.",
        0.21528,
        0.94038,
        "Spain",
        "EUR",
        1.92114,
        34.7647,
        null,
        null,
        null,
        null,
        5.44e+07,
        "EUR",
        3.82971e+08,
        null,
        null,
        2.376e+08,
        "Quick Service Restaurants",
        -0.01528,
        null,
        4.784232e+08,
        null,
        -1.1e+06,
        2662,
        null,
        null,
        null,
        7.1,
        3.88,
        0.83826,
        null,
        null,
        0.42283,
        null,
        null,
        1.72336,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:TPZ",
        9.18405e+08,
        1.17599e+08,
        1.98415e+08,
        3.289e+08,
        1.0072068e+08,
        1.0072068e+08,
        null
      ],
      "s": "BME:TPZ"
    },
    {
      "f": [
        3.75285e+06,
        0.04316,
        0.40826,
        "Tecnocom Telecomunicaciones y Energia SA (Tecnocom) is a Spain-based company primarily engaged in the information technology (IT) and sector. The Company focuses on developing business solutions, consulting and outsourcing services, as well as managing IT infrastructure. Its service portfolio includes engineering consulting services of telecommunication technologies and systems, design and implementation of services for broadband and network applications, as well as commercialization, installation, support and maintenance of software and hardware systems, among others. The Company’s activities are divided into four business segments: Banking and Insurance, offering solutions for the banking and financial sector; Telco, Media and Energy, aiming at telecommunications and utilities operators; Industrial, providing services to touristic, trade, manufacturing and transportation companies, and Public Administration, including local government and councils or municipalities, among others.",
        0.19238,
        0.94038,
        "Spain",
        "EUR",
        1.48918,
        47.09804,
        null,
        0.08146,
        0.08146,
        2.6297e+07,
        2.0942e+07,
        "EUR",
        9.6654e+07,
        0.7548694,
        0.7548694,
        3.00259e+08,
        "IT Services \u0026 Consulting - NEC",
        0.04316,
        null,
        3.068532e+08,
        null,
        3.118e+06,
        6671,
        null,
        0.0380059,
        0.022427700000000002,
        4.15,
        0.95598,
        1.86163,
        50.20869,
        18.23793,
        2.12235,
        219.22856,
        0.73542,
        1.0675,
        0.0297212,
        0.0187796,
        0.0374699,
        0.0297212,
        62509.51,
        "Technology",
        "BME:TEC",
        3.41021e+08,
        1.77029e+08,
        7.4738e+07,
        4.08838e+08,
        7.222862e+07,
        7.222862e+07,
        "http://www.tecnocom.es"
      ],
      "s": "BME:TEC"
    },
    {
      "f": [
        1.10451091e+09,
        0.39858,
        1.37768,
        "Banco Santander, S.A. is a retail and commercial bank. The Bank's principal business is to attract deposits and provide loans. The Bank focuses its wholesale banking offer on providing services to its main customers in local markets. The Banks segments include Continental Europe, United Kingdom, Latin America and United States. The Continental Europe segment covers all businesses in the Continental Europe. The United Kingdom segment includes the businesses developed by various units and branches in the country. The Latin America segment embraces all its financial activities conducted through its banks and subsidiaries in the region. The United States segment includes the holding company, Santander Holdings USA (SHUSA), the businesses of Santander Bank, Santander Consumer USA and Banco Santander Puerto Rico, the specialized unit of Banco Santander International and Spanish Branch of Santander in New York.",
        0.66176,
        0.94038,
        "Spain",
        "EUR",
        null,
        257.2406,
        -1.498e+09,
        0.34499,
        0.34491,
        1.2225e+10,
        2.123e+09,
        "EUR",
        2.6148e+10,
        null,
        null,
        null,
        "Banks - NEC",
        0.39782,
        null,
        7.221175e+10,
        null,
        5.966e+09,
        189675,
        3573277,
        0.173278,
        0.173278,
        4.982,
        3.11806,
        0.81106,
        14.35737,
        8.1155,
        8.35886,
        12.54719,
        1.40073,
        null,
        null,
        0.0051495,
        0.0585729,
        null,
        null,
        "Financial",
        "BME:SAN",
        1.329538e+12,
        null,
        2.28674e+11,
        null,
        1.455959841e+10,
        1.455959841e+10,
        "http://www.santander.com"
      ],
      "s": "BME:SAN"
    },
    {
      "f": [
        7.95877e+06,
        0.57858,
        null,
        "Talgo SA is a Spain-based company primary engaged in the design and manufacture of rolling stock. The Company's activities are divided into three business segments: Rolling stock, Auxiliary machines and Others, as well as General. The Rolling stock division is responsible for the train production, as well as for the maintenance of trains that use the Company's technology. The Auxiliary machines and Others segment provides manufacture and technical service of lathes, as well as sale of related spare parts. The General area includes corporate operations. The Company's product range comprises high speed rolling stock, intercity trains and locomotives, among others. It offers products and services worldwide to a number of railway operators, such as Amtrak, Metrovias, Russian Railways, Metro Beijing, Fertagus, Chiltern Railways, Jernhusen AB and Bochum Trams. The Company operates manufacturing plants in Spain and Kazakhstan.",
        0.76578,
        0.94038,
        "Spain",
        "EUR",
        1.51263,
        91.69069,
        null,
        0.51634,
        0.51634,
        1.16694e+08,
        -3.068e+07,
        "EUR",
        1.12439e+08,
        0.44396389999999997,
        0.44396389999999997,
        1.98063e+08,
        "Locomotive Engines \u0026 Rolling Stock",
        0.57858,
        null,
        6.004228e+08,
        null,
        5.9575e+07,
        1976,
        null,
        0.1601265,
        0.1504236,
        6.136,
        3.364,
        2.26232,
        8.49828,
        7.19397,
        -6.43923,
        -23.28671,
        0.99079,
        1.2398,
        0.171206,
        0.1016198,
        0.3066407,
        0.171206,
        313341.3,
        "Transportation",
        "BME:TLGO",
        7.59433e+08,
        4.86829e+08,
        2.43348e+08,
        5.2069500000000006e+08,
        1.368329e+08,
        1.368329e+08,
        "http://www.talgo.com/"
      ],
      "s": "BME:TLGO"
    },
    {
      "f": [
        3340,
        -0.42527,
        -0.24981,
        "Sotogrande SA is a Spain-based company engaged in the real estate business sector. The Company administrates, promotes and sales properties in San Roque. Its main activities are divided into three areas: Real Estate, Golf and Hotels. It manages the development of residential properties, moorings, garages, offices, as well as restaurants, hotels and golf fields. In addition, Sotogrande SA is a parent company of Grupo Sotogrande. The Group controls a number of companies, such as Club Deportivo Sotogrande SA, Resco Sotogrande SL, Donnafugata Resort Srl, Residencial Marlin SL, Los Alcornoques de Sotogrande SL, Santa Barbara Golf SA and Capredo Investment GmbH. Furthermore, the Company is a subsidiary of NH Hoteles SA, a worldwide chain of hotels.",
        -0.35368,
        0.94038,
        "Spain",
        "EUR",
        null,
        null,
        null,
        -0.52984,
        -0.52984,
        -1.0468e+07,
        -3.809e+06,
        "EUR",
        null,
        0.4542058,
        0.4542058,
        1.744e+07,
        "Residential Builders - Single Homes",
        -0.42527,
        null,
        1.32043e+08,
        null,
        -1.91e+07,
        297,
        null,
        -0.4699402,
        -0.5837212,
        3.05,
        2.51,
        null,
        null,
        null,
        0,
        -0.33898,
        4.1803,
        null,
        null,
        null,
        null,
        null,
        120561.1,
        "Capital Goods",
        "BME:STG",
        null,
        null,
        null,
        2.6308e+07,
        null,
        null,
        "http://www.sotogrande.com/"
      ],
      "s": "BME:STG"
    },
    {
      "f": [
        6.45075e+06,
        1.10511,
        0.61526,
        "Tecnicas Reunidas SA is a Spain-based company engaged in the engineering and construction of industrial facilities. Its activities are structured in three business areas: Oil \u0026 Gas, Power and Infrastructure and industries. The Oil \u0026 Gas area provides engineering services for the construction of refinery units, as well as petrochemical and natural gas plants, and oil and gas pipelines. The Power segment includes the design and construction of fossil fuel power, nuclear, hydroelectric, biomass and solar installations. The Infrastructure and Industries area specializes in the construction and engineering of airports, water treatment plants, controlled landfills and waste incineration facilities, among others. Furthermore, the Company offers technical and management services in the fields of engineering and construction of industrial plants. The Enterprise is a parent of Tecnicas Reunidas Group, which operates worldwide by numerous subsidiaries and associates.",
        1.43249,
        0.94038,
        "Spain",
        "EUR",
        1.10743,
        28.49162,
        -7.5e+07,
        0.84666,
        0.84666,
        9.7684e+07,
        -1.30977e+08,
        "EUR",
        null,
        0.2821788,
        0.2821788,
        1.168016e+09,
        "Oil Related Services and Equipment - NEC",
        1.10511,
        null,
        2.0983359999999998e+09,
        null,
        5.9364e+07,
        9259,
        null,
        0.0167389,
        0.014794400000000001,
        37.655,
        21.255,
        4.17241,
        44.33893,
        33.25097,
        2.0386,
        11.42772,
        0.45421,
        1.0997,
        0.0794168,
        0.015688,
        0.096027,
        0.0794168,
        501333.4,
        "Capital Goods",
        "BME:TRE",
        3.0992e+09,
        2.7637e+09,
        1.377e+08,
        4.1878869999999995e+09,
        5.37167e+07,
        5.37167e+07,
        "http://www.tecnicasreunidas.es/"
      ],
      "s": "BME:TRE"
    },
    {
      "f": [
        131870,
        -0.75676,
        1.16614,
        "Vousse Corp SA, formerly Suavitas SA, is a Spain-based company engaged in the operation and management of esthetic centers specialized in laser hair removal. The Company’s main activities include the exploitation of commercial premises primarily aimed at the offering a range of laser depilatory services, as well as other health and beauty related treatments, such as anti-cellulite and slimming massages, mesotherapy and nutritional consulting, among others. The Company uses the system of photo depilation, which is a method based on intense pulsed light (IPL) and a permanent depilation as a result. The Company owns a network of beauty clinics mainly located in the cities of Valencia, Zaragoza, Barcelona, Madrid and Murcia. ",
        -0.47006,
        0.94038,
        "Spain",
        "EUR",
        0.20031,
        1380.74,
        null,
        -0.68154,
        -0.68154,
        -566860,
        1.764665e+07,
        "EUR",
        4.382e+06,
        0.9011599,
        0.9011599,
        2.75527e+06,
        "Personal Care Services",
        -0.75676,
        null,
        2.44693e+06,
        null,
        -2.0420500000000002e+06,
        null,
        null,
        -0.313481,
        -0.3536199,
        1.09,
        0.48,
        1.78975,
        null,
        null,
        0,
        -46.93878,
        0.27814,
        0.16972,
        -0.32690820000000004,
        -0.1298463,
        -1.4426580000000002,
        -0.32690820000000004,
        null,
        "Services",
        "BME:VOU",
        2.1554e+07,
        2.462e+06,
        1.0825e+07,
        2.92876e+06,
        2.69839e+06,
        2.69839e+06,
        "http://vousse.com"
      ],
      "s": "BME:VOU"
    },
    {
      "f": [
        3.3487556e+08,
        0.03217,
        1.11348,
        "Telefonica, S.A. is an integrated and diversified telecommunications group operating in Europe and Latin America. The Company's services and products include Mobile business, Fixed-line telephony business and Digital services. The Company's segments include Telefonica Spain, Telefonica Brazil, Telefonica Germany, Telefonica UK and Telefonica Hispanoamerica. These segments are engaged in activities relating to wireline, wireless, cable, data, Internet and television businesses and other digital services in accordance with each location. The Company offers various digital services, such as Video/Television services, e-Health services or telecare, Financial services and other payment services, Security services, Cloud computing services, Advertising, Big Data and Future Communications. It provides mobile voice services; value added services, including voice mail, call hold, call waiting, call forwarding and three-way calling, and mobile data and Internet services.",
        1.73807,
        0.94038,
        "Spain",
        "EUR",
        0.56442,
        356.329,
        -2.775e+09,
        0.00573,
        0.00573,
        1.189e+10,
        1.422e+09,
        "EUR",
        2.8123e+10,
        0.7458414000000001,
        0.7458414000000001,
        2.4786e+10,
        "Integrated Telecommunications Services - NEC",
        0.03214,
        null,
        4.328986e+10,
        null,
        2.745e+09,
        133328,
        null,
        0.060581300000000005,
        0.0100006,
        10.65171,
        7.24803,
        2.41344,
        1499.651,
        4.62252,
        9.45103,
        -13.73401,
        0.8624,
        0.53101,
        0.0009506,
        0.0005989,
        -0.000107,
        0.0009506,
        386457.8,
        "Services",
        "BME:TEF",
        1.20667e+11,
        1.9478e+10,
        6.1171e+10,
        4.7219e+10,
        4.82153933e+09,
        4.82153933e+09,
        "https://www.telefonica.es/"
      ],
      "s": "BME:TEF"
    },
    {
      "f": [
        5.5208459e+08,
        0.13518,
        1.44489,
        "Banco de Sabadell SA is a Spain-based financial institution (the Bank) primarily engaged in the banking sector. The Bank's activities are divided into four segments: Banking in Spain, Asset transformation, Banking in the United Kingdom (UK) and Banking in America. The Banking in Spain division includes commercial banking products, such as mortgage loans, deposit accounts, insurance policies and mutual funds; corporate banking products, such as customized financing and treasury, as well as markets and private banking investment. The Asset transformation division focuses on real estate operations and management. The Banking in UK division includes TSB Banking Group PLC that offers current and savings accounts, personal loans, credit cards and mortgages. The Banking in America division provides retail and commercial banking services, as well as solutions for corporate customers, such as project finance operations. The Bank operates through numerous subsidiaries.",
        0.18821,
        0.94118,
        "Spain",
        "EUR",
        null,
        206.4766,
        -2.1172e+07,
        0.09201,
        0.09201,
        2.894625e+09,
        8.71136e+08,
        "EUR",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        0.13518,
        null,
        7.73344e+09,
        null,
        7.08441e+08,
        25972,
        265935,
        0.1559646,
        0.1559646,
        1.81,
        1.065,
        0.58045,
        14.96576,
        6.96341,
        6.16808,
        -12.40286,
        1.21834,
        null,
        null,
        0.0037989,
        0.0608676,
        null,
        null,
        "Financial",
        "BME:SAB",
        2.05843e+11,
        null,
        2.7162e+10,
        null,
        5.54524404e+09,
        5.54524404e+09,
        "https://www.bancsabadell.com/"
      ],
      "s": "BME:SAB"
    },
    {
      "f": [
        5.03729e+06,
        0.06203,
        2.60889,
        "Solaria Energia y Medio Ambiente SA (Solaria) is a Spain-based company engaged, together with its subsidiaries, in the renewable energy sector. The Company’s activities comprise the designing and installation of solar, thermal, photovoltaic and wind energy plants. The Company’s business is structured in three areas: Photovoltaic and Thermal Panels division, which is engaged in the development, production and sale of the solar panels. Turnkey Projects division includes the processing of licenses and permits, planning and design of photovoltaic systems, supervision and coordination of the construction of facilities, drafting and technical management of projects, as well as the set-up and maintenance of the installations. In the Generation division the Company develops, manages and operates its own photovoltaic plants. ",
        0.12745,
        0.94038,
        "Spain",
        "EUR",
        1.20722,
        284.5641,
        null,
        0.04239,
        0.04239,
        7.26e+06,
        -1.278e+06,
        "EUR",
        null,
        0.9476323,
        0.9476323,
        1.1602e+07,
        "Renewable Energy Equipment \u0026 Services - NEC",
        0.06203,
        null,
        8.494467e+07,
        null,
        6.643e+06,
        36,
        null,
        0.5883008000000001,
        0.2918424,
        0.875,
        0.5,
        1.9429,
        18.28261,
        7.01964,
        7.63889,
        10.71429,
        6.76042,
        0.7048,
        0.0356223,
        0.0265122,
        0.12051819999999999,
        0.0356223,
        349027.8,
        "Capital Goods",
        "BME:SLR",
        1.87007e+08,
        3.7337e+07,
        1.22889e+08,
        1.6535e+07,
        1.0826349e+08,
        1.0826349e+08,
        "http://www.solariaenergia.com/"
      ],
      "s": "BME:SLR"
    },
    {
      "f": [
        7.685869e+07,
        -1.58877,
        1.84861,
        "Sacyr SA, formerly Grupo Sacyr Vallehermoso SA, is a Spain-based company primarily engaged in the construction and engineering sector. The Company's activities are divided into six business segments: Construction, which provides civil engineering and building projects in Europe, Africa and the Americas; Concessions, which includes operation of motorway, transport hub, airport and hospital concessions; Valoriza, which offers management and administration services within various areas, such as water and waste treatment; Industrial, which focuses on construction and engineering of industrial facilities, such as power generation plants, refineries and power transmission lines; Residential development, which offers housing construction, and Repsol, which includes investment in Repsol SA, an energy company. It operates through a number of subsidiaries, such as Valoriza Gestion SAU and Vallehermoso Division Promocion SAU.",
        -1.45651,
        0.94038,
        "Spain",
        "EUR",
        1.04395,
        289.6581,
        -2.5727e+07,
        -0.1667,
        -0.1667,
        2.84835e+08,
        5.1065e+07,
        "EUR",
        1.86044e+08,
        0.0429313,
        0.0429313,
        1.030469e+09,
        "Construction \u0026 Engineering - NEC",
        -1.58877,
        null,
        1.167324e+09,
        null,
        3.70006e+08,
        23431,
        null,
        0.057900400000000005,
        -0.0174787,
        2.306,
        1.174,
        0.6914,
        null,
        16.10636,
        9.78102,
        23.95604,
        0.39081,
        0.97626,
        -0.0056635999999999995,
        -0.0037470999999999997,
        -0.030527199999999997,
        -0.0056635999999999995,
        132942.7,
        "Capital Goods",
        "BME:SCYR",
        1.0318506e+10,
        3.408993e+09,
        4.823027e+09,
        2.948914e+09,
        5.1029899e+08,
        5.1029899e+08,
        "http://www.sacyr.com"
      ],
      "s": "BME:SCYR"
    },
    {
      "f": [
        5.13151e+06,
        0.0648,
        0.90381,
        "Tubacex SA is a Spain-based company primarily engaged, through its subsidiaries, in the steel industry. The Company's main activity is the manufacture, distribution and sale of seamless stainless steel tubes and pipes, with operations established in Spain, Germany, Austria, France, Italia, Brazil, the Netherlands, Hungary, the United States and the United Kingdom. The Company’s product portfolio also includes hollow bars, steel and fittings. Tubacex SA is a parent of Grupo Tubacex, a group which comprises a number of such controlled entities as Aceria de Alava SA, Tubacex Tubos Inoxidables SA, Schoeller-Bleckmann Edelstahlrohr Inmobilien AG, Salem Tube Inc, Tubacex Taylor Accesorios SA and Metaux Inox Services SAS, among others.",
        0.313,
        0.94038,
        "Spain",
        "EUR",
        1.41592,
        127.3805,
        -9.504e+06,
        null,
        null,
        null,
        2.5795e+07,
        "EUR",
        2.8383e+07,
        null,
        null,
        2.40979e+08,
        "Steel - NEC",
        0.0648,
        null,
        3.869683e+08,
        null,
        8.413e+06,
        2232,
        null,
        null,
        null,
        2.95,
        1.385,
        1.31783,
        null,
        null,
        0.34483,
        90.19608,
        null,
        0.74079,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "BME:TUB",
        8.63413e+08,
        4.64562e+08,
        3.56595e+08,
        5.3341499999999994e+08,
        1.2983581000000001e+08,
        1.2983581000000001e+08,
        "http://www.tubacex.com/"
      ],
      "s": "BME:TUB"
    },
    {
      "f": [
        95950,
        0.0283,
        -0.11538,
        "Zinkia Entertainment SA (Zinkia) is a Spain-based company engaged in the animation, production, management and promotion of cartoons for children. It is also involved in the design and development of interactive console games and online communities. The Company's products include such cartoons as Pocoyo, Shuriken School, Mola Noguru, The Fishtail Saga and PlayChapas, as well as a variety of console, mobile phone and online games, which are marketed under the PlayChapas brand. The Company's products are distributed to over 100 countries worldwide. As of December 31, 2011, the Company owned such subsidiaries as Sonocrew SL, Producciones y Licencias Plaza de Espana SA de CV and Cake Entertainment Ltd, among others, and Jomaca 98 SL was its majority shareholder with 71.56% of its interest. In February 2014, it entered administration to seek protection from creditors. On April 16, 2014, it entered into insolvency proceedings. ",
        0.09,
        0.94038,
        "Spain",
        "EUR",
        1.12807,
        181.1985,
        null,
        0.00666,
        0.00666,
        1.05888e+06,
        -2.13708e+06,
        "EUR",
        null,
        0.8468992,
        0.8468992,
        4.80303e+06,
        "Entertainment Production - NEC",
        0.0283,
        null,
        1.858714e+07,
        null,
        683750,
        63,
        null,
        -0.0838631,
        0.0289223,
        1.07,
        0.58,
        3.95554,
        114.1141,
        10.7075,
        20.63492,
        8.57143,
        2.92212,
        null,
        0.0150528,
        0.0082215,
        0.032985799999999996,
        0.0150528,
        null,
        "Services",
        "BME:ZNK",
        1.697598e+07,
        5.3418e+06,
        8.41011e+06,
        5.88939e+06,
        2.415679e+07,
        2.415679e+07,
        "http://www.zinkia.com"
      ],
      "s": "BME:ZNK"
    },
    {
      "f": [
        1.11605e+06,
        0.0337,
        0.6079,
        "Vocento SA is a Spain-based company engaged in the multimedia industry. The Company publishes, distributes and sells unit publications, periodic and non-periodic, about general information, culture, sports, arts and other related topics. It operates through four segments: Print Media, which provides printing and distribution services; Audiovisual, which is responsible for the broadcasting of television channels in the Spanish Digital Terrestrial Television (DTT) and one radio station, as well as the operation of five audiovisual production entities BocaBoca Producciones, Europroducciones, Hill Valley, Videomedia and Tripictures; Internet, which hosts with the coverage of news and events, as well as specific applications for smartphones and tablet computers; and Other Businesses, which is active in the printing, distribution and free press sectors. Mezouna SA is the Company’s major shareholder with 11.08% of its interest.",
        0.24078,
        0.94038,
        "Spain",
        "EUR",
        1.07509,
        41.52872,
        -3.684e+06,
        -0.0083,
        -0.0083,
        4.1775e+07,
        2.3973e+07,
        "EUR",
        null,
        0.8468502,
        0.8468502,
        3.93166e+08,
        "Consumer Publishing - NEC",
        0.0337,
        null,
        1.512141e+08,
        null,
        4.0810000000000005e+06,
        2721,
        null,
        0.0336998,
        0.020205700000000004,
        1.5,
        1.085,
        0.47358,
        null,
        6.3251,
        4.31034,
        -6.92308,
        0.33396,
        null,
        0.0096443,
        0.0077971,
        -0.0032342,
        0.0096443,
        164472.2,
        "Services",
        "BME:VOC",
        5.92942e+08,
        1.266e+08,
        1.28499e+08,
        4.67181e+08,
        1.2110414e+08,
        1.2110414e+08,
        "http://www.vocento.com"
      ],
      "s": "BME:VOC"
    },
    {
      "f": [
        3.50438e+06,
        2.56656,
        0.00954,
        "Viscofan SA is a Spain-based company engaged in the packaging industry, mainly for meat products. The Company focuses on the manufacture and distribution of artificial castings, as well as plastic films that are used for separation of sliced food. Its products range includes cellulose, collagen, fibrous and plastic castings. In addition, it designs and produces packing machinery, as well as provides related spare parts. The Company also sells electric power, which is produced by cogeneration systems. The Company operates manufacturing plants and sales offices in Spain, Serbia, Czech Republic, Germany, Brazil, Mexico, Uruguay, China and the United States, among others. It controls a number of subsidiaries, such as Nanopack, Technology and Packaging SL, Naturin Viscofan GmbH and Viscofan Centroamerica Comercial SA.",
        3.70514,
        0.94038,
        "Spain",
        "EUR",
        4.35496,
        8.1433,
        -5.7975e+07,
        2.60018,
        2.60018,
        2.00034e+08,
        2.3021e+07,
        "EUR",
        3.52e+06,
        0.7288852,
        0.7288852,
        5.37606e+08,
        "Non-Paper Containers \u0026 Packaging - NEC",
        2.56656,
        null,
        2.173363e+09,
        null,
        1.20022e+08,
        4309,
        null,
        0.2130926,
        0.20879609999999998,
        58.04,
        41.835,
        3.17033,
        17.9353,
        12.99889,
        3.84102,
        -15.5163,
        3.00933,
        2.25206,
        0.163806,
        0.14211980000000002,
        0.18611899999999998,
        0.163806,
        166330.5,
        "Basic Materials",
        "BME:VIS",
        8.67487e+08,
        4.35979e+08,
        5.5825e+07,
        7.4077e+08,
        4.660368e+07,
        4.660368e+07,
        "http://www.viscofan.com"
      ],
      "s": "BME:VIS"
    },
    {
      "f": [
        2.2378982e+08,
        0.34887,
        1.84861,
        "Sniace SA is a Spain-based company primarily active in the chemical sector. The Company’s main activities are structured into five divisions: Cellulose, Viscose, Electricity Generation, Biofuels and Forestry. The Cellulose division is specialized in the manufacturing of cellulose for textile, sanitary and hygienic applications. The Viscose division is involved in the manufacturing of cut viscose for the production of textile and nonwoven fabrics. In the Electricity Generation division, the Company is active in the generation of electric and thermal energy. The Biofuels division is focused on the production of bioethanol. The Forestry division is in charge of the provision of sustainable forestry consulting and services.",
        0.37073,
        0.94038,
        "Spain",
        "EUR",
        0.75744,
        114.1101,
        null,
        null,
        null,
        null,
        -4.1630000000000005e+06,
        "EUR",
        null,
        null,
        null,
        321000,
        "Commodity Chemicals - NEC",
        0.34887,
        null,
        6.785319e+07,
        null,
        5.5082e+07,
        54,
        null,
        null,
        null,
        0.393,
        0.1146,
        3.5698,
        null,
        null,
        2.11268,
        null,
        null,
        0.70304,
        null,
        null,
        null,
        null,
        null,
        "Basic Materials",
        "BME:SNC",
        1.263e+08,
        2.9945e+07,
        2.2201e+07,
        1.166e+06,
        2.3328034e+08,
        2.3328034e+08,
        "http://www.sniace.com"
      ],
      "s": "BME:SNC"
    },
    {
      "f": [
        6.78824e+06,
        0.32342,
        0.51492,
        "Zardoya Otis SA is a Spain-based company primarily engaged in the elevator equipment manufacture. The Company focuses on design, installation and maintenance of elevators and escalators. The Company's products portfolio also comprises moving walkways, stairway chair lifts, as well as other vertical and horizontal transportation systems. In addition, it offers maintenance programs and Remote Elevator Monitoring system for optimizing elevator performance, among others. The Company operates a number of production plants located in Spain. The Company’s subsidiaries include Ascensores Eguren SA, Ascensores Ingar SA, Cruxent-Edelma SL, Ascensores Serra SA, Mototraccion Electrica Latierro SA, Puertas Automaticas Portis SL, Otis Elevadores Lda, Masel Otis Elevadores Madeira Lda and Ascensores Pertor SL, among others. The Company is controlled by United Technologies Holdings SAS.",
        0.37366,
        0.94038,
        "Spain",
        "EUR",
        1.05928,
        0.17734,
        -1.44928e+08,
        0.31854,
        0.31854,
        2.32794e+08,
        1.3434e+07,
        "EUR",
        1.41577e+08,
        0.7034197,
        0.7034197,
        5.23919e+08,
        "Elevator \u0026 Conveying Equipment",
        0.32342,
        null,
        3.679031e+09,
        null,
        1.48745e+08,
        5118,
        null,
        0.2816053,
        0.2822245,
        10.42724,
        7.11,
        9.65128,
        24.54951,
        21.36338,
        3.43915,
        -21.11383,
        4.96294,
        0.97504,
        0.36160380000000003,
        0.2093267,
        0.3950971,
        0.36160380000000003,
        145753,
        "Capital Goods",
        "BME:ZOT",
        7.13369e+08,
        2.97287e+08,
        676000,
        7.32228e+08,
        4.7045155e+08,
        4.7045155e+08,
        "http://www.otis.com/site/es-esl"
      ],
      "s": "BME:ZOT"
    },
    {
      "f": [
        7.4068e+06,
        -0.09288,
        0.92299,
        "Tubos Reunidos SA is a Spain-based company primarily engaged in the steel industry. The Company specializes in the production, distribution and sale of seamless pipes used in the chemical, petrochemical, automotive, gas and construction industries. The Company’s facilities include steel mills, as well as three production plants, which are located in Amurrio, Pamplona and Trapagaran. The Company owns such fully consolidated subsidiaries as Productos Tubulares SAU, Tubos Reunidos Industrial SLU, Aceros Calibrados SA (ACECSA), Almacenes Matalurgicos SAU (ALMESA), Aplicaciones Tubulares SL (ATUCA) and Tubos Reunidos America Inc, among others. On May 17, 2012, the Company announced that it has sold its 50%-stake in Depositos Tubos Reunidos Lentz SA to Sotralentz Packaging SAS.",
        0.07467,
        0.94038,
        "Spain",
        "EUR",
        1.12075,
        108.3678,
        -2.005e+06,
        -0.21541,
        -0.21541,
        -9.173e+06,
        -1.7152e+07,
        "EUR",
        null,
        0.5237951000000001,
        0.5237951000000001,
        1.04293e+08,
        "Iron, Steel Mills \u0026 Foundries",
        -0.09288,
        null,
        1.685671e+08,
        null,
        -1.6187999999999998e+07,
        1775,
        null,
        -0.1430313,
        -0.16849060000000002,
        0.97,
        0.5,
        0.8181,
        null,
        null,
        6.04396,
        62.18487,
        0.70842,
        0.21235,
        -0.07882,
        -0.0611393,
        -0.164331,
        -0.07882,
        137304.1,
        "Capital Goods",
        "BME:TRG",
        5.90371e+08,
        1.58058e+08,
        2.22568e+08,
        3.52478e+08,
        1.7411718e+08,
        1.7411718e+08,
        "http://www.tubosreunidos.com"
      ],
      "s": "BME:TRG"
    },
    {
      "f": [
        140260,
        2.45527,
        0.26168,
        "Vidrala SA is a Spain-based company principally engaged in the glass industry. The Company operates through two segments: Spain and European Union. The Company’s activities include the production, distribution and sale of glass bottles and containers used in the food and beverages industries. The Company conducts its own research and development (R\u0026D) operations. It operates production plants and melting furnaces located in such countries, as Portugal, France, Belgium and Italy. The Company owns such subsidiaries as Crisnova Vidrio SA, Inverbeira Sociedad de Promocion de Empresas SA, Gallo Vidro SA, Castellar Vidrio SA, Corsico Vetro SRL, MD Verre SA, Omega Immobiliere et Financiere SA, Investverre SA and CD Verre SA. ",
        5.48349,
        0.94038,
        "Spain",
        "EUR",
        2.11555,
        87.53271,
        -1.675e+07,
        2.66808,
        2.66808,
        1.68395e+08,
        6.2267e+07,
        "EUR",
        5.9233e+07,
        0.6198287,
        0.6198287,
        4.19604e+08,
        "Glass Containers \u0026 Packaging",
        2.45527,
        null,
        1.238477e+09,
        null,
        6.086e+07,
        3078,
        null,
        0.1132667,
        0.1009934,
        58.95,
        41.1,
        2.70796,
        18.72133,
        8.65517,
        4.21448,
        10.33797,
        1.53366,
        1.23229,
        0.0675221,
        0.0555504,
        0.1442201,
        0.0675221,
        262354.8,
        "Basic Materials",
        "BME:VID",
        1.154267e+09,
        4.35897e+08,
        3.99691e+08,
        8.03365e+08,
        2.475491e+07,
        2.475491e+07,
        "http://www.vidrala.com"
      ],
      "s": "BME:VID"
    },
    {
      "f": [
        0,
        -0.01309,
        null,
        "Vertice Trescientos Sesenta Grados SA is a Spain-based company principally engaged in the media sector. The Company’s businesses are structured in four segments: Cinema, where it comprises the production and co-production of feature films, as well as the distribution and exploitation of rights to audiovisual works; Television, where the Company is engaged in the production of films, documents, entertainment programs and competitions for various television channels; Audiovisual services area, which specializes in the audiovisual production, organization of big events and offering support services for business communication, and International, which is focused on the production and promotion and distribution of its audiovisual production abroad. In April 2014, it entered into insolvency proceedings. In April 2014, Spanish National Securities Market Commission (CNMV) suspended trading of Vertice Trescientos Sesenta Grados SA shares on Automated Quotation System.",
        -0.01003,
        0.94038,
        "Spain",
        "EUR",
        0.1288,
        null,
        null,
        null,
        null,
        null,
        -4.608e+06,
        "EUR",
        514000,
        null,
        null,
        2.207e+06,
        "Movie, TV Production \u0026 Distribution",
        -0.01309,
        null,
        1.485154e+07,
        null,
        -4.1470000000000005e+06,
        21,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        0,
        0,
        null,
        0.11719,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "BME:VER",
        1.0008e+07,
        4.983e+06,
        1.4112e+07,
        2.908e+06,
        3.1453657e+08,
        3.1453657e+08,
        "http://www.vertice360.com/"
      ],
      "s": "BME:VER"
    },
    {
      "f": [
        7.2461316e+08,
        -0.00014,
        1.88021,
        "Urbas Grupo Financiero SA, formerly Urbas Guardahermosa SA, is a Spain-based company primarily engaged in the real estate sector. The Company’s activities include the acquisition, development and sale of land and residential properties, mainly in the Guadalajara and Almeria provinces. The Company is also involved in the development of urban projects across Spain and the Moroccan city of Tangier, as well as in the management and treatment of solid waste and contaminated soils. It also holds minor stakes in companies active in the renewable energy sector. The Company is a parent of Grupo Urbas Guadahermosa, a group which comprises such controlled entities as Urbanijar Iberica SL, Urbas Maroc SARL, Explotaciones Turisticas de Vera SLU, Guadahermosa Proyectos Urbanisticos del Mediterraneo SL, Teleoro Medios SL, Urbas Bulgaria EOOD and Urbas Romania SA, among others.",
        -0.00014,
        0.94038,
        "Spain",
        "EUR",
        1.86522,
        98.22176,
        null,
        0.00099,
        0.00099,
        -1.323e+06,
        -1.788e+06,
        "EUR",
        8.1115e+07,
        0.39466009999999996,
        0.39466009999999996,
        687000,
        "Homebuilding - NEC",
        -0.00014,
        null,
        3.422657e+07,
        null,
        -4.695e+06,
        16,
        null,
        -0.3071573,
        -0.3246578,
        0.017,
        0.01,
        2.44204,
        12.12121,
        null,
        9.09091,
        9.09091,
        7.67928,
        0.17106,
        -0.0135346,
        -0.0058927,
        -0.0250019,
        -0.0135346,
        278562.5,
        "Capital Goods",
        "BME:UBS",
        4.15834e+08,
        3.07894e+08,
        1.62226e+08,
        1.501e+06,
        3.361125415e+10,
        3.361125415e+10,
        "http://www.grupourbas.com"
      ],
      "s": "BME:UBS"
    }
  ]
}