{
  "fields": [
    "average_volume",
    "basic_eps_net_income",
    "beta_1_year",
    "business_description",
    "cash_ratio",
    "conversion_rate",
    "country",
    "currency",
    "current_ratio",
    "debt_to_equity",
    "dividends_paid",
    "dividends_per_share_fq",
    "earnings_per_share_basic_ttm",
    "earnings_per_share_diluted_ttm",
    "ebitda",
    "enterprise_value_ebitda_ttm",
    "enterprise_value_fq",
    "expected_annual_dividends",
    "free_cash_flow",
    "fundamental_currency_code",
    "goodwill",
    "gross_margin",
    "gross_margin_percent_ttm",
    "gross_profit",
    "industry",
    "last_annual_eps",
    "last_annual_revenue",
    "market_cap_basic",
    "net_debt",
    "net_income",
    "number_of_employees",
    "number_of_shareholders",
    "operating_margin",
    "pre_tax_margin",
    "price_52_week_high",
    "price_52_week_low",
    "price_book_fq",
    "price_earnings_ttm",
    "price_free_cash_flow_ttm",
    "price_percent_change_1_week",
    "price_percent_change_52_week",
    "price_revenue_ttm",
    "quick_ratio",
    "return_of_invested_capital_percent_ttm",
    "return_on_assets",
    "return_on_equity",
    "return_on_invested_capital",
    "revenue_per_employee",
    "sector",
    "symbol",
    "total_assets",
    "total_current_assets",
    "total_debt",
    "total_revenue",
    "total_shares_outstanding",
    "total_shares_outstanding_fundamental",
    "web_site_url"
  ],
  "symbols": [
    {
      "f": [
        604170,
        0.0003,
        2.43092,
        "AFC Group Holdings Limited, formerly Australasian Food Corporation Limited, is engaged in producing, manufacturing and purchasing food, health and cosmetic products for distribution in New Zealand and the Chinese markets. The Company's business segments include International marketing, Vineyard and winery, and Corporate. The International marketing segment consists of AFC International Trading Group Limited, which sources packaged food products, cosmetics and health products. The Vineyard and winery segment includes Australasian Food Corporation Longview Limited, which offers Cabernet Sauvignon, Merlot, Cabernet Franc, Syrah, Chardonnay, White Diamond and Gewurztraminer. The Corporate segment is engaged in providing accounting, management and administration services to other segments of the Company, and consists of National Dairy Group Limited, which is engaged in sourcing food products for distribution in New Zealand, Australia and China.",
        0.00013,
        1.42126,
        "New Zealand",
        "NZD",
        1.26126,
        0,
        null,
        null,
        0.0002,
        0.0002,
        -508789.99999999994,
        -20.251518308142852,
        1.030377e+07,
        null,
        -2.50431e+06,
        "NZD",
        null,
        null,
        null,
        204300,
        "Investment Trusts",
        0.0001,
        1.5718e+06,
        1.099276e+07,
        -688990,
        449260,
        null,
        null,
        0.2858315,
        0.2858252,
        0.009,
        0.002,
        3.61259,
        15,
        null,
        50,
        -25,
        6.99374,
        0.94129,
        0.90378,
        0.1482484,
        1.222626,
        0.90378,
        null,
        "Financial",
        "NZX:AFC",
        5.94425e+06,
        3.53552e+06,
        0,
        1.5718e+06,
        2.0840430900000002e+09,
        2.0840430900000002e+09,
        "http://www.afcnz.com/"
      ],
      "s": "NZX:AFC"
    },
    {
      "f": [
        2.26594e+06,
        -0.0125,
        null,
        "Chow Group Limited, formerly RIS Group Limited, is a New Zealand-based property company. The Company is involved in accommodation and hospitality. It is engaged in the provision of accommodation in an investment property developed to provide these services. The Company, through its subsidiary, 16 Park Avenue Limited, provides long and short term accommodation at the properties located in 10-16 Park Avenue in Central Otahuhu under the name, Park Avenue Residence. It holds interest in 16-20 Park Avenue, which includes 931 square meters of land area and 2,634 square meters of net lettable area, and 10-14 Park Avenue, which includes 857 square meters of land area and 1,004 square meters of net lettable area. There are a total of 135 rooms available for rental in the combined Park Ave Residence project. Park Ave Residence has a range of rooms, including Studio Twin with Ensuite, Studio Room with Ensuite and Twin Room with Shared Facilities.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.93333,
        19.81132,
        null,
        null,
        -0.00728,
        -0.00728,
        -63000,
        -183.59761904761905,
        1.156665e+07,
        null,
        -78000,
        "NZD",
        null,
        null,
        null,
        0,
        "Enterprise Software",
        -0.0125,
        0,
        1.152065e+07,
        46000,
        -368000,
        null,
        null,
        null,
        null,
        0.175,
        0.01,
        5.50177,
        null,
        null,
        -6.66667,
        -88.8,
        null,
        null,
        -1.0274729999999999,
        -0.5475842,
        -1.484127,
        -1.0274729999999999,
        null,
        "Technology",
        "NZX:CGL",
        358000,
        196000,
        21000,
        0,
        4.165627e+07,
        4.165627e+07,
        "https://risgroup.wordpress.com/"
      ],
      "s": "NZX:CGL"
    },
    {
      "f": [
        1.17841e+06,
        6318,
        0.08928,
        "ASB Capital Limited is a finance company that has issued perpetual preference shares to the New Zealand market. The Company is a subsidiary of CBA Funding (NZ) Limited, the ultimate parent of which is the Commonwealth Bank of Australia (CBA). The Company operates in New Zealand. Its primary business is financial services.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        0,
        -6.509e+06,
        null,
        6318,
        6318,
        8.775e+06,
        40.054358974358976,
        3.51477e+08,
        null,
        -12000,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        6318,
        8.794e+06,
        1.52e+08,
        -523000,
        6.318e+06,
        0,
        null,
        0.9978394,
        0.9978394,
        0.91,
        0.74,
        0.00103,
        0.00012,
        null,
        0,
        -11.62791,
        17.28451,
        null,
        0.0314556,
        0.0313258,
        7.580084,
        0.0314556,
        null,
        "Financial",
        "NZX:ASBPA",
        2.0155e+08,
        null,
        0,
        8.794e+06,
        1000,
        1000,
        null
      ],
      "s": "NZX:ASBPA"
    },
    {
      "f": [
        1.86886e+06,
        -0.00643,
        null,
        "Bethunes Investments Limited, formerly Mowbray Collectables Limited, is an investment company. The Company's investment objective is to preserve capital and seek maximum, long-term growth with reasonable risk. The Company focuses on acquiring a portfolio of assets that generate high free cash flow margins enabling the creation of attractive per share returns through disciplined capital allocation.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        4.45349,
        0,
        null,
        null,
        0.01342,
        0.01342,
        -278120,
        -0.462642025025169,
        128670,
        null,
        -1.10664e+06,
        "NZD",
        null,
        0.16094229999999998,
        0.16094229999999998,
        -86060,
        "Investment Trusts",
        -0.00643,
        39330,
        575300,
        -446630,
        -2.02317e+06,
        null,
        null,
        -6.280272999999999,
        -5.417437,
        0.017,
        0.002,
        0.96048,
        0.37258,
        null,
        0,
        -72.22222,
        12.66626,
        4.45349,
        null,
        -0.2389837,
        null,
        null,
        null,
        "Financial",
        "NZX:BIL",
        710460,
        496520,
        0,
        39330,
        1.1506028e+08,
        1.1506028e+08,
        "http://www.bethunesinvestments.com/"
      ],
      "s": "NZX:BIL"
    },
    {
      "f": [
        0,
        0.17538,
        null,
        "Enprise Group Limited (Enprise) operates through Enprise Solutions division. The Company has a joint venture, Datagate Innovation Limited (Datagate), which provides online reporting and billing portals under software-as-a-service (SaaS) model for resellers of telecommunications/utility services and hosted service providers. Enprise Solutions is a cloud business software company. The Company's geographical segments include New Zealand, Australia, Asia, North America and EMEA. Enprise Solutions is a solution provider for MYOB Enterprise software in Australia and New Zealand. Enprise Solutions provides solutions based on the MYOB Advanced and MYOB EXO software platforms. Datagate manages the data aggregation, rating, billing and analysis of service usage. It supports over 750 MYOB Advanced and MYOB EXO customers across Australia and New Zealand. Its subsidiaries include Enprise Solutions Limited, Enprise Australia Pty Limited and GlobalBizpro Limited.",
        0.19355,
        1.42126,
        "New Zealand",
        "NZD",
        1.34004,
        0,
        null,
        0.03,
        0.17538,
        0.17538,
        698340,
        6.892674055617608,
        4.81343e+06,
        null,
        -43050,
        "NZD",
        null,
        0.6637350999999999,
        0.6637350999999999,
        4.83e+06,
        "Shell Companies",
        0.17538,
        6.9614e+06,
        5.06502e+06,
        -251589.99999999997,
        683000,
        21,
        null,
        0.1702625,
        0.1561083,
        null,
        null,
        null,
        null,
        4.18549,
        null,
        null,
        0.72759,
        null,
        0.360765,
        0.2366695,
        0.3732574,
        0.360765,
        null,
        "Technology",
        "NZX:ENS",
        4.864e+06,
        1.466e+06,
        0,
        7.277e+06,
        6.791e+06,
        6.791e+06,
        "http://www.enprisegroup.com"
      ],
      "s": "NZX:ENS"
    },
    {
      "f": [
        3.76963e+06,
        0.08826,
        null,
        "Evolve Education Group Limited (Evolve) invests in the provision and management of an early childhood education (ECE) services in New Zealand. The Company's segments include ECE Centres and Home-based ECE. Its ECE Centres segment provides purpose built facilities that offer all day or part-day early childhood services. The Home-based ECE segment offers educator providing services to a small group of children in a home setting and is supported by a registered teacher coordinator overseeing the children's learning progress. Its other operations include ECE Centre Management, whereby the Company provides management and back-office expertise to early childhood education centers but it does not own the center. The Company operates over 100 ECE centers across the nation under a number of ECE brands, including Lollipops Educare and Leaps \u0026 Bounds. Its subsidiaries include Au Pair Link Limited, Porse Franchising (NZ) Limited and Porse Education \u0026 Training (NZ) Limited.",
        0.10043,
        1.42126,
        "New Zealand",
        "NZD",
        0.55064,
        20.02835,
        -3.68e+06,
        0.0518,
        0.09033,
        0.09033,
        2.682e+07,
        6.908777032065623,
        1.852934e+08,
        0.051,
        1.2915e+07,
        "NZD",
        null,
        0.8924847,
        0.8924847,
        1.22147e+08,
        "Educational Services",
        0.08826,
        1.37379e+08,
        1.780524e+08,
        7.241e+06,
        1.5642e+07,
        null,
        null,
        0.16308630000000002,
        0.1561599,
        1.08,
        0.87,
        1.07125,
        11.07052,
        9.62237,
        0,
        1.0101,
        1.23945,
        null,
        0.0840676,
        0.07906640000000001,
        0.09932270000000001,
        0.0840676,
        null,
        "Services",
        "NZX:EVO",
        2.10893e+08,
        6.568e+06,
        3.3200000000000004e+07,
        1.37379e+08,
        1.7757602e+08,
        1.7757602e+08,
        "http://www.evolveeducation.co.nz/en/"
      ],
      "s": "NZX:EVO"
    },
    {
      "f": [
        454670,
        0.06333,
        0.18317,
        "CDL Investments New Zealand Limited is a New Zealand-based company, which is engaged in land-based investment and development. The principal activity of the Company is the development and sale of residential land properties. The Company's segment is property operations. The Company's subdivisions include Magellan Heights, Northwood, Washbourn Terraces and Stonebrook. The Magellan Heights property is located in Hamilton. Northwood is located in Hawkes Bay. Washbourn Terraces is located in Nelson. Washbourn Terraces is located close to the center of Richmond. Washbourn Terraces has a combination of flat building sites, having sea views to the north, and hill views to the east and west. Magellan Heights has landscaped sections and building covenants. Northwood provides a range of section sizes to suit a range of house styles with building covenants.",
        0.06334,
        1.42126,
        "New Zealand",
        "NZD",
        13.85283,
        0,
        -5.84e+06,
        0.022,
        0.09014,
        0.09014,
        3.4019e+07,
        5.420767806225933,
        1.844091e+08,
        null,
        -1.7039e+07,
        "NZD",
        null,
        0.5703987,
        0.5703987,
        2.6632e+07,
        "Residential  Real Estate Development",
        0.06333,
        4.754e+07,
        1.994021e+08,
        -1.4993e+07,
        1.7473e+07,
        3633,
        2832,
        0.5119727000000001,
        0.5209427999999999,
        0.8,
        0.57664,
        1.323,
        7.98757,
        8.00265,
        2.85714,
        20.69933,
        3.0011,
        7.05113,
        0.1766301,
        0.17298480000000002,
        0.1766727,
        0.1766301,
        null,
        "Services",
        "NZX:CDI",
        1.5557e+08,
        6.6923e+07,
        0,
        4.754e+07,
        2.7694733e+08,
        2.7694733e+08,
        "http://cdlinvestments.co.nz/"
      ],
      "s": "NZX:CDI"
    },
    {
      "f": [
        1.230023e+07,
        0.09031,
        null,
        "Arvida Group Limited is engaged in the business of owning, operating and developing retirement villages and rest homes for the elderly in New Zealand. The Company's villages are located in New Zealand, with over 2,000 residents across approximately 20 locations. The Company offers three levels of care: rest home, dementia and hospital. The Company's total aged care beds include approximately 1,250 and over 908 retirement units, including approximately 379 apartments/villa, and over 529 serviced apartments. The Company offers a range of accommodation options, including independent villas, serviced apartments, rest home and continuing care facilities, apartments and studios. The Company offers lawn and indoor bowls, a dart board, supervised exercise programs, movie afternoons, happy hours, spa pool, unisex hairdresser, music therapy, craft sessions, exercise classes, church programs, and weekly shopping trips-transport provided.",
        0.10113,
        1.42126,
        "New Zealand",
        "NZD",
        0.06393,
        11.36716,
        -1.1135e+07,
        0.04321,
        0.13009,
        0.13009,
        1.5122e+07,
        28.387852135960852,
        4.292811e+08,
        0.04459,
        9.78e+06,
        "NZD",
        3.9495e+07,
        null,
        null,
        null,
        "Residential \u0026 Long Term Care",
        0.09031,
        8.2509e+07,
        4.178261e+08,
        1.1455e+07,
        2.4024e+07,
        null,
        null,
        0.4519352,
        0.4519352,
        1.2642,
        0.8526,
        1.22336,
        9.60873,
        10.68773,
        4.16667,
        38.64241,
        4.63376,
        null,
        0.0782037,
        0.0741513,
        0.1342446,
        0.0782037,
        null,
        "Healthcare",
        "NZX:ARV",
        5.37153e+08,
        1.723e+06,
        3.2363e+07,
        8.2509e+07,
        2.78639e+08,
        2.78639e+08,
        "http://arvida.co.nz/"
      ],
      "s": "NZX:ARV"
    },
    {
      "f": [
        6.47439e+06,
        0.24908270899221838,
        0.65597,
        "Australian Foundation Investment Company Limited (AFIC) is a closed-end investment company. The Company specializes in investing in Australian equities. The Company's investment objective is to provide shareholders with investment returns through access to a steam franked dividends and enhancement of capital invested. It has two portfolios of securities: the investment portfolio and the trading portfolio. The investment portfolio holds securities that the Company intends to retain on a long term basis. The trading portfolio consists of securities that are held for short term trading only, including call option contracts written over securities that are held in specific sub-component of the investment portfolio. It invests in a range of sectors, such as energy, materials, industrials, consumer staples, banks, property trusts, telecommunications, healthcare, information technology and utilities. Australian Investment Company Services Ltd is a subsidiary of the Company.",
        0.2304,
        1.35962,
        "Australia",
        "AUD",
        0.87793,
        3.51476,
        -2.04131e+08,
        0.2508806872508495,
        0.23861,
        0.23795,
        2.77509e+08,
        23.487930121185258,
        6.813618408908371e+09,
        null,
        3.3236464379753165e+07,
        "NZD",
        null,
        0.9550276,
        0.9550276,
        2.92163e+08,
        "Investment Banking",
        0.23803,
        3.05921e+08,
        6.777915996440182e+09,
        3.4154e+07,
        2.6557299999999997e+08,
        18,
        113482,
        0.9071263,
        0.9071263,
        5.99,
        5.32,
        1.19147,
        23.95461,
        null,
        -0.69686,
        -1.04167,
        21.19488,
        null,
        0.0415194,
        0.040644400000000004,
        0.048940599999999994,
        0.0415194,
        null,
        "Financial",
        "NZX:AFI",
        6.452528e+09,
        2.01261e+08,
        1.90057e+08,
        3.05921e+08,
        1.130305e+09,
        1.130305e+09,
        "http://www.afi.com.au/"
      ],
      "s": "NZX:AFI"
    },
    {
      "f": [
        2.206374e+07,
        -0.09098,
        0.70138,
        "Contact Energy Limited is an energy generator and retailer, which is engaged in providing electricity, natural gas and liquefied petroleum gas (LPG). The Company's segments include Integrated Energy and Other. The Integrated Energy segment is engaged in the business of generating electricity and selling energy to New Zealand customers. The Other segment is made up of its LPG business, Contact Rockgas, which purchases and sells LPG to New Zealand customers. The Company supplies electricity and natural gas through its Contact Energy brand, and bottled LPG through Contact Rockgas LPG. It sells electricity, gas and LPG products and services to residential, small business, commercial and industrial customers. It generates electricity at approximately 10 power stations. It also has the ability to store and use gas from its Ahuroa gas storage facility. The Company's stations include Ahuroa and Stratford in Taranaki; Ohaaki, Poihipi and Te Rapa in Waikato, and Te Huka and Te Mihi in Taupo.",
        0.18609,
        1.42126,
        "New Zealand",
        "NZD",
        0.53737,
        60.07793,
        -1.89e+08,
        0.26,
        -0.08968,
        -0.08968,
        4.8e+08,
        10.52910625,
        5.053971e+09,
        0.26386,
        2.45e+08,
        "NZD",
        1.82e+08,
        0.3327138,
        0.3327138,
        null,
        "Multiline Utilities - NEC",
        -0.09098,
        2.163e+09,
        3.362971e+09,
        1.691e+09,
        -6.6e+07,
        1050,
        null,
        -0.049006,
        -0.049006,
        5.49,
        4.35,
        1.19128,
        null,
        24.9109,
        -0.42373,
        -0.21231,
        1.55477,
        0.43416,
        -0.012694700000000001,
        -0.011242700000000001,
        -0.022022,
        -0.012694700000000001,
        null,
        "Utilities",
        "NZX:CEN",
        5.652e+09,
        3.02e+08,
        1.696e+09,
        2.163e+09,
        7.1552576e+08,
        7.1552576e+08,
        "http://www.contactenergy.co.nz/web/view?page=/contentiw/pages/home"
      ],
      "s": "NZX:CEN"
    },
    {
      "f": [
        32610,
        -0.0192,
        0.40996,
        "Burger Fuel Worldwide Limited is a New Zealand-based franchisor. The Company operates as a franchisor of gourmet burger restaurants. The Company operates in four segments: New Zealand, Australia, United States of America and the Middle East. The Company's food menu includes Gourmet Beef category, including offerings, such as Hamburgini With Cheese, Bambina, C N Cheese, Third Pounder With Cheese, Peanut Piston, Bio Fuel and Ford Freakout; Gourmet Chicken category, which includes offerings, such as Chook Royale, Bacon Backfire, Flame Thrower and Burnout; Gourmet Vege category, which includes Combustion Tofu, V-Twin Vege and V-Dub Vege offerings; Gourmet Sides, which include Spud Fries With Aioli, Kumara Fries With Aioli, Chicken Fenders and Motobites; Desserts, which include Dark Chocolate Ice Cream and Hokey Pokey Ice Cream; Kids Meals, which include Kids Cheeseburger Meal and Kids Natural Nuggets Meal, and Drinks, which include Thick Shake, Soy Thick Shakes and Diet Coke.",
        -0.00689,
        1.42126,
        "New Zealand",
        "NZD",
        5.1185,
        0,
        null,
        null,
        -0.01303,
        -0.01303,
        -69980,
        -1182.847956559017,
        8.27757e+07,
        null,
        -1.98249e+06,
        "NZD",
        null,
        null,
        null,
        1.456513e+07,
        "Restaurants \u0026 Bars - NEC",
        -0.0192,
        2.013013e+07,
        8.885399e+07,
        -6.07829e+06,
        -1.14366e+06,
        null,
        2610,
        -0.0381999,
        -0.0305376,
        2.95,
        1.35,
        7.03646,
        null,
        null,
        0,
        -49.49153,
        4.2589,
        4.47596,
        -0.059092900000000004,
        -0.051943500000000004,
        -0.059092900000000004,
        -0.059092900000000004,
        null,
        "Services",
        "NZX:BFW",
        1.4693e+07,
        1.0539e+07,
        0,
        2.013013e+07,
        5.966355e+07,
        5.966355e+07,
        null
      ],
      "s": "NZX:BFW"
    },
    {
      "f": [
        1.102243e+07,
        0.50599,
        0.38967,
        "Fonterra Co-operative Group Limited is a co-operative company operating in the international dairy industry. It is involved in the collection, manufacture and sale of milk and milk-derived products and in fast-moving consumer goods (FMCG) and foodservice businesses. It operates through five segments: Global Ingredients and Operations (GIO), Oceania, Asia, Greater China and Latin America. GIO processes and distributes milk, sells and markets milk products. Oceania includes FMCG businesses in New Zealand and all FMCG and ingredients businesses in Australia. Asia includes FMCG and foodservice businesses in Asia, Africa and the Middle East. Greater China includes FMCG, foodservice and farming businesses in Greater China. Latin America includes FMCG and ingredients businesses in South America and the Caribbean. The Company supplies dairy ingredients to food companies, branded dairy products to consumers, and out-of-home foodservice to food professionals in bakeries and restaurants.",
        0.87705,
        1.42126,
        "New Zealand",
        "NZD",
        1.27339,
        92.7832,
        -7.01e+08,
        0.2,
        0.50605,
        0.50605,
        1.94e+09,
        8.001642783505154,
        1.5523187e+10,
        null,
        1.538e+09,
        "NZD",
        null,
        0.2111751,
        0.2111751,
        3.632e+09,
        "Dairy Products",
        0.50599,
        1.7199e+10,
        9.528187e+09,
        5.995e+09,
        8.1e+08,
        21300,
        null,
        0.0832025,
        0.0541892,
        6.1,
        5.3,
        1.38797,
        11.73797,
        6.78646,
        0.16863,
        2.06186,
        0.554,
        0.67284,
        0.0638347,
        0.0470748,
        0.1215122,
        0.0638347,
        807464.8,
        "Consumer/Non-Cyclical",
        "NZX:FCG",
        1.7118e+10,
        5.091e+09,
        6.364e+09,
        1.7199e+10,
        1.602703e+09,
        1.602703e+09,
        "http://www.fonterra.com"
      ],
      "s": "NZX:FCG"
    },
    {
      "f": [
        2.12951e+06,
        -0.0022,
        0.40897,
        "Chatham Rock Phosphate Limited is a New Zealand-based company, which is engaged in the development of a defined rock phosphate deposit. The Company is also engaged in the development and exploitation of the Chatham Rise rock phosphate deposit offshore New Zealand and overseas phosphate deposits. The Company holds a mining permit over an area off the coast of New Zealand with significant seabed deposits of rock phosphate and other minerals. The permit area of approximately 820 square kilometers is over 450 kilometers east of Christchurch, at approximately 400 meters water depths on the Chatham Rise and in New Zealand territory. The Company operates in the minerals exploration industry within New Zealand.",
        -0.0022,
        1.42126,
        "New Zealand",
        "NZD",
        2.18619,
        null,
        null,
        null,
        -0.00172,
        -0.00172,
        -895490,
        -9.059821996895554,
        8.11298e+06,
        null,
        -1.16312e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Agricultural Chemicals - NEC",
        -0.0022,
        0,
        8.298450000000001e+06,
        -185470,
        -817900,
        null,
        null,
        null,
        null,
        0.012,
        0.005,
        0.81371,
        null,
        null,
        0,
        42.85714,
        null,
        null,
        -0.18951679999999999,
        -0.1586804,
        -0.18951679999999999,
        -0.18951679999999999,
        null,
        "Basic Materials",
        "NZX:CRP",
        6.40348e+06,
        2.01954e+06,
        null,
        0,
        4.4588901e+08,
        4.4588901e+08,
        "http://www.rockphosphate.co.nz/"
      ],
      "s": "NZX:CRP"
    },
    {
      "f": [
        2.14661e+06,
        0.04536,
        1.23148,
        "Cavalier Corporation Limited is an Australia-based company, which operates in the soft flooring market. The principal activities of the Company consist of the Cavalier Bremworth and Norman Ellison Carpets broadloom carpet businesses; the Elco Direct wool procurement business, and the Radford felted yarn operation. The Company's operating segments include carpets and wool acquisition. The carpets segment is engaged in the manufacturing and sales of carpets by the Cavalier Bremworth and Norman Ellison broadloom carpet businesses. The wool acquisition segment operates through Elco Direct. Norman Ellison Carpets manufactures a range of wool, wool-blend and synthetic carpets. The Company also holds interest in commission woolscourer, Cavalier Wool Holdings Limited, which is engaged in providing commission scouring services and operates through Hawkes Bay Woolscourers and Timaru-based Canterbury Woolscourers. Its geographical segments include New Zealand, Australia and Rest of the world.",
        0.09416,
        1.42126,
        "New Zealand",
        "NZD",
        2.27375,
        54.35331,
        null,
        null,
        0.04536,
        0.04536,
        1.2305e+07,
        7.152321820398212,
        8.800932e+07,
        null,
        -172000,
        "NZD",
        2.362e+06,
        0.21143450000000003,
        0.21143450000000003,
        4.0251e+07,
        "Carpets \u0026 Curtains",
        0.04536,
        1.90371e+08,
        5.150932e+07,
        3.65e+07,
        3.115e+06,
        561,
        3969,
        0.0343802,
        0.0283814,
        0.95,
        0.52,
        0.74263,
        16.53439,
        7.96495,
        -5.06329,
        25,
        0.27057,
        0.66352,
        0.0273673,
        0.0196839,
        0.0459626,
        0.0273673,
        339342.3,
        "Consumer Cyclical",
        "NZX:CAV",
        1.47376e+08,
        8.1523e+07,
        3.77e+07,
        1.90371e+08,
        6.86791e+07,
        6.86791e+07,
        "http://www.cavcorp.co.nz/"
      ],
      "s": "NZX:CAV"
    },
    {
      "f": [
        4.250065e+07,
        0.42089416631117516,
        1.5993,
        "Downer EDI Limited provides services to customers in markets, including transport services, technology and communications services, utility services, rail, mining, and engineering, construction and maintenance. The Company's segments include Transport Services, which includes its road, rail infrastructure, bridge, airport and port businesses, and provides a range of transport infrastructure services, such as maintenance and earth works; Technology and Communications Services, including services, such as civil construction, network construction, commissioning and testing; Utility Services, including water lifecycle solutions for municipal and industrial water users and sugar cane waste fired cogeneration plants; Rail, including rail asset solutions, such as passenger and freight build; Engineering, Construction and Maintenance, which includes services, such as engineering design and civil works for projects, and Mining, including blasting services and exploration drilling services.",
        0.89895,
        1.35962,
        "Australia",
        "AUD",
        1.53542,
        31.87934,
        -1.131e+08,
        0.2508806872508495,
        0.40313,
        0.37773,
        5.554e+08,
        5.096512423478574,
        2.9589317748929844e+09,
        0.23185556846766006,
        1.0829682999661669e+08,
        "NZD",
        8.053e+08,
        0.5310975,
        0.5310975,
        3.636e+09,
        "Construction \u0026 Engineering - NEC",
        0.37782,
        6.8462e+09,
        2.6820222163398595e+09,
        8.63e+07,
        1.806e+08,
        19000,
        18756,
        0.0404458,
        0.0356256,
        6.28,
        2.77,
        1.34337,
        15.99026,
        5.97092,
        -0.65789,
        83.0303,
        0.37476,
        1.29794,
        0.0668468,
        0.0440235,
        0.0907981,
        0.0668468,
        360326.3,
        "Capital Goods",
        "NZX:DOW",
        4.2003e+09,
        2.1155e+09,
        6.658e+08,
        6.8462e+09,
        4.247852e+08,
        4.247852e+08,
        "http://www.downergroup.com/"
      ],
      "s": "NZX:DOW"
    },
    {
      "f": [
        195490,
        0.53387,
        0.28605,
        "Delegat Group Limited is a producer of branded New Zealand wines for export and domestic markets. The Company's Delegat Limited, Delegat Australia Pty Ltd, Delegat Europe Limited, Delegat USA, Inc. and Other Segments. The Company's brands include Oyster Bay and Barossa Valley Estate. Its Oyster Bay brand wines include Oyster Bay Marlborough Sauvignon Blanc, Oyster Bay Marlborough Chardonnay, Oyster Bay Hawke's Bay Pinot Gris, Oyster Bay Marlborough Pinot Noir, Oyster Bay Hawke's Bay Merlot, Oyster Bay Sparkling Cuvee Brut and Oyster Bay Sparkling Cuvee Rose. Its Barossa Valley Estate brand wines include Shiraz, Grenache Shiraz Mourvedre and Cabernet Sauvignon. The Company sells and markets its product through a combination of subsidiary companies based overseas or to customers and distributors directly in the New Zealand, Canadian, Asian and Pacific Island markets.",
        0.64784,
        1.42126,
        "New Zealand",
        "NZD",
        4.9509,
        91.48191,
        -1.1124e+07,
        null,
        0.53376,
        0.53366,
        9.6542e+07,
        8.89939197447743,
        8.591651e+08,
        0.125,
        -8.192e+07,
        "NZD",
        null,
        0.5912868,
        0.5912868,
        1.50408e+08,
        "Wineries",
        0.53387,
        2.54374e+08,
        5.764421e+08,
        2.82723e+08,
        5.399e+07,
        200,
        2054,
        0.33421649999999997,
        0.2962567,
        6.4,
        5.57,
        1.83647,
        10.68096,
        8.79849,
        -1.04167,
        2.51799,
        2.26612,
        1.41985,
        0.0924029,
        0.0865006,
        0.18385829999999997,
        0.0924029,
        null,
        "Consumer/Non-Cyclical",
        "NZX:DGL",
        6.87922e+08,
        1.83129e+08,
        2.87148e+08,
        2.54374e+08,
        1.0113e+08,
        1.0113e+08,
        "http://www.delegatsgroup.co.nz/"
      ],
      "s": "NZX:DGL"
    },
    {
      "f": [
        1.58209e+06,
        -0.01839,
        null,
        "EROAD Limited is a New Zealand-based transport technology and services company. The Company offers an electronic solution to manage and pay road user charges (RUC) and road tax regimes; support regulatory compliance, as well as provide commercial services to the heavy vehicle industry. The Company operates through three segments: Development Markets, Commercial Markets and Established Markets. The Development Markets segment includes the market opportunity that has been validated, or has been identified and is in the process of being validated. The Commercial Markets segment includes the market that has been entered and whose trading has commenced. The Established Markets segment includes a business that has been established in the market. It designs and manufactures in-vehicle hardware, operates secure payment and merchant gateways, and offers Web-based services. It also provides a fuel tax reporting service in North America.",
        0.10689,
        1.42126,
        "New Zealand",
        "NZD",
        1.01683,
        11.9196,
        null,
        null,
        -0.0327,
        -0.03351,
        7.66729e+06,
        12.068754409967537,
        9.253464e+07,
        0,
        -2.174227e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Portable Satellite Navigation",
        -0.0192,
        2.616457e+07,
        9.940534e+07,
        -6.8707e+06,
        -1.09951e+06,
        196,
        1021,
        -0.0749842,
        -0.0850508,
        2.98,
        1.45,
        1.96845,
        null,
        12.54305,
        -2.94118,
        -27.63158,
        3.37277,
        null,
        -0.036414499999999995,
        -0.0278843,
        -0.0380576,
        -0.036414499999999995,
        150371.8,
        "Technology",
        "NZX:ERD",
        7.414674e+07,
        2.206044e+07,
        6.01931e+06,
        2.616457e+07,
        6.024566e+07,
        6.024566e+07,
        "http://www.eroad.co.nz/"
      ],
      "s": "NZX:ERD"
    },
    {
      "f": [
        59520,
        -0.13701,
        null,
        "AFT Pharmaceuticals Limited is a pharmaceutical distributor and developer of pharmaceutical intellectual property. The Company's segments include New Zealand, Australia, Asia and Rest of World. The Company's products include Crystaderm, Maxigesic, Coco-scalp, Maxiclear, RestoraNail and Myconail, among others. The Company's NasoSURF Nebuliser is in pilot scale production. The Company is focused on conducting clinical for Maxigesic oral dose forms. The Company is also conducting clinical trials of Maxigesic intravenous (IV). Maxigesic PE is a cold and flu variant. Its subsidiary, AFT Pharmaceuticals (AU) Pty Ltd, is engaged in distribution of pharmaceuticals in Australia. Its subsidiary, AFT Pharmaceuticals Singapore Pte Ltd, is engaged in the registration of pharmaceuticals in Singapore. Its subsidiary, AFT Pharmaceuticals (S.E. Asia) Sdn Bhd, is engaged in the distribution of pharmaceuticals in Malaysia.",
        -0.13424,
        1.42126,
        "New Zealand",
        "NZD",
        3.66494,
        122.0727,
        -1.652e+06,
        0,
        -0.18486,
        -0.18486,
        -1.3056e+07,
        -20.02158394607843,
        2.6140179999999997e+08,
        0,
        -1.6785e+07,
        "NZD",
        null,
        0.3729652,
        0.3729652,
        2.3579e+07,
        "Pharmaceuticals - NEC",
        -0.13701,
        6.401399999999999e+07,
        2.662958e+08,
        -4.894e+06,
        -1.3267e+07,
        null,
        null,
        -0.2156152,
        -0.2791092,
        3.22,
        2.4,
        14.74996,
        null,
        null,
        -0.36232,
        null,
        4.14417,
        2.10112,
        -0.5205607,
        -0.37884,
        -1.6263859999999999,
        -0.5205607,
        null,
        "Healthcare",
        "NZX:AFT",
        5.381e+07,
        5.0272e+07,
        2.2039e+07,
        6.401399999999999e+07,
        9.683484e+07,
        9.683484e+07,
        "http://www.aftpharm.com/"
      ],
      "s": "NZX:AFT"
    },
    {
      "f": [
        4.9003e+06,
        0.20881,
        null,
        "CBL Corporation Limited (CBL) is an international specialist insurer and reinsurer focused on credit and financial risk. The Company operates through subsidiaries, including CBL Insurance Limited (CBL Insurance), Assetinsure Pty Limited (AI), European Insurance Services Limited (EISL), CBL Insurance Europe Limited (CBLIE) and Professional Fee Protection Limited (PFP). The Company's segments are CBL Insurance, AI, CBLIE, EISL, PFP, CBL and Other. The CBL Insurance segment includes general insurance and reinsurance operations located in New Zealand. The AI segment includes general insurance and reinsurance operations located in Australia. The CBLIE segment includes general insurance operations located in Ireland. The EISL segment includes Managing general agency (MGA) located in the United Kingdom. The PFP segment includes an insurance agency located in the United Kingdom. The Company writes business in over 20 countries. PFP is a provider of tax investigation fee protection insurance.",
        0.23753,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        32.62149,
        -830000,
        0.03018,
        0.1542,
        0.1542,
        1.5492e+08,
        4.065277562612962,
        6.297928e+08,
        0.0645,
        7.1884e+07,
        "NZD",
        5.1254e+07,
        null,
        null,
        null,
        "Property \u0026 Casualty Reinsurance",
        0.20881,
        2.44451e+08,
        8.605898e+08,
        -2.30797e+08,
        3.5488e+07,
        null,
        516,
        0.2040699,
        0.1503247,
        4.02,
        2.1,
        4.06146,
        23.67056,
        21.84904,
        2.8169,
        59.38865,
        2.95374,
        null,
        null,
        null,
        null,
        null,
        null,
        "Financial",
        "NZX:CBL",
        7.46256e+08,
        null,
        6.4402e+07,
        2.44451e+08,
        2.1967717e+08,
        2.1967717e+08,
        "http://cblcorporation.co.nz/"
      ],
      "s": "NZX:CBL"
    },
    {
      "f": [
        1.94435e+06,
        0.84031,
        0.49315,
        "Ebos Group Limited is a marketer, wholesaler and distributor of healthcare, medical and pharmaceutical products. The Company is also an animal care products marketer and distributor. Its segments include Healthcare, Animal care and Corporate. The Healthcare segment incorporates the sale of healthcare products in a range of sectors, own brands, retail healthcare, wholesale activities and logistics. The Animal care segment incorporates the sale of animal care products in a range of sectors, own brands, retail and wholesale activities. Its businesses include Community Pharmacy, Institutional Healthcare, Contract Logistics and Animal Care. Community Pharmacy includes Symbion, Endeavour Consumer Health, ProPharma, DoseAid and Intellipharm. Institutional Healthcare includes EBOS Healthcare, Onelink, Clinect and Zest. Contract Logistics comprises Healthcare Logistics, Symbion Contract Logistics and Symbion Clinical Trials. Animal Care includes Masterpet, Lyppard, Animates and Vitapet.",
        1.00368,
        1.42126,
        "New Zealand",
        "NZD",
        1.13827,
        33.83011,
        -7.7014e+07,
        0.585,
        0.84032,
        0.84032,
        2.22696e+08,
        12.353719869238782,
        2.751124e+09,
        0.6096,
        1.35983e+08,
        "NZD",
        8.29163e+08,
        0.0952678,
        0.0952678,
        6.7654e+08,
        "Drug Retailers - NEC",
        0.84031,
        7.101455e+09,
        2.503548e+09,
        2.47576e+08,
        1.26997e+08,
        2700,
        6741,
        0.028273799999999998,
        0.0254476,
        19.4,
        13,
        2.29349,
        19.61158,
        16.5047,
        0.4878,
        20.64422,
        0.35254,
        0.81348,
        0.0907281,
        0.044227100000000005,
        0.1187829,
        0.0907281,
        2.630169e+06,
        "Healthcare",
        "NZX:EBO",
        3.192896e+09,
        2.027468e+09,
        3.67827e+08,
        7.101455e+09,
        1.51314e+08,
        1.51314e+08,
        "http://www.ebosgroup.com/"
      ],
      "s": "NZX:EBO"
    },
    {
      "f": [
        1.7087605e+08,
        1.1938566242204014,
        1.73849,
        "Credit Agricole SA is a French banking group that offers banking and insurance services through a network of regional, local banks and its branches. The Bank's principal lines of business include Retail Banking which include French retail banking and International retail banking; Specialized Financial Services which covers asset management and securities, insurance, consumer finance, private banking, leasing \u0026 factoring and specialized subsidiaries and activities; and Corporate and Investment Banking which offers a range of products and services in capital markets, brokerage, investment banking, structured finance and commercial banking. In March 2014, its Credit Agricole Capital Investissement \u0026 Finance sold its stake in F2I (Fondi italiani per le infrastrutture) to investment vehicle structured by Partners Group. In May 2014, it announced the dissolution and division of assets held at BESPAR - Sociedade Gestora de Participacoes Sociais, SA (BESPAR).",
        1.38319,
        0.96043,
        "France",
        "EUR",
        null,
        335.8621,
        null,
        0.887889799360703,
        0.71018,
        0.71018,
        null,
        null,
        3.607534138100643e+11,
        0.8887776891600637,
        -1.0881089491165415e+10,
        "NZD",
        1.37e+10,
        null,
        null,
        null,
        "Commercial Banks",
        0.80676,
        2.6269e+10,
        4.94710886848599e+10,
        2.10352e+11,
        3.516e+09,
        71499,
        null,
        0.050602999999999995,
        0.050602999999999995,
        12,
        6.79,
        0.54036,
        16.75632,
        null,
        3.52327,
        11.73709,
        0.54483,
        null,
        null,
        0.0017990999999999999,
        0.0346196,
        null,
        null,
        "Financial",
        "NZX:CASHA",
        1.5697e+12,
        null,
        1.948e+11,
        null,
        2.63369608e+09,
        2.63369608e+09,
        "https://www.credit-agricole.fr/"
      ],
      "s": "NZX:CASHA"
    },
    {
      "f": [
        1.6947e+06,
        0.04165,
        0.27492,
        "Barramundi Limited is a New Zealand-based investment company. The principal activity of Company is investment in growing Australian companies. The Company's investment objectives are to achieve a high real rate of return, consisting of both income and capital growth, within risk parameters acceptable to the directors and provide access to a diversified portfolio of Australian growth stocks through a single tax efficient investment vehicle. The Company offers an investor with an opportunity to invest in a portfolio of Australian equity investments through a single investment company. The Company invests in healthcare, consumer and industrials sectors. Barramundi Limited is Fisher Funds Management Limited is the investment manager of the Company.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        104.3898,
        0,
        -4.581e+06,
        0.05114,
        0.04229,
        0.04222,
        90000,
        -68.32411111111111,
        -6.14917e+06,
        null,
        -1.2262e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        0.04144,
        2.269e+06,
        9.168683e+07,
        -9.7836e+07,
        5.417e+06,
        null,
        null,
        3.0193920000000003,
        3.0193920000000003,
        0.67,
        0.61,
        0.9361,
        14.92184,
        null,
        -1.5625,
        0,
        40.40847,
        null,
        0.058440200000000005,
        0.0566199,
        0.0584522,
        0.058440200000000005,
        null,
        "Financial",
        "NZX:BRM",
        9.8309e+07,
        9.8022e+07,
        0,
        2.269e+06,
        1.4462322e+08,
        1.4462322e+08,
        "http://www.barramundi.co.nz"
      ],
      "s": "NZX:BRM"
    },
    {
      "f": [
        6.81561e+06,
        -0.0007,
        1.5863,
        "BLIS Technologies Limited is a New Zealand-based company, which is engaged in research, development and commercialization of healthcare products based on strains of bacteria that produce bacteriocins. The Company is also engaged in supply of healthcare ingredients and the manufacture of part and finished goods and food products for sale in domestic and international markets. The Company supplies BLIS-branded finished goods. The Company's products include BLIS K12 and BLIS M18, which are oral probiotics providing protection for ear, nose and throat health, halitosis (bad breath), gums and teeth health and immune support. The Company distributes its products through Stratum Nutrition in North America, NZPR Group in China, and Bluestone Pharma in Europe and Middle East. Its other BLIS branded products include Throat Guard EVERYDAY BLIS K12, Travel Guard BLIS K12, Fresh Breath Kit K12 and Toddler Protect BLIS K12 Powder for Toddlers.",
        -0.00022,
        1.42126,
        "New Zealand",
        "NZD",
        6.65315,
        null,
        null,
        null,
        9e-05,
        9e-05,
        607000,
        80.12423393739704,
        4.863541e+07,
        null,
        -919000,
        "NZD",
        null,
        null,
        null,
        null,
        "Generic Pharmaceuticals",
        -0.0007,
        5.661e+06,
        4.984441e+07,
        -1.209e+06,
        -816000,
        10,
        null,
        0.0025118000000000002,
        0.0025118000000000002,
        0.061,
        0.025,
        10.88543,
        500,
        82.116,
        0,
        50,
        7.36472,
        5.81982,
        0.003787,
        0.0032548,
        0.003787,
        0.003787,
        null,
        "Healthcare",
        "NZX:BLT",
        5.023e+06,
        2.954e+06,
        null,
        5.661e+06,
        1.107653e+09,
        1.107653e+09,
        "http://blis.co.nz/"
      ],
      "s": "NZX:BLT"
    },
    {
      "f": [
        3.634505e+07,
        0.41266,
        1.02414,
        "Air New Zealand Limited is engaged in the transportation of passengers and cargo on an integrated network of scheduled airline services to, from and within New Zealand. The Company, through its subsidiaries, is also engaged in aviation, aircraft leasing and financing, investment, and engineering services. It is engaged in the operation of domestic and international passenger transport and cargo. Its operational fleet includes Boeing 777-300ER, Boeing 777-200ER, Boeing 787-9 Dreamliner, Boeing 767-300ER, Airbus A320-200, ATR 72-500/72-600, Bombardier Q300 and Beech 1900D. The Company offers check in and immigration services; baggage services, such as cabin baggage and excess baggage; on board flight services, and special assistant services for disable and pregnant people, and children, among others. The Company's short haul operations are represented in New Zealand, Australia and Pacific Islands, and its long haul operations are represented in Asia, North America and Europe.",
        0.8169,
        1.42126,
        "New Zealand",
        "NZD",
        0.94658,
        121.7742,
        -2.3e+08,
        0.2,
        0.4125,
        0.40661,
        1.186e+09,
        2.8089013490725128,
        3.331357e+09,
        0.22429,
        -1.54e+08,
        "NZD",
        null,
        0.5761805,
        0.5761805,
        3.014e+09,
        "Airlines - NEC",
        0.40757,
        5.231e+09,
        2.380357e+09,
        9.51e+08,
        4.63e+08,
        10527,
        26975,
        0.1479641,
        0.1267444,
        2.92183,
        1.715,
        1.1292,
        5.21384,
        2.56504,
        -1.85185,
        -17.86912,
        0.45505,
        0.9049,
        0.09822850000000001,
        0.0660202,
        0.2273508,
        0.09822850000000001,
        496912.7,
        "Transportation",
        "NZX:AIR",
        7.251e+09,
        2.339e+09,
        2.567e+09,
        5.231e+09,
        1.12281004e+09,
        1.12281004e+09,
        "http://www.airnewzealand.co.nz"
      ],
      "s": "NZX:AIR"
    },
    {
      "f": [
        51930,
        -0.005329725,
        null,
        "CSM Group Limited, formerly Orion Minerals Group Limited, is a New Zealand-based holding company. The Company is engaged in a business operation in Australia processing scrap metal for export sale to Chinese markets. The Company's segments include China Scrap Metals Resources Pty Limited (CSM Ltd Australia) and Holding company New Zealand. The Company's CSM Ltd Australia segment includes the business operation in Australia, which is involved in the processing of scrap metal for export sale to Chinese markets. Its subsidiary includes China Scrap Metal Resources Pty Limited, which operates a scrap metal acquisition, aggregation, processing and distribution facility in Geelong, Victoria in Australia. It focuses on purchasing ferrous metals, such as steel and iron, from local customers, for domestic sale and for export internationally.",
        -0.00315,
        1,
        "New Zealand",
        "USD",
        20.72028,
        0,
        null,
        null,
        -0.00372,
        -0.00372,
        -1.47385e+06,
        -3.474010245275978,
        7.2770928142e+06,
        null,
        -1.5210466646e+06,
        "NZD",
        null,
        0.4320988,
        0.4320988,
        70000,
        "Iron Ore Mining",
        -0.00375,
        230240,
        1.178366666e+07,
        -3.17083e+06,
        -1.093e+06,
        null,
        null,
        -6.401235000000001,
        -6.746912999999999,
        0.02,
        0.005,
        1.59518,
        null,
        null,
        0,
        100,
        36.00961,
        17.35664,
        -0.2576311,
        -0.2505157,
        -0.2576311,
        -0.2576311,
        null,
        "Basic Materials",
        "NZX:CSM",
        3.8e+06,
        2.963e+06,
        0,
        162000,
        4.1455e+08,
        4.1455e+08,
        "http://www.orionminerals.co.nz/"
      ],
      "s": "NZX:CSM"
    },
    {
      "f": [
        1.994374e+07,
        0.64053,
        1.02945,
        "Fletcher Building Limited is a holding company. The Company is involved in the manufacturing and distribution of building materials, and residential and commercial construction. Its segments include Building Products, International, Distribution, Residential and Land Development, and Construction. The Building Products segment is a manufacturer, distributor and marketer of building products used both commercially and in residential markets. The International segment includes laminates and panels businesses that manufacture and distribute decorative surface laminates, and roof tiling businesses. The Distribution segment consists of building, plumbing, pipeline and steel distribution businesses in Australia and New Zealand. The Residential and Land Development segment develops land holdings for both residential and commercial use, and is a residential home builder. The Construction segment includes Fletcher Construction, a general contractor in New Zealand and the South Pacific.",
        0.86695,
        1.42126,
        "New Zealand",
        "NZD",
        1.61342,
        47.46681,
        -2.35e+08,
        0.39,
        0.64121,
        0.61337,
        8.188753e+08,
        9.997579240697576,
        8.1867707e+09,
        0.40848,
        1.195788e+08,
        "NZD",
        1.083e+09,
        0.2484451,
        0.2484451,
        2.237e+09,
        "Construction Supplies \u0026 Fixtures - NEC",
        0.62519,
        8.613497e+09,
        6.851315e+09,
        1.335456e+09,
        4.62e+08,
        18750,
        39484,
        0.0798534,
        0.0670813,
        10.785,
        6.045,
        1.93952,
        16.2218,
        10.73752,
        -3.30418,
        51.21581,
        0.79542,
        0.87281,
        0.0877958,
        0.0640574,
        0.1253051,
        0.0877958,
        null,
        "Capital Goods",
        "NZX:FBU",
        7.267e+09,
        3.222e+09,
        1.752e+09,
        9.004e+09,
        6.8826892e+08,
        6.8826892e+08,
        "http://www.fbu.com/"
      ],
      "s": "NZX:FBU"
    },
    {
      "f": [
        202470,
        0.025016478326083696,
        -0.17111,
        "Antipodes Gold Limited, formerly Glass Earth Gold Limited, is a development-stage company. The Company is an exploration and development company, which intends to become a diversified phosphate explorer and developer. The Company operates through the gold exploration segment. The Company's subsidiaries include Glass Earth (New Zealand) Limited, HPD New Zealand Limited, Glass Earth Mining Limited, Glass Earth Geothermal Limited and others.",
        0.0223,
        1.3334,
        "New Zealand",
        "CAD",
        1.77083,
        0,
        null,
        null,
        0.00066,
        -0.00046,
        -318000,
        -0.8181132075471698,
        277302.38608069596,
        null,
        -213178.34108294584,
        "NZD",
        null,
        null,
        null,
        0,
        "Gold Mining",
        0.02221,
        0,
        281565.9529023549,
        -4000,
        248000,
        null,
        null,
        null,
        null,
        0.04,
        0.005,
        1.42792,
        37.87879,
        2.40149,
        25,
        400,
        null,
        null,
        0.0385675,
        0.0064815,
        0.0385675,
        0.0385675,
        null,
        "Basic Materials",
        "NZX:AXG",
        425000,
        425000,
        0,
        0,
        1.056658e+07,
        1.056658e+07,
        "http://www.antipodesgold.co.nz/"
      ],
      "s": "NZX:AXG"
    },
    {
      "f": [
        0,
        -0.0225,
        null,
        "Cooks Global Foods Limited is a New Zealand-based company engaged in the food and beverage industry. The Company's segments include Global franchising \u0026 design, UK franchising \u0026 retail, Ireland franchising \u0026 retail, China franchising \u0026 retail, Supply and Corporate. It owns the franchising rights to the Esquires Coffee brand (excluding Australia and New Zealand). In the United Kingdom, Ireland and China, the Company directly operates and franchises Esquires Coffee stores, whilst in the Middle East, Indonesia, Northern Cyprus and Canada, the Company has master franchise agreements. The Company's Esquires franchising and retail segment receives two main income streams: Retail Sales from owned stores (the United Kingdom, Ireland and China) and Royalties from and Product Sales to Franchisees (the United Kingdom, Ireland, the Middle East and China). The Company's Supply segment represents the supply of tea/coffee/beverages and fresh produces.",
        -0.02149,
        1.42126,
        "New Zealand",
        "NZD",
        0.9759,
        56.18976,
        null,
        null,
        -0.0221,
        -0.0221,
        -6.485e+06,
        -6.377016191210486,
        4.135495e+07,
        0,
        -6.422e+06,
        "NZD",
        null,
        0.6427307999999999,
        0.6427307999999999,
        7.993e+06,
        "Shell Companies",
        -0.0225,
        1.2436e+07,
        3.713995e+07,
        4.215e+06,
        -7.877e+06,
        null,
        null,
        -0.5952879,
        -0.6362977999999999,
        0.139,
        0.06,
        3.97729,
        null,
        null,
        0,
        -30.76923,
        2.98649,
        0.89346,
        -0.8020197,
        -0.3825166,
        -0.8884002,
        -0.8020197,
        null,
        "Services",
        "NZX:CGF",
        2.0952e+07,
        9.801e+06,
        5.247e+06,
        1.2436e+07,
        4.1266615e+08,
        4.1266615e+08,
        "http://cooksglobalfoods.com/"
      ],
      "s": "NZX:CGF"
    },
    {
      "f": [
        1.7460918e+08,
        0.3482014871802415,
        1.50699,
        "AMP Limited is an independent wealth management company with an international investment management business and a retail banking business in Australia. The Company's operating segments include Australian wealth management, which provides customers with financial advice services, superannuation products, retirement income, investment, and financial advice services; AMP Capital, which is an investment manager, managing investments across asset classes, including equities, fixed interest, infrastructure, property, diversified funds, multimanager and multi-asset funds; Australian wealth protection, which includes individual and group term, disability and income protection insurance products; AMP Bank, which offers residential mortgages, deposits, transaction banking and self-managed superannuation fund (SMSF) products; New Zealand financial services, which is a risk insurance business, and Australian mature business, which includes endowment, investment account and annuities.",
        0.67971,
        1.35962,
        "Australia",
        "AUD",
        null,
        209.5553,
        -8e+08,
        0.2926941351259911,
        0.33803,
        0.33666,
        4.848e+09,
        5.8040016501650165,
        2.941346084052897e+10,
        0.2912620245362674,
        3.5959565172621757e+08,
        "NZD",
        2.784e+09,
        null,
        null,
        null,
        "Wealth Management",
        0.33084,
        1.3976e+10,
        1.5304558191259321e+10,
        1.3497e+10,
        9.72e+08,
        5400,
        807759,
        0.3976062,
        0.1831207,
        5.96,
        4.385,
        1.68323,
        14.70326,
        6.80335,
        3.55649,
        -10.32609,
        1.27912,
        null,
        null,
        0.013338699999999998,
        0.116709,
        null,
        2.11963e+06,
        "Financial",
        "NZX:AMP",
        1.40875e+11,
        null,
        1.8049e+10,
        1.3976e+10,
        2.92881568e+09,
        2.92881568e+09,
        "https://www.amp.com.au"
      ],
      "s": "NZX:AMP"
    },
    {
      "f": [
        1.89056e+06,
        0.00478,
        2.15856,
        "Allied Farmers Limited is a rural services and finance company. The Company provides livestock trading and real estate services. The Company's segments are Asset Management Services, Livestock services and Corporate. The Asset Management Services segment activities are carried out by Allied Farmers Investments Limited (AFIL) and subsidiary companies. AFIL consists of two general operating divisions: Finance, which holds various loans secured over properties and other assets, and Property, which hold real estate and related trading businesses, such as golf course, restaurant and accommodation services. The Livestock services segment relates to sale yard activities and calf procurement, processing and sales carried out in Taranaki, Waikato, King Country, Manawatu and South Island. The Corporate segment includes corporate activities of the Company, including the remaining activities of the holding company Allied Farmers Rural Ltd.",
        0.01285,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        null,
        null,
        null,
        0.00468,
        0.00458,
        2.791e+06,
        5.049971336438553,
        1.409447e+07,
        null,
        1.237e+06,
        "NZD",
        null,
        0.7105985,
        0.7105985,
        1.1398e+07,
        "Fishing \u0026 Farming Wholesale",
        0.00471,
        1.604e+07,
        1.124447e+07,
        2.85e+06,
        705000,
        175,
        null,
        0.0981297,
        0.0981297,
        0.07,
        0.04,
        null,
        15.28384,
        5.84432,
        2.94118,
        45.83333,
        0.70103,
        null,
        0.3780554,
        0.1131293,
        null,
        0.3780554,
        null,
        "Financial",
        "NZX:ALF",
        1.2728e+07,
        null,
        5.328e+06,
        1.604e+07,
        1.59185e+08,
        1.59185e+08,
        "http://www.nzfl.info/"
      ],
      "s": "NZX:ALF"
    },
    {
      "f": [
        125069.99999999999,
        0.16024,
        0.55688,
        "AWF Madison Group Limited is a recruitment company. The Company's principal services are the supply of temporary staff and recruitment of permanent staff. The Company's segments include temporary staffing to industry, and temporary, contract and permanent staff services to commerce. The temporary staffing to industry segment operates its branches in towns and cities throughout New Zealand. Its temporary, contract and permanent staff services to commerce segment operates its branches under the brand names Madison Recruitment and Madison Force throughout New Zealand. It supplies semi-skilled and skilled workers to the construction, infrastructure, manufacturing, food processing, timber processing and waste management sectors. Its service spans entry level and support recruitment to that of professional roles and managerial positions. Its subsidiaries include Allied Work Force Limited, Allied Work Force Christchurch Limited, Madison Recruitment Limited and Madison Force Limited.",
        0.24563,
        1.42126,
        "New Zealand",
        "NZD",
        1.70887,
        55.77837,
        -5.052e+06,
        0.152,
        0.17631,
        0.17631,
        1.2423e+07,
        8.29336553167512,
        1.0302848e+08,
        null,
        -3.293e+06,
        "NZD",
        2.8694e+07,
        0.9858516,
        0.9858516,
        2.11531e+08,
        "Employment Services - NEC",
        0.16024,
        2.14589e+08,
        8.115848e+07,
        2.187e+07,
        5.202e+06,
        153,
        null,
        0.0423045,
        0.0370011,
        2.7,
        2.1,
        2.18189,
        14.17957,
        9.51782,
        -6.71642,
        14.15525,
        0.3566,
        null,
        0.1000891,
        0.0748558,
        0.1540054,
        0.1000891,
        null,
        "Services",
        "NZX:AWF",
        7.9191e+07,
        3.482e+07,
        2.1e+07,
        2.14589e+08,
        3.285839e+07,
        3.285839e+07,
        "http://www.awf.co.nz/"
      ],
      "s": "NZX:AWF"
    },
    {
      "f": [
        809340,
        null,
        0.19419,
        "Comvita Limited is an international natural health products company. The Company is engaged in the manufacturing and marketing natural health products, and apiary ownership and management. Its segments include New Zealand, which includes production and extraction facilities at Paengaroa, Northland, Waikato, Whanganui, Wairarapa, Hawkes Bay, East Coast, Nelson and Timaru, and Apiary operations in Northland, Waikato, Whanganui, Wairarapa, Hawkes Bay and East Coast; Australia, which includes over 242 hectares of olive leaf plantation, extraction and manufacturing facility in rural Queensland; Asia, which includes operations in Hong Kong, Taiwan, China, Japan, Korea and South Korea; Europe, which includes the operations in the United Kingdom and European markets; Medical, which includes bulk medical honey sales and royalty payments received from Derma Sciences, Inc., and Other, which captures revenue earned from other areas, including bulk sales, the United States and Canada.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        6.3317,
        65.83788,
        -1.0184e+07,
        0.16,
        null,
        null,
        null,
        null,
        4.555057e+08,
        0.21667,
        null,
        "NZD",
        null,
        null,
        null,
        1.17311e+08,
        "Special Foods \u0026 Welbeing Products",
        null,
        null,
        3.714857e+08,
        8.402e+07,
        1.862e+07,
        143,
        2063,
        null,
        null,
        13,
        8.18,
        2.59947,
        null,
        null,
        -2.77778,
        6.06061,
        null,
        1.89196,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "NZX:CVT",
        2.43268e+08,
        1.3591e+08,
        8.68e+07,
        2.30743e+08,
        3.9167e+07,
        3.9167e+07,
        "http://www.comvita.com/"
      ],
      "s": "NZX:CVT"
    },
    {
      "f": [
        118600,
        1.34675,
        0.36405,
        "Abano Healthcare Group Limited is a healthcare and medical services provider. The Company's segments include Dental, Audiology, Diagnostics, Rehabilitation and Corporate. The Dental segment is engaged in providing a range of general and specialist dental work, including restorative and cosmetic dental services. The Company operates dental businesses in New Zealand and Australia. Its Diagnostics segment comprises radiology businesses operating in New Zealand. It provides total imaging services, including Ultrasound Scanning, Mammography, Interventional Radiology, Angiography, Magnetic resonance imaging (MRI) Scanning and others. The audiology segment is engaged in providing professional clinical audiology services, particularly hearing tests, the supply and fitting of hearing aid devices, and follow up consultations, all of which are provided to both private patients, as well as publicly funded patients. It operates audiology businesses in Australia, Malaysia, Singapore and Taiwan.",
        1.80927,
        1.42126,
        "New Zealand",
        "NZD",
        1.74902,
        103.0914,
        -5.314e+06,
        0.31765,
        1.34178,
        1.34178,
        2.7242e+07,
        10.731341311210631,
        2.923432e+08,
        0.3425,
        900000,
        "NZD",
        1.70542e+08,
        0.8489314,
        0.8489314,
        1.81454e+08,
        "Hospitals, Clinics \u0026 Primary Care Services",
        1.34675,
        2.13744e+08,
        1.760152e+08,
        1.16328e+08,
        2.8442e+07,
        700,
        2171,
        0.17362829999999999,
        0.1488744,
        9,
        6.69,
        1.52664,
        6.11129,
        4.60652,
        2.5,
        4.70014,
        0.82349,
        1.5246,
        0.12991809999999998,
        0.1151003,
        0.2790415,
        0.12991809999999998,
        null,
        "Healthcare",
        "NZX:ABA",
        2.73653e+08,
        4.782e+07,
        1.17784e+08,
        2.13744e+08,
        2.127098e+07,
        2.127098e+07,
        "http://www.abano.co.nz/"
      ],
      "s": "NZX:ABA"
    },
    {
      "f": [
        1.4289998e+08,
        2.0637758934113943,
        1.36607,
        "Australia and New Zealand Banking Group Limited provides a range of banking and financial products and services. The Company's segments include Australia; New Zealand; Institutional; Asia Retail \u0026 Pacific; Wealth Australia, and Technology, Services and Operations (TSO) and Group Centre. The Company's operations span Australia, New Zealand, and a number of countries in the Asia Pacific region, the United Kingdom, France, Germany and the United States. The Australia division consists of the retail and the corporate and commercial banking (C\u0026CB) business units. The New Zealand division consists of the retail and the commercial business units. The Institutional division services global institutional and business customers. The Asia Retail \u0026 Pacific division consists of the Asia retail and the Pacific business units. The Wealth Australia division consists of the insurance and funds management business units. The TSO and Group Centre division provides support to the operating divisions.",
        2.268,
        1.35962,
        "Australia",
        "AUD",
        null,
        243.4847,
        -4.564e+09,
        1.6725379150056634,
        1.9742,
        1.89464,
        1.0455e+10,
        17.094029650884742,
        1.8682047806063458e+11,
        1.677419635045086,
        6.209297009458525e+09,
        "NZD",
        null,
        null,
        null,
        null,
        "Commercial Banks",
        1.8932,
        2.9951e+10,
        9.122448285609213e+10,
        9.145e+10,
        5.709e+09,
        46554,
        544712,
        0.34077840000000004,
        0.34077840000000004,
        30.145,
        21.86,
        1.49466,
        15.73386,
        12.12899,
        -0.36765,
        12.36336,
        3.63647,
        null,
        null,
        0.0063388,
        0.0992309,
        null,
        null,
        "Financial",
        "NZX:ANZ",
        9.14869e+11,
        null,
        1.40778e+11,
        null,
        2.89896415e+09,
        2.89896415e+09,
        "http://www.anz.com"
      ],
      "s": "NZX:ANZ"
    },
    {
      "f": [
        2.034143e+07,
        -0.06434044291787411,
        1.76825,
        "APN News \u0026 Media Limited is an Australia-based media, entertainment and technology company with assets in Australia, New Zealand and Hong Kong. The Company's segments include New Zealand Media Entertainment (NZME) Publishing, NZME Radio, GrabOne, Australian Regional Media (ARM), Australian Radio Network and Outdoor. Its NZME Publishing segment offers newspaper, magazine, online publishing and events. Its NZME Radio segment operates radio networks in New Zealand. Its GrabOne segment is involved in e-commerce business. Its ARM segment is involved in newspaper and online publishing. ARM's portfolio includes approximately 12 daily newspapers, over 60 community newspapers and non-daily publications, and approximately 30 regional news Websites and mobile sites. Its Australian Radio Network segment operates metropolitan radio networks. Its Outdoor segment is involved in street furniture, billboard, transit and other outdoor advertising.",
        0.18657,
        1.35962,
        "Australia",
        "AUD",
        1.17549,
        67.42234,
        null,
        0,
        -0.15138,
        -0.15138,
        5.9214e+07,
        21.77105752018104,
        1.3475966216766448e+09,
        0.05415886836027713,
        7.530183827834247e+07,
        "NZD",
        2.451e+07,
        null,
        null,
        7.12123e+08,
        "Newspaper Publishing",
        -0.06155,
        8.54755e+08,
        8.775172966299406e+08,
        4.49692e+08,
        -1.0202e+07,
        5340,
        6933,
        0.051272700000000004,
        0.0360012,
        4.09755,
        2.4,
        2.12706,
        null,
        1477.921,
        1.11111,
        -1.86772,
        1.50874,
        1.17549,
        -0.025230600000000002,
        -0.0209333,
        -0.070459,
        -0.025230600000000002,
        null,
        "Services",
        "NZX:APN",
        6.25083e+08,
        1.222e+08,
        1.83647e+08,
        8.54755e+08,
        2.1222529e+08,
        2.1222529e+08,
        "http://www.apn.com.au/"
      ],
      "s": "NZX:APN"
    },
    {
      "f": [
        373750,
        0.48972,
        null,
        "Airwork Holdings Limited is an aviation provider. The Company provides a range of aviation services from heavy maintenance and engineering through to operations and charter of aircraft ranging from Boeing 737s to light turbine helicopters. It operates through two segments: Fixed Wing business and Helicopter business. The Fixed Wing business segment provides contract aircraft leasing, charter, aircraft flight operations and maintenance, repair and overhaul (MRO) services. It also offers air ambulance, airline disrupt support and maintenance control services. The Helicopter business segment provides helicopter MRO services in New Zealand and internationally. It also provides turbine engine and component repair and overhaul, and helicopter leasing, crewing and charters for emergency medical services, police, search and rescue, oil, gas and mineral exploration, and tourism. It provides chartering, leasing, crewing and engineering support services to helicopters and fixed wing aircraft.",
        1.07361,
        1.42126,
        "New Zealand",
        "NZD",
        1.16435,
        146.3252,
        -8.541e+06,
        0.17,
        0.48972,
        0.47433,
        6.7182e+07,
        6.002088357000387,
        4.032323e+08,
        0.22,
        -5.2418e+07,
        "NZD",
        null,
        0.7389190000000001,
        0.7389190000000001,
        1.22648e+08,
        "Specialized Aviation Services",
        0.47426,
        1.65983e+08,
        2.436713e+08,
        1.59561e+08,
        2.4604e+07,
        null,
        809,
        0.2246736,
        0.2000566,
        5.2,
        3.85,
        2.165,
        10.22495,
        4.3257,
        -2.0202,
        25.97403,
        1.46805,
        0.53147,
        0.09968070000000001,
        0.0829524,
        0.2313178,
        0.09968070000000001,
        null,
        "Transportation",
        "NZX:AWK",
        3.22956e+08,
        5.8992e+07,
        1.64689e+08,
        1.65983e+08,
        5.02415e+07,
        5.02415e+07,
        "http://www.airwork.co.nz/"
      ],
      "s": "NZX:AWK"
    },
    {
      "f": [
        291520,
        0.1236,
        null,
        "Fliway Group Limited is engaged in transportation of goods, customer logistics solutions and freight forwarding. The Company operates in the domestic supply chain, and international air and ocean freight. Its operating segments include Domestic, International, Head Office and Joint Venture. The Domestic segment consists of the revenue earned from providing goods transport and storage services within New Zealand. The International segment consists of revenue earned from moving freight between international countries. The Joint Venture segment represents equity method accounted joint venture between the Company and United Parcel Services. Its Fliway Domestic division operates through two business units: Fliway Transport, which involves the transportation of freight across the nation, and Fliway Logistics, which provides warehousing and distribution services. Its Fliway International division is engaged in organizing transportation and boarder clearance for international freight.",
        0.16953,
        1.42126,
        "New Zealand",
        "NZD",
        1.76604,
        29.90631,
        -2.597e+06,
        0.0865,
        0.1236,
        0.1236,
        9.028e+06,
        6.177747009304387,
        5.57727e+07,
        0.075,
        1.491e+06,
        "NZD",
        2.3046e+07,
        0.2697474,
        0.2697474,
        2.2293e+07,
        "Freight Logistics",
        0.1236,
        8.2644e+07,
        4.99817e+07,
        5.791e+06,
        5.616e+06,
        null,
        null,
        0.08251049999999999,
        0.0883307,
        1.17,
        0.93,
        1.52527,
        8.89968,
        6.4886,
        0,
        12.2449,
        0.60478,
        null,
        0.1279971,
        0.1081893,
        0.1796574,
        0.1279971,
        null,
        "Services",
        "NZX:FLI",
        5.0695e+07,
        1.3904e+07,
        9.8e+06,
        8.2644e+07,
        4.543791e+07,
        4.543791e+07,
        null
      ],
      "s": "NZX:FLI"
    },
    {
      "f": [
        400520,
        0.21699,
        0.19072,
        "Briscoe Group Limited is a New Zealand-based non-trading holding company. The Company provides management services to its subsidiaries. The Company's segments include homeware and sporting goods. The Company's principal trading subsidiaries are Briscoes (New Zealand) Limited, a specialist homeware retailer selling branded products, and The Sports Authority Limited, trading as Rebel Sport, a retailer of brands of sporting goods. Rebel Sport has approximately 30 stores in selected cities and an online store. Its subsidiary, Living and Giving Limited, operates over four stores in Auckland, Lower Hutt and Christchurch and an online store. Briscoes Homeware has over 40 stores in New Zealand and an online store. The Company offers its products under the brands, such as Briscoes Homeware, Living \u0026 Giving and Rebel Sport.",
        0.23744,
        1.42126,
        "New Zealand",
        "NZD",
        1.64138,
        0,
        -3.1475e+07,
        0.17177,
        0.24766,
        0.24193,
        8.0637e+07,
        10.562537048749334,
        8.517313e+08,
        0.14333,
        -4.754e+06,
        "NZD",
        null,
        0.4091314,
        0.4091314,
        2.23871e+08,
        "Other Specialty Retailers - NEC",
        0.21196,
        5.52892e+08,
        8.692853e+08,
        -1.7554e+07,
        4.7137e+07,
        null,
        3487,
        0.1310568,
        0.1301127,
        4.04,
        2.82,
        4.80986,
        16.36837,
        14.52343,
        -1,
        38.94737,
        1.50582,
        0.34869,
        0.3125154,
        0.2222488,
        0.3141556,
        0.3125154,
        null,
        "Services",
        "NZX:BGR",
        2.41101e+08,
        9.9586e+07,
        0,
        5.52892e+08,
        2.182365e+08,
        2.182365e+08,
        "http://briscoegroup.co.nz/"
      ],
      "s": "NZX:BGR"
    },
    {
      "f": [
        1.142415e+07,
        0.11442,
        0.9759,
        "Heartland Bank Limited is a banking group with operations in New Zealand and Australia. The Company operates predominantly within New Zealand and comprises three operating segments: Households, Business and Rural. The Households segment provides financial services to New Zealand families, including term, transactional and savings based deposit accounts together with mortgage lending (residential and home equity release), motor vehicle finance and consumer finance, and some specific financial services to Australian seniors (home equity release mortgage lending). The Business segment provides term debt, plant and equipment finance, commercial mortgage lending and working capital solutions for small-to-medium sized New Zealand businesses. The Rural segment provides specialist financial services to the farming sector primarily offering livestock finance, rural mortgage lending, seasonal and working capital financing, as well as leasing solutions to farmers.",
        0.11897,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        143.8997,
        -3.039e+07,
        0.085,
        0.11441,
        0.11441,
        1.09201e+08,
        12.698572357395994,
        1.3866968e+09,
        0.08933,
        -6.7927e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Consumer Lending - NEC",
        0.11442,
        2.6547500000000003e+08,
        7.537398e+08,
        6.32957e+08,
        5.4164e+07,
        null,
        10743,
        0.45294310000000004,
        0.45294310000000004,
        1.6,
        1.09,
        1.44373,
        13.19815,
        13.38388,
        -1.30719,
        13.53383,
        4.60184,
        null,
        null,
        0.0156851,
        0.11071210000000001,
        null,
        null,
        "Financial",
        "NZX:HBL",
        3.547181e+09,
        null,
        7.17111e+08,
        null,
        4.76469e+08,
        4.76469e+08,
        "http://www.heartland.co.nz/"
      ],
      "s": "NZX:HBL"
    },
    {
      "f": [
        3.69482e+06,
        -0.00101,
        -1.14885,
        "Aorere Resources Limited is a New Zealand-based company, which invests and trades in a range of locally and overseas listed equities and derives income from interest and dividends. The Company operates in the investment segment. The investment segment operates in three principal geographical areas, including New Zealand, Canada and other. The Company is focused on investing in selected New Zealand early-stage oil, gas and minerals projects, building shareholder value as projects advance. The Company's geographical segments are New Zealand, Canada, Australia and Other. The Australian segment relates to an investment in an Australian Company (Mosman Oil \u0026 Gas) that is listed in the United Kingdom. The Company is capitalizing on the networks developed from establishing and managing Chatham Rock Phosphate, to develop a revised investment portfolio.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        1.74214,
        0,
        null,
        null,
        -0.00156,
        -0.00156,
        -763000,
        -2.7254259501965925,
        2.0795e+06,
        null,
        -652000,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        -0.00101,
        12000,
        2.2835e+06,
        -204000,
        -911000,
        0,
        null,
        null,
        null,
        0.0029,
        0.00073,
        2.19465,
        null,
        null,
        100,
        37.93103,
        null,
        null,
        -1.089134,
        -0.9646617000000001,
        -1.089134,
        -1.089134,
        null,
        "Financial",
        "NZX:AOR",
        982000,
        277000,
        0,
        12000,
        9.0309793e+08,
        9.0309793e+08,
        null
      ],
      "s": "NZX:AOR"
    },
    {
      "f": [
        110840,
        0.59178,
        0.81312,
        "The Colonial Motor Company Limited (CMC) is a New Zealand-based company, which is engaged in operating franchised motor vehicle dealerships. The Company owns motor vehicle dealerships across New Zealand. The Company has around 13 dealerships whose primary focus is Ford, seven of these dealerships also holds the Mazda franchise. The Company also has dealerships selling heavy trucks and tractors. CMC, through its dealership Southpac Trucks, acts as the distributor and retailer of Kenworth and DAF heavy-duty trucks in New Zealand. In addition, the Company has four BMW dealerships trading as Jeff Gray BMW, and Agricentre South, which retails New Holland, Case IH and Kubota tractors and equipment in Southland/Otago. The Company's dealerships include South Auckland Motors Ltd, Southern Autos-Manukau Ltd, Energy City Motors Ltd, Ruahine Motors Ltd, The Hawkes Bay Motor Company Ltd, Fagan Motors Ltd, Stevens Motors Ltd and Capital City Motors Ltd, among others.",
        0.74921,
        1.42126,
        "New Zealand",
        "NZD",
        1.54732,
        36.58949,
        null,
        0.4,
        0.59178,
        0.59178,
        3.7181e+07,
        7.309316586428552,
        2.717677e+08,
        null,
        3.8242e+07,
        "NZD",
        null,
        0.1610079,
        0.1610079,
        1.39632e+08,
        "Auto Vehicles, Parts \u0026 Service Retailers - NEC",
        0.59178,
        8.67237e+08,
        2.272277e+08,
        4.454e+07,
        2.1338e+07,
        123,
        null,
        0.0331386,
        0.0331386,
        7.6,
        5.35,
        1.38703,
        11.74423,
        9.27649,
        -2.11268,
        26.36364,
        0.26201,
        0.43035,
        0.1201675,
        0.06476370000000001,
        0.1233496,
        0.1201675,
        null,
        "Services",
        "NZX:CMO",
        3.00918e+08,
        1.92211e+08,
        5.9942e+07,
        8.67237e+08,
        3.2694629999999996e+07,
        3.2694629999999996e+07,
        "http://www.colmotor.co.nz/"
      ],
      "s": "NZX:CMO"
    },
    {
      "f": [
        469870,
        0.1546,
        0.32833,
        "Augusta Capital Limited is engaged in commercial and industrial property investment and funds management specialized in property and cleaning services. The Company operates in three segments: investment property, funds management and cleaning services. It holds approximately 140 properties located in New Zealand and Australia, which includes over four directly held properties (all in Auckland) and the remaining approximately 140 properties managed by the Company. Its properties include Finance Centre Car Park, Finance Centre Podium, 19 Victoria St West and Retail Title. Its subsidiaries include Augusta Fund Management Limited and Metroclean Limited. Augusta Funds Management Limited and Metroclean Limited focus on funds management specializing in property and providing cleaning services respectively.",
        0.15898,
        1.42126,
        "New Zealand",
        "NZD",
        7.9025,
        51.7551,
        -4.37e+06,
        0.05,
        0.1315,
        0.1315,
        1.2569e+07,
        9.987319595831012,
        1.2553062e+08,
        0.055,
        -2.7399e+07,
        "NZD",
        8.994e+06,
        0.8098365,
        0.8098365,
        1.7104e+07,
        "Real Estate Development \u0026 Operations - NEC",
        0.1546,
        2.1933e+07,
        8.665362e+07,
        3.8877e+07,
        1.3517e+07,
        null,
        null,
        0.4394601,
        0.5485502,
        1.155,
        0.95,
        1.01697,
        7.52852,
        7.26899,
        -2.94118,
        0,
        3.53385,
        null,
        0.0898224,
        0.0843433,
        0.1410106,
        0.0898224,
        null,
        "Services",
        "NZX:AUG",
        1.44337e+08,
        1.11046e+08,
        4.41e+07,
        2.1933e+07,
        8.753e+07,
        8.753e+07,
        "http://www.augusta.co.nz/"
      ],
      "s": "NZX:AUG"
    },
    {
      "f": [
        1.1761287e+08,
        0.26963401862285047,
        1.11976,
        "Insurance Australia Group Limited is engaged in the underwriting of general insurance and related corporate services and investing activities. The Company's segments include Consumer division (Australia), which provides general insurance products to individuals and families throughout Australia; Business division (Australia), which provides commercial insurance to businesses of all sizes throughout Australia under CGU, WFI and Swann Insurance brands; New Zealand, which provides general insurance business underwritten in New Zealand; Asia, which provides direct and intermediated insurance business underwritten through subsidiaries in Thailand, Vietnam and Indonesia, and Corporate and other, which comprises other activities, including corporate services, capital management activity and others. The consumer insurance products are sold under the brands, including NRMA Insurance, SGIO, SGIC and CGU. The Consumer division also includes travel insurance, life insurance and funeral products.",
        0.37505,
        1.35962,
        "Australia",
        "AUD",
        null,
        29.89487,
        -9.48e+08,
        0.27178741118842026,
        0.25805,
        0.25192,
        1.346e+09,
        11.516842496285289,
        1.6204456763066149e+10,
        0.29090661022932873,
        -3.0252029537664933e+09,
        "NZD",
        null,
        null,
        null,
        null,
        "Property \u0026 Casualty Insurance - NEC",
        0.25341,
        1.6455e+10,
        1.4428430564569511e+10,
        1.699e+09,
        6.25e+08,
        13650,
        733486,
        0.0559101,
        0.0559101,
        6.17,
        4.83938,
        2.15949,
        23.14227,
        13.41367,
        -1.18644,
        10.18876,
        0.83881,
        null,
        null,
        0.0228545,
        0.09342299999999999,
        null,
        null,
        "Financial",
        "NZX:IAGFA",
        3.003e+10,
        null,
        1.962e+09,
        1.6455e+10,
        2.431e+09,
        2.431e+09,
        "http://www.iag.com.au/"
      ],
      "s": "NZX:IAGFA"
    },
    {
      "f": [
        602720,
        0.1257,
        0.54123,
        "Green Cross Health Limited is a provider of primary healthcare services. The Company supports a range of ancillary services, such as radiology, physiotherapy, midwives and social workers. The Company operates in three segments: Pharmacy services, Medical services and Community Health. The Company's operations are in the pharmacy industry providing pharmacy services through consolidated stores, equity accounted investments and franchise stores. The Medical services segment includes equity accounted medical centers, and support services provided to the medical centers, as well as medical centers outside the Company. The Community Health segment provides services direct to the community to support independent living. The Company's medical network provides general practice services across New Zealand with over 900 doctors, nurses and healthcare practitioners. The Company operates under various brands, such as Unichem, Life Pharmacy, Access and The Doctors.",
        0.19592,
        1.42126,
        "New Zealand",
        "NZD",
        0.99975,
        65.85679,
        -2.3217e+07,
        0.07618,
        0.14049,
        0.14004,
        3.8817e+07,
        10.467403457248112,
        4.063132e+08,
        null,
        -1.4143e+07,
        "NZD",
        null,
        0.6263586,
        0.6263586,
        2.77019e+08,
        "Retail - Drugs without Grocery",
        0.12535,
        4.477e+08,
        3.537512e+08,
        5.2562e+07,
        1.7036e+07,
        700,
        1512,
        0.0700404,
        0.06481150000000001,
        2.95,
        2.3,
        3.54232,
        18.28049,
        11.80469,
        -6.90909,
        2.4,
        0.74889,
        0.59046,
        0.1661551,
        0.10736359999999999,
        0.21190079999999997,
        0.1661551,
        null,
        "Services",
        "NZX:GXH",
        2.37139e+08,
        9.1273e+07,
        6.570399999999999e+07,
        4.477e+08,
        1.38051e+08,
        1.38051e+08,
        "http://www.greencrosshealth.co.nz/"
      ],
      "s": "NZX:GXH"
    },
    {
      "f": [
        2.47759e+06,
        0.13216,
        null,
        "Gentrack Group Limited is engaged in the development, integration and support of enterprise billing and customer management software solutions for the utility (energy and water) and airport industries. The Company's operating segments include utility billing software and airport management software. Its utility services include Business Consulting, Project Services and Industry Consulting. Its airport services include 20/20 Consultancy, 20/20 Support, and 20/20 Training and Testing. The Company's Energy Solutions include Retail Billing and customer relationship management (CRM), Distribution Billing, Prepay Utility Billing, Solar photovoltaic (PV) and Demand Response Billing. Its airport solutions include Aeronautical Billing, Flight Information Display, Resource Management, Airport Operational Database and Operational Reporting. Its water utility solutions include Billing and CRM, Trade Waste Management, Software as a Service (SaaS) and Cloud Solutions, and Meter Data Management.",
        0.16486,
        1.42126,
        "New Zealand",
        "NZD",
        1.9303,
        0,
        -8.288e+06,
        0.119,
        0.13216,
        0.13216,
        1.6727e+07,
        14.086823698212472,
        2.356303e+08,
        0.14,
        6.561e+06,
        "NZD",
        4.0277e+07,
        null,
        null,
        null,
        "Enterprise Software",
        0.13216,
        5.2734e+07,
        2.544483e+08,
        -1.8818e+07,
        9.608e+06,
        null,
        2095,
        0.2721205,
        0.249213,
        3.66,
        2.15,
        3.58562,
        26.48305,
        21.23056,
        -3.84615,
        38.88889,
        4.82513,
        null,
        0.1316525,
        0.1122227,
        0.1368008,
        0.1316525,
        null,
        "Technology",
        "NZX:GTK",
        8.819e+07,
        2.8609e+07,
        0,
        5.2734e+07,
        7.2699e+07,
        7.2699e+07,
        "http://www.gentrack.com/"
      ],
      "s": "NZX:GTK"
    },
    {
      "f": [
        2.000572e+07,
        0.1163,
        0.9419,
        "Mercury NZ Limited, formerly Mighty River Power Limited, is engaged in energy retail business. The Company is an electricity retailor and generator, which is engaged in providing energy services to homes, businesses and industrial customers throughout New Zealand. The Company's segments include Energy Markets and Other Segments. The Energy Markets segment encompasses activities associated with the production, sale and trading of energy and related services and products, and generation development activities. The Other Segments includes metering and international geothermal development and operations. The Company sells electricity, through multiple retail brands, including GLOBUG, Tiny Mighty and Bosco. Its generation consists of two fuel sources: hydro and geothermal. It operates approximately nine hydro plants along the Waikato River. The Company supplies metering infrastructure and services to the utility sector across New Zealand.",
        0.24859,
        1.42126,
        "New Zealand",
        "NZD",
        1.00968,
        35.50528,
        -2.28e+08,
        0.143,
        0.1163,
        0.1163,
        4.93e+08,
        10.73147261663286,
        5.290616e+09,
        0.15471,
        -3.8e+07,
        "NZD",
        null,
        0.42063490000000003,
        0.42063490000000003,
        null,
        "Renewable Utilities",
        0.1163,
        1.564e+09,
        4.159616e+09,
        1.131e+09,
        1.6e+08,
        821,
        91864,
        0.2014066,
        0.13938620000000002,
        3.29786,
        2.49314,
        1.27543,
        25.96733,
        12.16262,
        1.85497,
        13.07184,
        2.6596,
        0.86452,
        0.0275032,
        0.0263526,
        0.0481058,
        0.0275032,
        null,
        "Utilities",
        "NZX:MCY",
        6.085e+09,
        3.13e+08,
        1.177e+09,
        1.564e+09,
        1.40001252e+09,
        1.40001252e+09,
        "http://www.mightyriver.co.nz"
      ],
      "s": "NZX:MCY"
    },
    {
      "f": [
        1.29665e+06,
        0.2293,
        0.56562,
        "Hallenstein Glasson Holdings Limited is a New Zealand-based holding company. It is a retailer of men's and women's clothing in New Zealand and Australia. Its segments include Hallenstein Bros Limited (New Zealand); Glassons Limited (New Zealand); Glassons Australia Limited (Australia); Storm (Retail 161 Limited and Retail 161 Australia Limited), and Hallenstein Properties Limited (New Zealand). It operates over 120 stores, with approximately 30 stores in Australia. Its subsidiaries include Hallenstein Bros Limited, which is engaged in retailing of menswear in New Zealand; Glassons Limited, which is engaged in retailing of womenswear in New Zealand; Glassons Australia Limited, which is engaged in retailing of womenswear in Australia; Retail 161 Limited, which is engaged in retailing of womenswear in Australia; Retail 161 Australia Limited, which is engaged in retailing of womenswear in Australia, and Hallenstein Properties Limited, which is engaged in property ownership in New Zealand.",
        0.35522,
        1.42126,
        "New Zealand",
        "NZD",
        1.74133,
        0,
        -1.7895e+07,
        0.3,
        0.2293,
        0.2293,
        2.6624e+07,
        6.322682542067308,
        1.683351e+08,
        0.27667,
        -9.712e+06,
        "NZD",
        null,
        0.5663729,
        0.5663729,
        1.2659e+08,
        "Apparel \u0026 Accessories Retailers - NEC",
        0.2293,
        2.2351e+08,
        1.825261e+08,
        -1.4191e+07,
        1.3679e+07,
        null,
        null,
        0.0838575,
        0.08528029999999999,
        3.46,
        2.59,
        3.23691,
        13.34496,
        8.61338,
        3.72881,
        -9.46746,
        0.81664,
        0.8622,
        0.2293364,
        0.1658825,
        0.2293364,
        0.2293364,
        null,
        "Services",
        "NZX:HLG",
        7.8628e+07,
        3.9617e+07,
        0,
        2.2351e+08,
        5.910743e+07,
        5.910743e+07,
        "http://www.hallensteinglasson.co.nz"
      ],
      "s": "NZX:HLG"
    },
    {
      "f": [
        117680,
        0.13696,
        -0.12917,
        "Millennium \u0026 Copthorne Hotels New Zealand Limited is a New Zealand-based hotel operator. The Company is engaged in the ownership and operation of hotels in New Zealand; residential development and sale of land in New Zealand, and development and sale of residential units in Australia. The Company operates through three segments: Hotel operations, which include income from the ownership and management of hotels; Residential land development, which consists of development and sale of land, and Residential and commercial property development, which consists of development and sale of residential apartments and commercial properties. The Company, through its subsidiaries, is engaged in the investment holding, property investment and development, and residential apartment development, among others. It is a subsidiary of CDL Hotels Holdings New Zealand Limited, which is a subsidiary of Millennium \u0026 Copthorne Hotels plc in the United Kingdom. It operates in New Zealand and Australia.",
        0.22143,
        1.42126,
        "New Zealand",
        "NZD",
        4.5482,
        18.08837,
        -3.797e+06,
        0.028,
        0.21142,
        0.21142,
        6.2089e+07,
        4.548137351221634,
        2.823893e+08,
        null,
        -8.994e+06,
        "NZD",
        null,
        0.5813865,
        0.5813865,
        7.8076e+07,
        "Hotels \u0026 Motels",
        0.13696,
        1.36541e+08,
        2.468203e+08,
        2.351e+06,
        2.167e+07,
        null,
        1434,
        0.3825486,
        0.3843398,
        2.4,
        1.44,
        0.98789,
        11.06802,
        5.07433,
        0,
        59.18367,
        1.56222,
        3.44996,
        0.0836609,
        0.0718978,
        0.0926249,
        0.0836609,
        null,
        "Services",
        "NZX:MCKPA",
        6.10251e+08,
        1.41017e+08,
        7.3798e+07,
        1.36541e+08,
        1.5821829e+08,
        1.5821829e+08,
        "http://www.millenniumhotels.com/"
      ],
      "s": "NZX:MCKPA"
    },
    {
      "f": [
        17670,
        -0.03643,
        null,
        "Lateral Corporation Limited is a developer and distributer of digital products and services that enable commercialization of the mobile and fixed Web using various payment methods. The Company's segments include New Zealand, Australia and the United Kingdom. Its platform, Viaduct, which is an e-commerce platform is engaged in marketing and distributing digital products and bills customers. It provides carrier billing, mobile application development, mobile social networks and custom solutions, among others. It offers various solutions, including carrier billing, digital distribution, social engagement and social platform. Its carrier billing is a payment method, which uses from customers mobile phone account. It works with various digital service partners, such as service administration; subscriber management; flexible billing; advertising, tracking and management; brand management; content management, and communications and messaging to distribute and deliver users products.",
        -0.03639,
        1.42126,
        "New Zealand",
        "NZD",
        1.89323,
        null,
        null,
        null,
        -0.0222,
        -0.0222,
        -912220,
        -3.3624016136458312,
        3.06725e+06,
        null,
        -438420,
        "NZD",
        null,
        0.1320599,
        0.1320599,
        182510,
        "IT Services \u0026 Consulting - NEC",
        -0.03643,
        408980,
        2.57447e+06,
        492780,
        -899450,
        null,
        null,
        -1.743072,
        -1.743072,
        0.165,
        0.05,
        null,
        null,
        null,
        0,
        -69.69697,
        8.49325,
        null,
        null,
        -2.2241589999999998,
        null,
        null,
        null,
        "Technology",
        "NZX:LAT",
        255430,
        247350,
        611050,
        408980,
        2.46963e+07,
        2.46963e+07,
        "http://www.lateralcorp.com/"
      ],
      "s": "NZX:LAT"
    },
    {
      "f": [
        104000,
        0.0334,
        -0.70439,
        "Geneva Finance Limited, formerly GFNZ Group Limited, is a finance company, which provides finance and financial services to the consumer credit markets. The Company's principal activity is to lend to individuals during the course of carrying on its finance company business. Its segments include Corporate, which include raising of debt and advancing loans to other operating segments; New Business, which include lending of money to individuals, companies and other entities; Insurance, which includes issuing of temporary insurance contracts covering death, disablement and redundancy risks, and short term motor vehicle insurance contracts covering third-party, mechanical breakdown risk and guaranteed asset protection; Old Business, which include collection and management of money lent to individuals, companies and other entities, and Property, which include raising debt. It provides hire purchase finance, and personal loans secured by registered security interests over personal assets.",
        0.03524,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        223.2428,
        null,
        null,
        0.04933,
        0.04933,
        2.362e+06,
        26.16296782387807,
        6.179693e+07,
        null,
        -8.089e+06,
        "NZD",
        null,
        0.7125887,
        0.7125887,
        6.842e+06,
        "Investment Banking",
        0.0334,
        9.917e+06,
        3.380893e+07,
        2.7988e+07,
        2.194e+06,
        36,
        null,
        0.2012411,
        0.2012411,
        0.48,
        0.33906,
        1.88512,
        9.73039,
        9.64591,
        4.34783,
        17.97235,
        2.99725,
        null,
        0.06713090000000001,
        0.065801,
        0.2129664,
        0.06713090000000001,
        null,
        "Financial",
        "NZX:GFL",
        6.0008e+07,
        null,
        3.9226e+07,
        9.917e+06,
        6.900724e+07,
        6.900724e+07,
        "http://genevafinance.co.nz/"
      ],
      "s": "NZX:GFL"
    },
    {
      "f": [
        1.912074e+07,
        0.00356,
        0.85402,
        "Infratil Limited is a New Zealand-based company, which owns energy, transport and social infrastructure businesses that provide services to individuals and communities. The Company owns and operates infrastructure and utility businesses and investments in New Zealand and Australia. The Company is organized into six business segments: Trustpower, Wellington Airport, NZ Bus, Australian Energy, Retirement and Other. Trustpower is its renewable generation investment. Wellington International Airport is its Wellington airport investment. NZ Bus is its transportation investment. Australian Energy is its non-renewable generation investment. Retirement is its investments in Metlifecare and RetireAustralia. Other comprises investment activity not included in the specific categories. The Company's subsidiaries include Infratil Finance Limited, Snapper Services Limited, New Zealand Bus Limited and Wellington International Airport Limited.",
        0.41352,
        1.42126,
        "New Zealand",
        "NZD",
        0.88173,
        148.7234,
        -1.104e+08,
        0.1425,
        0.00173,
        0.00173,
        4.744e+08,
        7.131578836424958,
        3.383221e+09,
        0.1556,
        2.83e+07,
        "NZD",
        1.174e+08,
        0.3906607,
        0.3906607,
        7.261e+08,
        "Multiline Utilities - NEC",
        0.00356,
        1.7757e+09,
        1.458121e+09,
        1.9251e+09,
        4.383e+08,
        2200,
        null,
        0.1308915,
        0.044954799999999996,
        3.45,
        2.57,
        0.77792,
        1502.89,
        6.2473,
        -1.70132,
        -17.19745,
        0.79358,
        0.87399,
        0.0118461,
        0.0087548,
        0.0006388,
        0.0118461,
        null,
        "Utilities",
        "NZX:IFT",
        6.614e+09,
        5.584e+08,
        2.7728e+09,
        1.7757e+09,
        5.5782565e+08,
        5.5782565e+08,
        "http://www.infratil.com/"
      ],
      "s": "NZX:IFT"
    },
    {
      "f": [
        131440,
        -0.01628,
        1.78801,
        "Energy Mad Limited is a New Zealand-based company, which is engaged in importation and distribution of energy efficient light bulbs and energy efficient products. The Company's segments include New Zealand, which is engaged in the sale of energy efficient products within New Zealand; Australia, which is engaged in the sale energy efficient products within Australia, and Rest of World, which is engaged in the sale of energy efficient products to all other countries. The Company sells light emitting diode (LED) and compact fluorescent Ecobulbs to customers through State Government energy efficiency schemes in Victoria, South Australia and the Australian Capital Territory. It offers Ecobulb 9W LED Edison Screw E27, Ecobulb 9W LED B22 Bulb, Ecobulb 9W LED Downlight Dimmable, Ecobulb 4.4W LED Screw E14 and Ecobulb 5.5W LED Candle Bayonet B15. The Company has implemented approximately 80 Ecobulb projects with electricity utilities and various retail partners across the world.",
        -0.01269,
        1.42126,
        "New Zealand",
        "NZD",
        1.04534,
        null,
        null,
        null,
        -0.01428,
        -0.01428,
        -275960,
        -22.433359907232933,
        6.19071e+06,
        null,
        -2.11626e+06,
        "NZD",
        null,
        0.3119558,
        0.3119558,
        2.82392e+06,
        "Electrical Components \u0026 Equipment - NEC",
        -0.01628,
        8.40375e+06,
        2.48195e+06,
        3.70876e+06,
        -1.26285e+06,
        null,
        null,
        -0.0668014,
        -0.11603849999999999,
        0.07,
        0.03,
        null,
        null,
        null,
        -20,
        -20,
        0.26007,
        0.39754,
        -0.7515712000000001,
        -0.29550540000000003,
        null,
        -0.7515712000000001,
        null,
        "Technology",
        "NZX:MAD",
        4.35301e+06,
        3.40088e+06,
        3.59752e+06,
        8.40375e+06,
        7.756086e+07,
        7.756086e+07,
        "http://www.energymad.com/"
      ],
      "s": "NZX:MAD"
    },
    {
      "f": [
        1.1761287e+08,
        0.26963401862285047,
        1.11976,
        "Insurance Australia Group Limited is engaged in the underwriting of general insurance and related corporate services and investing activities. The Company's segments include Consumer division (Australia), which provides general insurance products to individuals and families throughout Australia; Business division (Australia), which provides commercial insurance to businesses of all sizes throughout Australia under CGU, WFI and Swann Insurance brands; New Zealand, which provides general insurance business underwritten in New Zealand; Asia, which provides direct and intermediated insurance business underwritten through subsidiaries in Thailand, Vietnam and Indonesia, and Corporate and other, which comprises other activities, including corporate services, capital management activity and others. The consumer insurance products are sold under the brands, including NRMA Insurance, SGIO, SGIC and CGU. The Consumer division also includes travel insurance, life insurance and funeral products.",
        0.37505,
        1.35962,
        "Australia",
        "AUD",
        null,
        29.89487,
        -9.48e+08,
        0.27178741118842026,
        0.25805,
        0.25192,
        1.346e+09,
        11.516842496285289,
        1.6204456763066149e+10,
        0.29090661022932873,
        -3.0252029537664933e+09,
        "NZD",
        null,
        null,
        null,
        null,
        "Property \u0026 Casualty Insurance - NEC",
        0.25341,
        1.6455e+10,
        1.4428430564569511e+10,
        1.699e+09,
        6.25e+08,
        13650,
        733486,
        0.0559101,
        0.0559101,
        6.17,
        4.83938,
        2.15949,
        23.14227,
        13.41367,
        -1.18644,
        10.18876,
        0.83881,
        null,
        null,
        0.0228545,
        0.09342299999999999,
        null,
        null,
        "Financial",
        "NZX:IAGFB",
        3.003e+10,
        null,
        1.962e+09,
        1.6455e+10,
        2.431e+09,
        2.431e+09,
        "http://www.iag.com.au/"
      ],
      "s": "NZX:IAGFB"
    },
    {
      "f": [
        3.54317e+06,
        0.322,
        0.63078,
        "Freightways Limited is engaged in the operation of express package and business mail services, and information management services. The Company's segments include Express package \u0026 business mail, Information management, and Corporate and other. The Express package \u0026 business mail segment includes network courier, point-to-point courier and postal services. The Information management segment includes secure paper-based and electronic business information management services. The Corporate and other segment includes corporate, financing and property management services. The Company delivers approximately 200,000 items each business day and approximately 50 million items each year. It offers a range of archive management services for documents, computer media and document destruction throughout New Zealand and Australia. It also provides both digital conversion and online back-up services to complement the physical storage and protection of documents and other media.",
        0.40127,
        1.42126,
        "New Zealand",
        "NZD",
        1.03776,
        73.9621,
        -3.9078e+07,
        0.2725,
        0.3219,
        0.32101,
        9.8476e+07,
        12.382418051098744,
        1.219371e+09,
        0.26943,
        5.673e+06,
        "NZD",
        null,
        0.6140177,
        0.6140177,
        3.103e+08,
        "Air Freight \u0026 Logistics - NEC",
        0.321,
        5.0536e+08,
        1.0675239999999999e+09,
        1.51847e+08,
        4.9774e+07,
        920,
        7591,
        0.1576619,
        0.1357864,
        7.05,
        5.9,
        4.96286,
        21.46351,
        17.15725,
        -0.5772,
        10.24,
        2.1124,
        0.97149,
        0.1227073,
        0.10241149999999999,
        0.2352029,
        0.1227073,
        null,
        "Transportation",
        "NZX:FRE",
        4.78832e+08,
        8.2178e+07,
        1.58912e+08,
        5.0536e+08,
        1.5476069e+08,
        1.5476069e+08,
        "http://www.freightways.co.nz/"
      ],
      "s": "NZX:FRE"
    },
    {
      "f": [
        228150,
        -0.08032,
        null,
        "GeoOp Limited is engaged in the development and commercial deployment of cloud-based mobile workforce productivity technologies. The Company offers GeoOp, a mobile workforce software. It provides Xero, which is an online accounting software for small businesses; Unleashed, an application that manages suppliers, shipments, locations, warehouses, production, and sales through various channels, and FreshBooks, an online accounting software designed for small business. In addition, it offers iAuditor, an application for workplace safety audits, pre-start checks and inspections; ArmadaGPS, an application for global positioning system (GPS) vehicle tracking, and Teletrac Navman, a GPS fleet management and tracking solution that enables users to monitor and manage various vehicles on their personal computer or mobile device. It offers GeoOp application programming interface (API), which allows developers to integrate GeoOp functionality into their mobile, network or desktop applications.",
        -0.07887,
        1.42126,
        "New Zealand",
        "NZD",
        0.41517,
        41.85268,
        null,
        null,
        -0.08153,
        -0.08153,
        -3.727e+06,
        -3.8785859940971292,
        1.445549e+07,
        null,
        -2.755e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Enterprise Software",
        -0.08032,
        2.339e+06,
        1.252349e+07,
        1.932e+06,
        -2.721e+06,
        null,
        null,
        -1.593416,
        -1.593416,
        0.5,
        0.16,
        1.24035,
        null,
        null,
        0,
        -54.43038,
        5.35421,
        null,
        -0.500644,
        -0.347443,
        -0.5527679,
        -0.500644,
        null,
        "Technology",
        "NZX:GEO",
        1.2413e+07,
        1.752e+06,
        3e+06,
        2.339e+06,
        4.93933e+07,
        4.93933e+07,
        "http://www.geoop.com/"
      ],
      "s": "NZX:GEO"
    },
    {
      "f": [
        3.162491e+07,
        0.20149,
        0.62682,
        "Kiwi Property Group Limited, formerly Kiwi Income Property Trust, is engaged in investing in New Zealand real estate. The Company's primary assets are investment properties in retail and office sectors. Its segments are Retail, Office and Other. Its investment objective is to provide investors with an investment in New Zealand property, focusing on risk-adjusted returns over time through the ownership and management of a diversified portfolio. It is focused on property investment portfolio comprising retail portfolio, which includes regional shopping centers and large format retail within and outside Auckland region, and office portfolio that includes office properties with floorplate, services, location and car parking in Auckland, and core government office accommodation supported by long-term leases to government in Wellington. Its portfolio includes properties, such as Sylvia Park, LynnMall, Westgate Lifestyle, The Base, North City, Vero Centre and The Aurora Centre, among others.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.34554,
        57.90863,
        -6.414100000000001e+07,
        0.066,
        0.20433,
        0.20433,
        1.50103e+08,
        16.86557230701585,
        2.531573e+09,
        0.06873,
        -1.79712e+08,
        "NZD",
        null,
        0.7562118,
        0.7562118,
        1.56599e+08,
        "Commercial REITs - NEC",
        0.20149,
        2.08234e+08,
        1.723532e+09,
        8.08041e+08,
        2.50781e+08,
        null,
        12215,
        0.5995116,
        1.271648,
        1.6,
        1.32,
        0.99391,
        6.55802,
        null,
        -2.54545,
        -0.74074,
        7.79491,
        null,
        0.0997199,
        0.0978894,
        0.15958529999999999,
        0.0997199,
        null,
        "Services",
        "NZX:KPG",
        2.905172e+09,
        1.7415e+07,
        1.004189e+09,
        2.08234e+08,
        1.28621802e+09,
        1.28621802e+09,
        "http://www.kp.co.nz/"
      ],
      "s": "NZX:KPG"
    },
    {
      "f": [
        1.26451e+06,
        0.16709,
        0.27694,
        "Kingfish Limited (Kingfish) is an investment company that invests in growing New Zealand companies. The investment objectives of Kingfish are to achieve a high real rate of return, comprising both income and capital growth, within risk parameters acceptable to the directors, and provide access to a diversified portfolio of New Zealand growth stocks through a single tax efficient investment vehicle. The Company invests as a medium to long-term investor selling only on the basis of a fundamental change in the original investment case, and constructs a diversified portfolio of investments based on its STEEPP investment criteria. Fisher Funds Management Limited is the investment manager of the Company.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        188.0858,
        null,
        -8.995e+06,
        0.1058,
        0.32776,
        0.29192,
        4.8901e+07,
        0.07304963088689392,
        3.5722e+06,
        null,
        -2.5387e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        0.14671,
        2.7433e+07,
        2.108302e+08,
        -2.07258e+08,
        2.2544e+07,
        null,
        4762,
        0.874763,
        0.874763,
        1.44,
        1.21,
        0.96823,
        4.65881,
        null,
        -0.72993,
        9.67742,
        3.77142,
        null,
        0.2534614,
        0.2521102,
        0.2534614,
        0.2534614,
        null,
        "Financial",
        "NZX:KFL",
        2.28051e+08,
        2.2796e+08,
        null,
        2.7433e+07,
        1.61494e+08,
        1.61494e+08,
        "http://www.kingfish.co.nz/"
      ],
      "s": "NZX:KFL"
    },
    {
      "f": [
        1.231592e+07,
        0,
        0.35485,
        "Fonterra Shareholders' Fund is a New Zealand-based unit trust established to be the authorized fund. The principal activity of the Fund is to acquire economic rights and issue units to investors. It allows investors in the Fund an opportunity to earn returns based on the financial performance of Fonterra Co-operative Group Limited (Fonterra), New Zealand-based Co-operative. Under the Trust Deed, the Fund may invest only in authorized investments, which are economic rights of Fonterra shares (Economic Rights), and issue units to investors. It may not invest directly in Fonterra shares (shares). FSF Management Company Limited is the manager of the Fund, whose objective is to manage the Fund and its property as a passive investment vehicle under the Trust Deed.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        0,
        -3.8e+07,
        0.3,
        0,
        0,
        1.01e+08,
        null,
        null,
        0.3985,
        -3.4e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Food Processing - NEC",
        0,
        1.47e+08,
        7.214443e+08,
        0,
        0,
        null,
        null,
        0,
        0,
        6.12,
        5.31,
        1.04608,
        null,
        null,
        0,
        2.23368,
        4.90778,
        null,
        0,
        0,
        0,
        0,
        null,
        "Financial",
        "NZX:FSF",
        6.37e+08,
        null,
        0,
        1.47e+08,
        1.1199194e+08,
        1.1199194e+08,
        "http://www.fonterra.com/nz/en/Financial/Fonterra+Shareholders+Fund"
      ],
      "s": "NZX:FSF"
    },
    {
      "f": [
        8.97032e+06,
        null,
        null,
        "Investore Property Limited is a property company. The Company is engaged in commercial property ownership business. The Company invests in large format retail property assets in New Zealand. The Company's portfolio is spread across geographical areas, including Other South Island, Waikato, Other North Island, Wellington, Otago, Canterbury and Auckland. Its property portfolio includes features, such as leases structured as net leases; property or land able to be converted into large format retail real estate through asset management activities, such as change of use, leasing, development and redevelopment initiatives; anchor tenants that occupy over 50% of the net lettable area of the property, and uses that include grocery, bulky goods retailing, factory outlets, general merchandise and convenience retailing.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        2.25514,
        67.66729,
        null,
        null,
        null,
        null,
        null,
        null,
        5.13107e+08,
        0.054,
        null,
        "NZD",
        null,
        null,
        null,
        null,
        "Retail  Real Estate Development",
        null,
        0,
        3.53392e+08,
        1.59715e+08,
        null,
        null,
        null,
        null,
        null,
        1.67,
        1.35,
        0.91919,
        null,
        null,
        -4.25532,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "NZX:IPL",
        6.47876e+08,
        4.278e+06,
        2.6015300000000003e+08,
        0,
        2.61772e+08,
        2.61772e+08,
        "http://www.investoreproperty.co.nz/"
      ],
      "s": "NZX:IPL"
    },
    {
      "f": [
        6390,
        0.12364,
        0.04457,
        "Foley Family Wines Limited is an integrated wine company. The Company is engaged in producing table wines. The Company is also engaged in the marketing and sale of wines in New Zealand and various export markets. The Company offers various wine brands, including Vavasour, Grove Mill, Te Kairanga, Clifford Bay, Goldwater and Dashwood Sauvignon Blanc. The Company's vineyards are located in Marlborough and Martinborough, New Zealand. The Company sells its products in New Zealand, Australia, the United States, Canada, the United Kingdom, Europe and rest of the world. The Company's subsidiaries include Martinborough Vineyard (UK) Ltd, which is a sales company; McLeod Vineyard Ltd, which is engaged in grape growing; Martinborough Vineyard Estates Ltd (MVEL), which is a wine company, and Martinborough Vineyard Ltd, which is engaged in grape growing.",
        0.15243,
        1.42126,
        "New Zealand",
        "NZD",
        2.87092,
        25.31261,
        -1.044e+06,
        0.03,
        0.12364,
        0.10746,
        7.975e+06,
        11.306259561128527,
        9.016742e+07,
        null,
        -933000,
        "NZD",
        null,
        0.3308845,
        0.3308845,
        1.153e+07,
        "Wineries",
        0.10746,
        3.4846e+07,
        7.050042e+07,
        1.9667e+07,
        6.457e+06,
        null,
        null,
        0.2952132,
        0.2591689,
        1.7,
        1.3,
        0.81101,
        12.56281,
        7.69739,
        -10,
        -3.57143,
        2.0232,
        0.70337,
        0.0627061,
        0.0543839,
        0.0770704,
        0.0627061,
        null,
        "Consumer/Non-Cyclical",
        "NZX:FFW",
        1.2128e+08,
        4.3572e+07,
        2.2004e+07,
        3.4846e+07,
        5.222253e+07,
        5.222253e+07,
        "http://www.nzwineco.co.nz/"
      ],
      "s": "NZX:FFW"
    },
    {
      "f": [
        63330,
        0.017,
        -0.83975,
        "Just Water International Limited is principally in the business of supplying water-coolers, drinking water and filters for the home and office. The Company's principal activity is the rental and service of water coolers to customers, as well as the sale of water and water products. The Company supplies point-of-use water-coolers under its brand name Direct Connect. The Company services water-coolers (which customers own) to Drinksafe International standards. The Company also has Home Delivery program through its Aqua-Cool division. The Company offers Just Water Filter, which is sold online and through appointed agents. Its Easi-Fill water-cooler and filter allows customers to filter their own water into a 15-liter bottle, which is then placed on the cooler ready for drinking. Its VitaBlast is vitamin C enhanced water. It supplies water-coolers and filters to businesses and organizations. It operates in New Zealand.",
        0.03953,
        1.42126,
        "New Zealand",
        "NZD",
        0.83462,
        5.43572,
        null,
        null,
        0.01696,
        0.01696,
        4.437e+06,
        4.787714672075727,
        2.124309e+07,
        null,
        -717000,
        "NZD",
        null,
        0.5451972,
        0.5451972,
        8.86e+06,
        "Non-Alcoholic Beverages - NEC",
        0.017,
        1.6251000000000002e+07,
        2.056309e+07,
        680000,
        1.528e+06,
        110,
        null,
        0.1365454,
        0.1365454,
        0.23,
        0.14,
        1.61873,
        13.56132,
        5.78753,
        0,
        35.29412,
        1.26534,
        0.7141,
        0.1220691,
        0.102064,
        0.1274927,
        0.1220691,
        null,
        "Consumer/Non-Cyclical",
        "NZX:JWI",
        1.6315000000000002e+07,
        2.604e+06,
        693000,
        1.6251000000000002e+07,
        8.972717e+07,
        8.972717e+07,
        "http://jwi.co.nz/"
      ],
      "s": "NZX:JWI"
    },
    {
      "f": [
        1290,
        null,
        null,
        "Finzsoft Solutions Limited is a New Zealand-based company, which provides financial technology solutions. The Company's principal activity is computer software development, sales and support with hosting. The Company's geographical segments include New Zealand, Australia and Rest of the world. The Company's modular solutions framework (Sovereign) runs as an integrated system. It delivers solutions for the financial services industry. The Company's solutions include demand generation, ways to bank, lending and funding, transactional banking and investment, collections, publishing and media management, reporting, wholesale and sovereign. It offers sovereign to the needs of banking, insurance, and finance stakeholders. The Company works with a range of organizations around the globe spanning the financial services sector, including multinational banking corporations, insurance providers, building societies, credit unions, independent lenders and retailers.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.7823,
        15.75713,
        0,
        0,
        null,
        null,
        null,
        null,
        2.23516e+07,
        null,
        null,
        "NZD",
        null,
        null,
        null,
        8.87153e+06,
        "Professional Information Services - NEC",
        null,
        null,
        2.202208e+07,
        329520,
        225940,
        null,
        null,
        null,
        null,
        2.85,
        2,
        4.62673,
        null,
        null,
        0,
        -16.66667,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Financial",
        "NZX:FIN",
        9.55466e+06,
        3.75108e+06,
        750000,
        2.18527e+07,
        8.80883e+06,
        8.80883e+06,
        "http://www.finzsoft.com/"
      ],
      "s": "NZX:FIN"
    },
    {
      "f": [
        135430,
        -0.13387,
        -0.25502,
        "Livestock Improvement Corporation Limited (LIC) is engaged in supplying artificial breeding, herd testing, herd recording and other services. The Company operates through four segments: NZ Markets Genetics, Herd Testing, Farm Software and Farm Automation. The NZ Markets Genetics segment provides bovine genetic breeding material and related services predominately to dairy farmers. The Herd Testing segment provides herd testing and animal recording for pastoral farmers. The Farm Software segment is engaged in providing data recording and farm management information services. The Farm Automation segment is engaged in providing dairy automated technologies from LIC Automation Ltd, including Protrack. Its Other operating segments include international operations, research and development, diagnostics, animal health and treatment services, LIC Deer Ltd, animal evaluation and leadership and governance support services. It operates in New Zealand, Australia, United Kingdom and Ireland.",
        0.69684,
        1.42126,
        "New Zealand",
        "NZD",
        0.92621,
        23.49762,
        -5.983e+06,
        null,
        -0.14102,
        -0.14102,
        2.6677e+07,
        4.636028413989579,
        1.2367533e+08,
        null,
        -2.5765e+07,
        "NZD",
        null,
        0.36386290000000004,
        0.36386290000000004,
        7.4613e+07,
        "Fishing \u0026 Farming - NEC",
        -0.13387,
        2.05058e+08,
        7.677433e+07,
        4.6901e+07,
        -3.954e+06,
        183,
        7170,
        0.0101679,
        -0.0194628,
        4.06,
        2.1,
        0.44772,
        null,
        3.73108,
        0,
        -35.96059,
        0.3744,
        0.66724,
        -0.0156037,
        -0.0128446,
        -0.0184001,
        -0.0156037,
        1.120536e+06,
        "Consumer/Non-Cyclical",
        "NZX:LIC",
        3.23655e+08,
        6.0836e+07,
        4.9568e+07,
        2.05058e+08,
        3.632538e+07,
        3.632538e+07,
        "http://www.lic.co.nz/"
      ],
      "s": "NZX:LIC"
    },
    {
      "f": [
        1.912074e+07,
        0.00356,
        0.85402,
        "Infratil Limited is a New Zealand-based company, which owns energy, transport and social infrastructure businesses that provide services to individuals and communities. The Company owns and operates infrastructure and utility businesses and investments in New Zealand and Australia. The Company is organized into six business segments: Trustpower, Wellington Airport, NZ Bus, Australian Energy, Retirement and Other. Trustpower is its renewable generation investment. Wellington International Airport is its Wellington airport investment. NZ Bus is its transportation investment. Australian Energy is its non-renewable generation investment. Retirement is its investments in Metlifecare and RetireAustralia. Other comprises investment activity not included in the specific categories. The Company's subsidiaries include Infratil Finance Limited, Snapper Services Limited, New Zealand Bus Limited and Wellington International Airport Limited.",
        0.41352,
        1.42126,
        "New Zealand",
        "NZD",
        0.88173,
        148.7234,
        -1.104e+08,
        0.1425,
        0.00173,
        0.00173,
        4.744e+08,
        7.131578836424958,
        3.383221e+09,
        0.1556,
        2.83e+07,
        "NZD",
        1.174e+08,
        0.3906607,
        0.3906607,
        7.261e+08,
        "Multiline Utilities - NEC",
        0.00356,
        1.7757e+09,
        1.458121e+09,
        1.9251e+09,
        4.383e+08,
        2200,
        null,
        0.1308915,
        0.044954799999999996,
        3.45,
        2.57,
        0.77792,
        1502.89,
        6.2473,
        -1.70132,
        -17.19745,
        0.79358,
        0.87399,
        0.0118461,
        0.0087548,
        0.0006388,
        0.0118461,
        null,
        "Utilities",
        "NZX:IFTHA",
        6.614e+09,
        5.584e+08,
        2.7728e+09,
        1.7757e+09,
        5.5782565e+08,
        5.5782565e+08,
        "http://www.infratil.com/"
      ],
      "s": "NZX:IFTHA"
    },
    {
      "f": [
        4.0668499999999995e+06,
        1.07507,
        1.38859,
        "Metlifecare Limited owns and operates retirement villages in New Zealand. The Company is engaged in providing rewarding lifestyles and care to over 5,000 New Zealanders. Many of the Company's villages also provide a full continuum of care from independent villas and apartments through to serviced apartments, rest homes and hospitals. It offers retirement living across the Bay of Islands, Auckland, Hamilton, Bay of Plenty, Manawatu and the Kapiti Coast. The Company offers various levels of care and support, depending on the village and user's needs. Its aged-care assistance ranges from serviced apartments, rest home and hospital options. Its assisted living options are designed for residents, which includes regular support in the form of daily tasks and/or medical assistance. Its independent living accommodation includes villas, apartments and cottages. Its subsidiaries include Forest Lake Gardens Limited, Hibiscus Coast Village Holdings Limited and Metlifecare Bayswater Limited.",
        1.087,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        109,
        -1.0091e+07,
        0.0575,
        1.07524,
        1.07524,
        2.3719e+07,
        98.93574771280409,
        2.346657e+09,
        0.06625,
        -2.0281e+07,
        "NZD",
        null,
        0.35199739999999996,
        0.35199739999999996,
        3.4189e+07,
        "Home Healthcare Services",
        1.07507,
        1.05961e+08,
        1.118281e+09,
        1.228376e+09,
        2.28659e+08,
        null,
        null,
        0.17060050000000002,
        2.299856,
        6.46,
        4.2,
        0.9841,
        4.88263,
        4.8369,
        -1.68539,
        18.77828,
        10.5537,
        null,
        0.1939768,
        0.09500009999999999,
        0.22369219999999998,
        0.1939768,
        null,
        "Healthcare",
        "NZX:MET",
        2.586444e+09,
        null,
        1.234934e+09,
        1.05961e+08,
        2.1237218e+08,
        2.1237218e+08,
        "http://www.metlifecare.co.nz/"
      ],
      "s": "NZX:MET"
    },
    {
      "f": [
        4.1689100000000005e+06,
        0.29136994562248597,
        0.95213,
        "JPMorgan Global Growth \u0026 Income plc, formerly JPMorgan Overseas Investment Trust plc, is an investment trust company. The Company's objective is to provide a diversified portfolio of approximately 50 to 90 stocks, in which the investment manager has a high degree of conviction. The Company seeks to achieve capital growth from world stock markets and to achieve the objective by holding a diversified portfolio of investments. The Company's portfolio construction is driven by bottom-up stock selection rather than geographical or sector allocation. The Company uses borrowing to gear the portfolio within a range of 5% cash to 20 % geared under normal market conditions. The Company invests in sectors, such as consumer discretionary, financials, healthcare, information technology, industrials, energy, consumer staples, materials, telecommunication services, investment companies and utilities. JPMorgan Asset Management (UK) Limited is the Company's investment manager.",
        null,
        0.80083,
        "United Kingdom",
        "GBP",
        3.09092,
        8.39569,
        null,
        0.05646362417440533,
        0.16202,
        0.16202,
        2.079e+07,
        16.723160173160174,
        6.134675719695089e+08,
        null,
        null,
        "NZD",
        null,
        1.005555,
        1.005555,
        2.1362e+07,
        "Investment Trusts",
        0.16513,
        2.1244e+07,
        5.891370434151065e+08,
        1.3789e+07,
        2.0383e+07,
        0,
        null,
        0.9786293,
        0.9786293,
        2.70004,
        1.705,
        1.11238,
        16.66461,
        null,
        1.1236,
        31.70732,
        15.7167,
        null,
        0.0683591,
        0.0644361,
        0.0716099,
        0.0683591,
        null,
        "Financial",
        "NZX:JPG",
        3.3302e+08,
        2.3695e+07,
        2.52e+07,
        2.1244e+07,
        1.2366129e+08,
        1.2366129e+08,
        null
      ],
      "s": "NZX:JPG"
    },
    {
      "f": [
        1.426445e+07,
        -0.00259,
        -0.48901,
        "New Talisman Gold Mines Limited is engaged in mine development and mineral exploration. The Company's projects include Talisman Mine Project and Rahu. The Talisman mine includes the Maria, Crown/Welcome and Mystery veins. In the Karangahake area, the Company also holds the Rahu permit, which is the northern extension of the Talisman vein system. The Company is engaged in initiating bulk sampling at Talisman and advancing the development of the mine. The Company's subsidiary, Coromandel Gold Limited, holds a portfolio of mineral interests and gold properties in the Hauraki and Northland Districts of New Zealand. Through a subsidiary company, the Company owns Broken Hill Prospecting Limited, which holds a cobalt project at Thackaringa, approximately 20 kilometers south-west of Broken Hill in Australia and a heavy mineral sands exploration portfolio. Its subsidiary also includes Northland Minerals Limited.",
        -0.00258,
        1.42126,
        "New Zealand",
        "NZD",
        28.70465,
        0,
        null,
        null,
        -0.0021,
        -0.0021,
        -2.21429e+06,
        -5.421963699425098,
        1.20058e+07,
        null,
        -919850,
        "NZD",
        null,
        null,
        null,
        null,
        "Integrated  Mining",
        -0.00259,
        9690,
        1.246198e+07,
        -456180,
        -2.84188e+06,
        10,
        null,
        -209.6521,
        -209.6512,
        0.01437,
        0.00287,
        0.8967,
        null,
        null,
        0,
        19.26295,
        1070.616,
        null,
        -0.198979,
        -0.19634910000000003,
        -0.2045326,
        -0.198979,
        null,
        "Basic Materials",
        "NZX:NTL",
        1.41256e+07,
        6.5438e+06,
        0,
        9690,
        2.07699586e+09,
        2.07699586e+09,
        "http://www.newtalismangoldmines.co.nz/"
      ],
      "s": "NZX:NTL"
    },
    {
      "f": [
        8.67647e+06,
        0.11077,
        null,
        "Metro Performance Glass Limited is a glass processor, distributor and glazier. The Company is engaged in operating a network of processing and retail branches for the provision and assembly of customized glass products across New Zealand. The Company supplies processed flat glass products primarily to the residential and commercial building trade. It offers range of glass products, including Low E double glazing units, deck balustrades, bathroom shower screens, splashbacks, safety glass, double glazed windows, doors and others. It also offers EzyClean protective coating and glazing services. It has approximately 17 sites across New Zealand, including over four processing sites. It delivers windows and other glass products within over three days for window frame fabricators. The Company's subsidiaries include Canterbury Glass \u0026 Glazing Limited, Christchurch Glass \u0026 Glazing Limited, Hawkes Bay Glass \u0026 Glazing Limited and Metroglass Finance Limited.",
        0.15062,
        1.42126,
        "New Zealand",
        "NZD",
        1.87258,
        66.4768,
        -1.3322e+07,
        0.076,
        0.11374,
        0.11357,
        3.2424e+07,
        12.427797310634098,
        4.029589e+08,
        0.0832,
        2.851e+06,
        "NZD",
        null,
        0.5151343,
        0.5151343,
        9.7313e+07,
        "Construction Supplies \u0026 Fixtures - NEC",
        0.11058,
        1.88037e+08,
        3.571079e+08,
        4.5851e+07,
        2.0495e+07,
        null,
        null,
        0.1547995,
        0.1391878,
        2.24,
        1.5,
        2.34338,
        16.99392,
        null,
        -3.01508,
        18.40491,
        1.70491,
        1.36249,
        0.0911917,
        0.0814143,
        0.14017559999999998,
        0.0911917,
        null,
        "Capital Goods",
        "NZX:MPG",
        2.92715e+08,
        6.7456e+07,
        1.01304e+08,
        1.88037e+08,
        1.8503e+08,
        1.8503e+08,
        "http://www.metroglasstech.co.nz/"
      ],
      "s": "NZX:MPG"
    },
    {
      "f": [
        788710,
        -0.01381,
        0.33502,
        "NZ Windfarms Limited is engaged in the business of operating a wind power generation asset for the purpose of generating and selling electricity. The Company's Te Rere Hau wind farm is situated in North Range road in the Taraua Ranges approximately 10 kilometers from Palmerston North. The site operates over 97 Windflow Technology WF500 turbines capable of producing approximately 48.5 megawatts of power per annum. Its approximately 500 kilowatts (kW) turbines are over 30 meters high and have a rotor diameter of approximately 30 meters. Each one produces enough electricity to power approximately 200 households a year. The Company operates within New Zealand. Its subsidiaries include NZWL-TRH Limited and TRH Services Limited. NZWL-TRH Limited holds the Company's interest in the Te Rere Hau wind farm. TRH Services Limited is responsible for the operations and maintenance of the turbines at the Te Rere Hau wind farm.",
        -0.00473,
        1.42126,
        "New Zealand",
        "NZD",
        7.96383,
        15.45843,
        null,
        null,
        -0.00663,
        -0.00663,
        2.758e+06,
        8.321370558375634,
        2.295034e+07,
        null,
        1.0169999999999999e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Renewable Utilities",
        -0.01381,
        8.185000000000001e+06,
        2.419734e+07,
        -1.247e+06,
        -3.979e+06,
        null,
        null,
        -0.6529016,
        -0.7225412,
        0.113,
        0.067,
        0.39967,
        null,
        null,
        -1.17647,
        -6.66667,
        2.9563,
        7.17259,
        -0.055529999999999996,
        -0.0540834,
        -0.06363089999999999,
        -0.055529999999999996,
        null,
        "Utilities",
        "NZX:NWF",
        7.1004e+07,
        1.2551e+07,
        9.359e+06,
        8.185000000000001e+06,
        2.8806358e+08,
        2.8806358e+08,
        "http://www.nzwindfarms.co.nz/"
      ],
      "s": "NZX:NWF"
    },
    {
      "f": [
        4.829105e+07,
        0.07218,
        null,
        "Meridian Energy Limited is engaged in the business of generation, trading and retailing of electricity, and the sale of complementary products and services. The Company operates through three segments: Wholesale, Retail and International. The Wholesale segment includes activity associated with its New Zealand generation of electricity and its sale into the wholesale electricity market; purchase of electricity, and development of renewable electricity generation opportunities. The Retail segment includes activity associated with retailing of electricity and complementary products through its two brands: Meridian and Powershop in New Zealand. The International segment includes activity associated with its generation of electricity and sale into the wholesale electricity market; retailing of electricity through the Powershop brand in Australia, and licensing of the Powershop platform in the United Kingdom. The Company supplies electricity to power homes, businesses and farms.",
        0.16426,
        1.42126,
        "New Zealand",
        "NZD",
        0.79142,
        24.9901,
        -5.01e+08,
        0.135,
        0.07228,
        0.07228,
        6.35e+08,
        11.972850393700787,
        7.60276e+09,
        0.18771,
        -1.09e+08,
        "NZD",
        null,
        0.3654737,
        0.3654737,
        8.68e+08,
        "Renewable Utilities",
        0.07218,
        2.375e+09,
        6.45876e+09,
        1.144e+09,
        1.85e+08,
        null,
        null,
        0.1692632,
        0.1077895,
        3.04276,
        2.18755,
        1.27818,
        34.86442,
        15.34147,
        -1.94553,
        9.31474,
        2.71948,
        null,
        0.024329299999999998,
        0.0228409,
        0.0377628,
        0.024329299999999998,
        null,
        "Utilities",
        "NZX:MEL",
        8.538e+09,
        4.06e+08,
        1.262e+09,
        2.375e+09,
        2.56143072e+09,
        2.56143072e+09,
        "http://www.meridianenergy.co.nz"
      ],
      "s": "NZX:MEL"
    },
    {
      "f": [
        64839.99999999999,
        0.29204,
        0.55023,
        "Marsden Maritime Holdings Ltd. Is a port company with various business activities in the Greater Marsden Point Area, including port operator, Northport Ltd. The Company's operations principally comprise approximately 50% stakeholding in the deep water port facility at Marsden Point together with substantial land holdings in the adjacent area. The Company's principal operating segments comprises Port Related Operations, encompassing the Company's stakeholding in Northport Ltd); Property Holdings, comprising the Company's industrial subdivision and farmland at Marsden Point); Marina \u0026 Commercial, and Other Activities, comprising of overheads associated with the Company's support functions. The Company operates the Marsden Cove marina complex, which consists of approximately 220 berth marina and adjoining commercial complexes.",
        0.2952,
        1.42126,
        "New Zealand",
        "NZD",
        1.31216,
        3.33538,
        -5.05933e+06,
        0.0775,
        0.29204,
        0.29204,
        8.76716e+06,
        17.408539367366398,
        1.5262345e+08,
        null,
        3.07874e+06,
        "NZD",
        null,
        0.9401995,
        0.9401995,
        1.007587e+07,
        "Marine Cargo Handling Services",
        0.29204,
        1.193987e+07,
        1.486823e+08,
        3.94115e+06,
        1.206152e+07,
        0,
        1272,
        0.7084424,
        1.010672,
        3.7,
        2.86,
        1.18215,
        12.32708,
        12.19528,
        0,
        28.57143,
        12.45259,
        1.24504,
        0.0953823,
        0.0947587,
        0.0985998,
        0.0953823,
        null,
        "Transportation",
        "NZX:MMH",
        1.3075519e+08,
        678690,
        4.195e+06,
        1.193987e+07,
        4.130065e+07,
        4.130065e+07,
        "http://www.northlandportcorp.co.nz/"
      ],
      "s": "NZX:MMH"
    },
    {
      "f": [
        3.53265e+06,
        -0.01244,
        2.16089,
        "Mercer Group Limited is engaged in the designing and manufacturing of technology solutions and the fabrication of stainless steel products. The Company operates in segments, which include Stainless Fabrication; Mercer Technologies, and Corporate. The Stainless Fabrication segment includes the fabrication workshops in Christchurch and New Plymouth. The Stainless Fabrication segment designs and supplies food processing and packaging equipment, including Titan Slicers, Aico and Beta range. The Stainless Fabrication segment also undertakes fabrication for the dairy sector. The Mercer Technologies segment holds the S-clave technology, which the Company is commercializing. The Company offers various services, which include consultation; installation; commissioning; emergency; maintenance services; calibration; validation; auditing, and spares requirements. The Company's subsidiaries include Mercer Stainless Limited, Mercer Technologies Limited and Mercer Middle East Limited.",
        -0.01154,
        1.42126,
        "New Zealand",
        "NZD",
        0.70406,
        126.4124,
        null,
        null,
        -0.01262,
        -0.01262,
        -1.508e+06,
        -19.965762599469496,
        3.010837e+07,
        null,
        -2.685e+06,
        "NZD",
        null,
        0.587228,
        0.587228,
        1.5329e+07,
        "Metallic Rolling \u0026 Drawing Products",
        -0.01244,
        2.6104e+07,
        1.958237e+07,
        1.0526e+07,
        -6.467e+06,
        197,
        null,
        -0.1447288,
        -0.1754137,
        0.04369,
        0.01,
        0.7571,
        null,
        null,
        0,
        -60.32865,
        0.75017,
        0.30219,
        -0.35273180000000004,
        -0.1696299,
        -0.42027929999999997,
        -0.35273180000000004,
        null,
        "Basic Materials",
        "NZX:MGL",
        2.4747e+07,
        7.437e+06,
        1.0539e+07,
        2.6104e+07,
        3.7128851e+08,
        3.7128851e+08,
        "http://mercers.co.nz/"
      ],
      "s": "NZX:MGL"
    },
    {
      "f": [
        6.29188e+06,
        0.10645,
        0.33567,
        "Skellerup Holdings Limited is a global solutions provider of technical polymer products for a range of specialist industrial and agricultural applications. The Company's segments include Agri Division, Industrial Division and Corporate Division. The Agri Division manufactures and distributes dairy rubberware, which includes milking liners, tubing, filters and feeding teats, together with other related agricultural products and dairy vacuum pumps to global agricultural markets. The Industrial Division manufactures and distributes technical polymer products across various industrial markets, including construction, infrastructure, automotive, mining and general industrial, together with industrial vacuum pump systems for a range of industrial applications. It has operations in New Zealand, Australia, North America, Europe, the United Kingdom and Ireland, and Asia, among others. Its subsidiaries include Skellerup Growth Limited, Gulf US Incorporated and Ambic Equipment Limited.",
        0.14532,
        1.42126,
        "New Zealand",
        "NZD",
        2.71929,
        23.36338,
        -1.7353e+07,
        0.09,
        0.10645,
        0.10645,
        3.9932e+07,
        7.964534709005309,
        3.180398e+08,
        0.09125,
        -2.6544e+07,
        "NZD",
        4.4235e+07,
        0.3821205,
        0.3821205,
        8.0786e+07,
        "Industrial Machinery \u0026 Equipment - NEC",
        0.10645,
        2.11415e+08,
        2.911368e+08,
        2.6903e+07,
        2.0525e+07,
        78,
        5677,
        0.1388974,
        0.1369534,
        1.53,
        1.2,
        1.868,
        14.18506,
        9.44023,
        0.66667,
        4.13793,
        1.37709,
        1.53999,
        0.1109121,
        0.0933729,
        0.1301047,
        0.1109121,
        null,
        "Basic Materials",
        "NZX:SKL",
        2.28004e+08,
        8.8736e+07,
        3.6413e+07,
        2.11415e+08,
        1.9280581e+08,
        1.9280581e+08,
        "http://www.skellerupholdings.co.nz/"
      ],
      "s": "NZX:SKL"
    },
    {
      "f": [
        957250,
        -0.17547,
        null,
        "ikeGPS Group Limited is engaged in producing end-to-end measurement solutions targeted at customers in specific vertical industries, such as electric utilities in need to measure and model their distribution assets, such as power poles and wires. The Company's products include IKE 3, IKE 4 and Spike. Spike is a smart laser measurement solution that enables the user to measure an object by taking a photo with smartphone or tablet, and take real-time measurements, including height, width, area, length and target location. The Company offers Spike device, Spike mobile application and Spike Cloud. IKE 3 is a customizable and verifiable pole data collection solution that consists of a laser rangefinder, digital camera and compass along with global positioning system (GPS) and a mobile computer. IKE 4 is a field data collection product used for outside plant (OSP) design and new attachment permitting, and pole replacement, new construction, and post construction as-built audits.",
        -0.14953,
        1.42126,
        "New Zealand",
        "NZD",
        9.32605,
        0,
        null,
        null,
        -0.24579,
        -0.24579,
        -9.009e+06,
        -2.194877344877345,
        1.977365e+07,
        null,
        -1.322e+07,
        "NZD",
        null,
        0.5618103,
        0.5618103,
        4.502e+06,
        "Mobile Application Software",
        -0.17547,
        8.574e+06,
        2.506565e+07,
        -5.292e+06,
        -8.836e+06,
        21,
        null,
        -2.0311850000000002,
        -2.012634,
        0.88,
        0.35,
        1.64678,
        null,
        null,
        5.40541,
        -44.28571,
        4.00858,
        8.375,
        -0.7637847999999999,
        -0.6884094000000001,
        -0.7646632,
        -0.7637847999999999,
        null,
        "Technology",
        "NZX:IKE",
        1.6378e+07,
        1.0669e+07,
        0,
        8.574e+06,
        6.427091e+07,
        6.427091e+07,
        null
      ],
      "s": "NZX:IKE"
    },
    {
      "f": [
        305560,
        -0.0963,
        null,
        "Serko Limited is engaged in the provision of computer software solutions for corporate travel. The Company offers online booking tool (OBT) for corporate travel in Australasia. The Company also offers expense management solutions. The Company's products, Serko Online and Serko Expense are cloud-based enterprise grade solutions that help corporates manage their travel and expense programs. They can be used independently or together. Both products share a common phone application, Serko Mobile, through which users can manage their travel and/or their expenses. Serko Online is an independent Web-based technology platform that talks to the main global distribution systems (GDSs), providing Serko users the ability to search all the content stored in the GDSs, while applying their company's travel policy. Serko Expense is a cloud-based expense management solution. Through Serko Expense users can manage cash claims, mileage, allowance and corporate credit card expenses.",
        -0.08499,
        1.42126,
        "New Zealand",
        "NZD",
        2.98209,
        9.22956,
        null,
        null,
        -0.07272,
        -0.07272,
        -4.05302e+06,
        -4.0840410360669335,
        1.6552700000000002e+07,
        null,
        -5.1944e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Cloud Computing Services",
        -0.0963,
        1.312157e+07,
        2.332619e+07,
        -6.77349e+06,
        -6.23412e+06,
        138,
        null,
        -0.36135269999999997,
        -0.3387652,
        0.9,
        0.3,
        3.07774,
        null,
        null,
        6.66667,
        -60,
        1.69907,
        null,
        -0.7442536,
        -0.5117318000000001,
        -0.7954722,
        -0.7442536,
        null,
        "Technology",
        "NZX:SKO",
        1.1121e+07,
        8.66e+06,
        702000,
        1.312157e+07,
        7.315399e+07,
        7.315399e+07,
        "http://www.serko.com/"
      ],
      "s": "NZX:SKO"
    },
    {
      "f": [
        1.89357e+06,
        0.88553,
        0.3375,
        "Mainfreight Limited is engaged in the business of supply chain logistics. The Company provides a range of warehousing, domestic distribution, as well as international air and ocean freight services. The Company operates its business in over 240 branches in over 20 countries across the world. The Company operates in the domestic supply chain, which includes moving and storing freight within countries, and air and ocean freight industries, which includes moving freight between countries. The Company's geographical segments include New Zealand, Australia, The Americas, Asia and Europe. It provides a suite of services covering both import and export by sea and air, customs clearance, tariff classification, and costing and consultancy all operated in house. It also manages the specialized services, such as project logistics, bulk liquids, perishables, automotive, trans border and distribution. It provides a full door-to-door solution backed by full visibility from pick up to delivery.",
        1.27565,
        1.42126,
        "New Zealand",
        "NZD",
        1.37056,
        52.84518,
        -3.3855e+07,
        0.37,
        0.97537,
        0.9727,
        1.8938e+08,
        12.300797338684127,
        2.329525e+09,
        0.41117,
        -9.208e+06,
        "NZD",
        1.98974e+08,
        0.38347960000000003,
        0.38347960000000003,
        8.57379e+08,
        "Air Freight \u0026 Logistics - NEC",
        0.88224,
        2.284226e+09,
        2.0643200000000002e+09,
        2.6520499999999997e+08,
        8.7604e+07,
        6440,
        null,
        0.06391200000000001,
        0.060395500000000005,
        20.55,
        14.45,
        3.43894,
        21.07536,
        14.85742,
        1.13468,
        30.65647,
        0.89267,
        null,
        0.10360369999999999,
        0.0766825,
        0.1692464,
        0.10360369999999999,
        359087.3,
        "Transportation",
        "NZX:MFT",
        1.247207e+09,
        4.21901e+08,
        3.17218e+08,
        2.284226e+09,
        1.0069855e+08,
        1.0069855e+08,
        "http://www.mainfreight.com/"
      ],
      "s": "NZX:MFT"
    },
    {
      "f": [
        1.214924e+07,
        0.05341667966049337,
        null,
        "Michael Hill International Limited is engaged in the retail sale of jewelry and related services sector. The Company's segments include Michael Hill, Emma \u0026 Roe, and Corporate \u0026 Other. The Company operates through four geographical segments: Australia, New Zealand, Canada and the United States of America. The Company operates a retail jewelry chain of over 300 Michael Hill and Emma \u0026 Roe branded stores. The jewelry collections available at Michael Hill stores include Michael Hill Designer Bridal, Infinitas, Everlight and Spirits Bay. The Company operates over 170 stores across Australia, over 50 in New Zealand, over 70 in Canada and over 10 in the United States. Emma \u0026 Roe offers a range of jewelry, such as charms, bracelets, rings, pendants and earrings that are interchangeable. Its jewelry features an array of stones, including diamonds, Murano glass and other gems. The Company's stores are located at Broadway Mall, New South Wales; Casey, Victoria, and Halls Head, Western Australia.",
        0.09962,
        1.35962,
        "Australia",
        "AUD",
        2.37768,
        21.93497,
        -1.749e+07,
        0.04965346935173063,
        0.05114,
        0.05094,
        6.617400000000001e+07,
        8.03683773083084,
        5.559408359850546e+08,
        0.05285219811417896,
        6.015909813035995e+06,
        "NZD",
        null,
        0.6420027,
        0.6420027,
        3.53825e+08,
        "Jewelry",
        0.05087,
        5.51127e+08,
        5.224545362542475e+08,
        3.2034e+07,
        1.9577e+07,
        2450,
        4059,
        0.086031,
        0.07536190000000001,
        1.825,
        1.15,
        2.65153,
        25.32391,
        13.0369,
        -3.00752,
        null,
        0.90686,
        0.39759,
        0.0693795,
        0.0532555,
        0.1046837,
        0.0693795,
        224949.8,
        "Basic Materials",
        "NZX:MHJ",
        3.84197e+08,
        2.40112e+08,
        4.0887e+07,
        5.51127e+08,
        3.8313851e+08,
        3.8313851e+08,
        "http://investor.michaelhill.com/phoenix.zhtml?c=170266\u0026p=irol-IRHome"
      ],
      "s": "NZX:MHJ"
    },
    {
      "f": [
        3.135391e+07,
        -0.00195,
        0.28595,
        "SeaDragon Limited is engaged in the manufacture of refined fish oils. The Company is a producer of refined New Zealand fish oils, which are suitable for human consumption. The Company's products include Omega-2 and Omega-3. The Company's Omega-2 product can be sourced from either animal or vegetable sources and is primarily used in the cosmetics, nutraceutical and pharmaceutical industries and also in high-grade lubrication and fiber coating. The Company produces over 80 tons of Omega-3 finished product from a range of species, including approximately 60 tons from the new refinery. The Company exports its products to various countries, which include Australia, South East and North Asia, Japan, the European Union, China, the United States and Canada. The Company's subsidiaries include Omega 3 New Zealand Limited and SeaDragon Marine Oils Limited, which are engaged in marine oil blending activities.",
        -0.00173,
        1.42126,
        "New Zealand",
        "NZD",
        0.64433,
        42.1018,
        null,
        null,
        null,
        null,
        null,
        null,
        3.978795e+07,
        0,
        -1.0232e+07,
        "NZD",
        null,
        null,
        null,
        1.307e+06,
        "Seafood Product Preparation \u0026 Packaging",
        -0.00195,
        5.585e+06,
        3.610895e+07,
        3.679e+06,
        -5.523e+06,
        null,
        null,
        null,
        null,
        0.01422,
        0.007,
        2.36387,
        null,
        null,
        0,
        -40.00001,
        null,
        0.3801,
        null,
        null,
        null,
        null,
        null,
        "Consumer/Non-Cyclical",
        "NZX:SEA",
        1.6338000000000002e+07,
        3.509e+06,
        4.483e+06,
        5.585e+06,
        3.14631438e+09,
        3.14631438e+09,
        "http://www.seadragon.co.nz/"
      ],
      "s": "NZX:SEA"
    },
    {
      "f": [
        2.22509e+06,
        0.24037,
        0.91379,
        "Restaurant Brands New Zealand Limited is engaged in the operation of quick service and takeaway restaurant concepts in New Zealand. The Company operates through four segments: KFC, Pizza Hut, Starbucks Coffee and Carl's Jr. The Company operates the New Zealand franchises for KFC, which is a fast food restaurant chain; Pizza Hut, which offers fast food online ordering system for pizzas; Starbucks Coffee, which offers a range of coffee, and Carl's Jr, which offers burgers, beverages and breakfasts. The Company has approximately 181 stores, including over 91 KFC, approximately 46 Pizza Hut, over 26 Starbucks and approximately 18 Carl's Jr. stores. The Company operates Carl's Jr. stores at Auckland Airport, Mangere, Otahuhu, Metro (Auckland CBD), Frankton, Rotorua, Gisborne, Hastings and Palmerston North, Albany, Avondale, Henderson, Manukau, Pakuranga, Pukekohe, St. Johns, Takanini, Upper Harbour. The Company serves approximately 60,000 customers across New Zealand.",
        0.42321,
        1.42126,
        "New Zealand",
        "NZD",
        0.29989,
        74.61125,
        -1.9574e+07,
        0.20525,
        0.23663,
        0.23663,
        5.8611e+07,
        10.907691388988415,
        6.393107e+08,
        0.2256,
        3.918e+06,
        "NZD",
        null,
        0.1875409,
        0.1875409,
        7.4112e+07,
        "Quick Service Restaurants",
        0.24037,
        4.04095e+08,
        6.277287e+08,
        1.1582e+07,
        2.407e+07,
        3363,
        6014,
        0.07617689999999999,
        0.0755427,
        5.65895,
        4.03653,
        5.51677,
        21.59489,
        13.74097,
        -0.19531,
        18.5563,
        1.38709,
        0.16279,
        0.182613,
        0.1278153,
        0.2830075,
        0.182613,
        134567.9,
        "Services",
        "NZX:RBD",
        2.38877e+08,
        1.8735e+07,
        7.274e+07,
        4.04095e+08,
        1.0525256e+08,
        1.0525256e+08,
        "http://www.restaurantbrands.co.nz/"
      ],
      "s": "NZX:RBD"
    },
    {
      "f": [
        2.186434e+07,
        0.18738,
        0.65576,
        "Goodman Property Trust (GMT) is a New Zealand-based unit trust. The Trust invests in industrial and business space property. GMT is a business space provider, which is engaged in leasing industrial and office facilities at its estates in Auckland and Christchurch. The Trusts' portfolio includes estates and properties that provide over 1,000,000 square meters of rentable area, accommodating approximately 280 customers. The Trusts' property portfolio includes Central Park Corporate Centre, Greenlane; Connect Business Estate, Penrose; Highbrook Business Park, East Tamaki; Millennium Centre, Greenlane; M20 Business Park, Manukau; Penrose Industrial Estate, Penrose; Savill Link, Otahuhu; The Gate Industry Park, Penrose; VXV Precinct, Wynyard Quarter; Westney Industry Park, Mangere; Glassworks Industry Park, Christchurch; Show Place Office Park, Christchurch, and Southpark Industrial Estate, Christchurch. Goodman (NZ) Limited is the manager of the Trust.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        4.05097,
        54.66386,
        -8.2e+07,
        0.06652,
        0.19996,
        0.19772,
        1.209e+08,
        19.173382961124897,
        2.318062e+09,
        0.06814,
        -1.216e+08,
        "NZD",
        null,
        0.8148148000000001,
        0.8148148000000001,
        1.3380000000000001e+08,
        "Commercial REITs - NEC",
        0.18304,
        1.66e+08,
        1.504262e+09,
        8.138e+08,
        2.331e+08,
        0,
        null,
        1.744991,
        1.626594,
        1.405,
        1.17,
        0.95745,
        5.94275,
        null,
        -2.89256,
        -4.73255,
        9.13334,
        0.91262,
        0.10699059999999999,
        0.1045326,
        0.1707499,
        0.10699059999999999,
        null,
        "Services",
        "NZX:GMT",
        2.5435e+09,
        3.338e+08,
        8.562e+08,
        1.66e+08,
        1.2763e+09,
        1.2763e+09,
        "http://nz.goodman.com/about-us"
      ],
      "s": "NZX:GMT"
    },
    {
      "f": [
        3.11919e+06,
        -0.34206,
        null,
        "Orion Health Group Limited is a provider of healthcare information technology engaged in sales, development, implementation, hosting and support of healthcare software for governments, hospitals, insurers and other healthcare organizations. The Company's segments include North America, EMEA, APAC, and Corporate. It offers a precision medicine platform, Amadeus. The Company's other products include Coordinate, Communicate, Rhapsody, Engage and Medicare Share Savings Program (MSSP) Management. Amadeus aggregates, stores, and makes sense of all forms of data to enable precision medicine. Coordinate provides the technology for care teams to collaborate, manage care and take preventative action. Communicate provides protected communication between patients, healthcare providers, and organizations across desktop and electronic medical (EMR) systems. Rhapsody Integration Engine achieves interoperability between healthcare systems. It also offers managed services and education services.",
        -0.29561,
        1.42126,
        "New Zealand",
        "NZD",
        1.21157,
        1.27787,
        null,
        null,
        -0.28506,
        -0.28506,
        -2.9245e+07,
        -8.930702684219524,
        2.611784e+08,
        0,
        -3.8495e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Medical Software \u0026 Technology Services",
        -0.34206,
        2.06935e+08,
        3.197544e+08,
        -5.8576e+07,
        -5.44e+07,
        1226,
        2776,
        -0.21450639999999999,
        -0.2106578,
        5.35,
        1.56,
        7.26745,
        null,
        null,
        2.04082,
        -36.50794,
        1.52682,
        null,
        -0.6528999,
        -0.3000762,
        -0.6829733,
        -0.6528999,
        null,
        "Technology",
        "NZX:OHE",
        1.20466e+08,
        9.0612e+07,
        560000,
        2.06935e+08,
        1.5924063e+08,
        1.5924063e+08,
        null
      ],
      "s": "NZX:OHE"
    },
    {
      "f": [
        240710,
        -0.06172,
        1.75997,
        "Moa Group Limited operates in the beverage sector, brewing and distributing craft beers and cider. The Company's beer and cider range includes Moa Original Lager, Moa Session Pale Ale, Moa White Lager, Moa Methode Pilsner, Moa South Pacific I.P.A., Moa Temperance Pale Ale, Moa Southern Alps, Moa St Josephs, Moa Five Hop, Moa Imperial Stout, Moa Apple Cider, Moa Cascara Cider, Moa Kiwifruit Cider, Moa Festive IPA, Moa Cherry Sour 2014 Vintage, Moa Blanc, Moa Breakfast and Moa Blanc Evolution, among others. The Company has operations in New Zealand and sells to New Zealand and Australian businesses. It also exports to the rest of the world. The Company's subsidiary is Moa Brewing Company Limited.",
        -0.05487,
        1.42126,
        "New Zealand",
        "NZD",
        2.82436,
        0,
        null,
        null,
        -0.05287,
        -0.05287,
        -1.983e+06,
        -21.364820978315684,
        4.236644e+07,
        null,
        -2.643e+06,
        "NZD",
        null,
        0.3036881,
        0.3036881,
        2.4e+06,
        "Brewers - NEC",
        -0.06172,
        8.154e+06,
        4.393044e+07,
        -1.564e+06,
        -2.966e+06,
        null,
        null,
        -0.2962185,
        -0.29283380000000003,
        0.95,
        0.48701,
        5.67601,
        null,
        null,
        -3.52941,
        65.00538,
        5.12727,
        2.00167,
        -0.34233870000000005,
        -0.2683997,
        -0.34233870000000005,
        -0.34233870000000005,
        null,
        "Consumer/Non-Cyclical",
        "NZX:MOA",
        9.887e+06,
        6.77e+06,
        0,
        8.154e+06,
        5.184553e+07,
        5.184553e+07,
        "http://www.moabeer.com/"
      ],
      "s": "NZX:MOA"
    },
    {
      "f": [
        6.64099e+06,
        0.05186,
        0.1703,
        "NPT Limited is a commercial property investment company investing solely in New Zealand. The Company's investment properties are divided into three business sectors: Industrial, Commercial and Retail. The Company's retail properties include Eastgate Shopping Centre and 22 Stoddard Road Shopping Centre. Its industrial properties include Heinz Wattie's National Distribution Centre and Print Place. Its commercial properties include AA Centre. The AA Centre is an approximately 18 level office tower with ground floor retail space and a basement car park. The 22 Stoddard Road Shopping Centre has approximately 20 specialty retail stores and over 300 car parks. The Print Place property is located in the Middleton industrial area of Christchurch with access to the southern motorway system. The Company's subsidiaries include Eastgate Shopping Centre Limited, 22 Stoddard Road Limited, 99 Albert Street Limited and NPT 10 Limited.",
        0.05251,
        1.42126,
        "New Zealand",
        "NZD",
        1.69909,
        46.46296,
        -7.325e+06,
        0.035,
        0.03614,
        0.03614,
        9.542e+06,
        15.396028086355061,
        1.469089e+08,
        0.036,
        -6.448e+06,
        "NZD",
        null,
        0.6830607999999999,
        0.6830607999999999,
        1.1509e+07,
        "Real Estate Development \u0026 Operations - NEC",
        0.05186,
        1.6977e+07,
        1.020099e+08,
        4.4899e+07,
        8.397e+06,
        1,
        null,
        0.4064474,
        0.3944028,
        0.7,
        0.62,
        0.854,
        17.43221,
        17.08708,
        -3.07692,
        -5.97015,
        6.0229,
        null,
        0.0336804,
        0.033059599999999995,
        0.0490214,
        0.0336804,
        null,
        "Services",
        "NZX:NPT",
        1.82164e+08,
        4.122e+06,
        5.55e+07,
        1.6977e+07,
        1.6192043e+08,
        1.6192043e+08,
        "http://www.npt.co.nz/"
      ],
      "s": "NZX:NPT"
    },
    {
      "f": [
        2.0137399999999998e+06,
        -0.123223242,
        null,
        "Pushpay Holdings Limited is engaged in the provision of a platform for mobile commerce and electronic payments, and tools for merchants to engage with consumers. The Company focuses on the development and deployment of mobile payment solutions. The Company's solutions include Event Registration, 3D Touch, echurch Apps, Pushpay Fastpay and Virtual Terminal/Envelope Giving. The Company caters to various markets, such as the faith sector, non-profit organization's and enterprises both small medium enterprises and corporate organizations. The Company's subsidiaries include eChurch Inc, eChurch Inc, Pushpay IP Limited, Pushpay Pty Limited, Pushpay Trustees Limited, Pushpay NZ Limited and ZipZap Processing Inc.",
        -0.07911,
        1,
        "New Zealand",
        "USD",
        0.71724,
        28.58046,
        null,
        null,
        -0.12841,
        -0.12841,
        -2.612402e+07,
        -12.289892979717516,
        4.563117395766e+08,
        0,
        -3.07355860434e+07,
        "NZD",
        null,
        0.1109741,
        0.1109741,
        -6.405805e+06,
        "Transaction \u0026 Payment Services",
        -0.0867,
        1.420075e+07,
        4.73296777246e+08,
        -1.195069e+07,
        -1.3716116e+07,
        null,
        826,
        -1.142612,
        -1.155826,
        2.83,
        1.29,
        68.39162,
        null,
        null,
        -8.27586,
        -21.41802,
        13.24114,
        null,
        -3.342084,
        -1.795959,
        -3.342084,
        -3.342084,
        null,
        "Financial",
        "NZX:PPH",
        1.2312e+07,
        6.562e+06,
        904000,
        1.044603e+07,
        2.31166e+08,
        2.31166e+08,
        null
      ],
      "s": "NZX:PPH"
    },
    {
      "f": [
        1.114364e+07,
        -0.00308,
        4.06265,
        "Promisia Integrative Limited is a New Zealand-based company focused on developing and marketing therapeutic natural products based on the scientific research. The Company's geographical segments include Australia and New Zealand. The Company has over three operating entities, which include Promisia Limited, Benefit Arthritis Limited and Benefit Healthcare Pty Limited. Promisia Limited is engaged in the distribution and manufacture of therapeutic natural products, while Benefit Arthritis Limited and Benefit Healthcare Pty Limited are engaged only in the distribution of therapeutic natural products. In addition, its subsidiary, Promisia LLC, is also engaged only in the distribution of therapeutic natural products. Its product, Arthrem, is used in the treatment of osteoarthritis. The Company sells Arthrem through over 600 pharmacies in New Zealand.",
        -0.00303,
        1.42126,
        "New Zealand",
        "NZD",
        2.89329,
        314.2029,
        null,
        null,
        -0.00271,
        -0.00271,
        -714000,
        -40.58896358543417,
        2.898052e+07,
        null,
        -892000,
        "NZD",
        null,
        0.7476189999999999,
        0.7476189999999999,
        310000,
        "Waste Management, Disposal \u0026 Recycling Services",
        -0.00308,
        408000,
        2.890552e+07,
        75000,
        -946000,
        null,
        null,
        -0.5865079,
        -0.6230159,
        0.063,
        0.00959,
        72.42521,
        null,
        null,
        -5.17241,
        201.951,
        22.94089,
        1.55335,
        -0.7381288,
        -0.5080906000000001,
        null,
        -0.7381288,
        null,
        "Healthcare",
        "NZX:PIL",
        2.085e+06,
        1.898e+06,
        1.084e+06,
        408000,
        4.5430356e+08,
        4.5430356e+08,
        "http://www.promisia.com/"
      ],
      "s": "NZX:PIL"
    },
    {
      "f": [
        3.58799e+06,
        -0.079022056,
        0.79046,
        "Rubicon Limited is a New Zealand-based holding company. The Company has two investments: Tenon Limited (Tenon) and ArborGen Inc. (ArborGen). The Company operates through two segments: Tenon (appearance and wood products) and ArborGen (forestry genetics). The Company is an international investor in forestry related industries. The Company operates in Australasia, and North and South America. Tenon is a wood products processing, marketing and distribution business, focusing on the molding and millwork markets in the United States. Tenon also supplies a range of millwork items, including decorative products, stair-parts, doors, sidings, and outdoor products. Tenon operates in the new home construction (professional builders or pro-dealers), and remodeling and renovation (retail or national home center) markets. ArborGen is engaged in the commercialization of advanced forestry genetics. ArborGen develops and produces plantation tree seedlings.",
        -0.07297,
        1,
        "New Zealand",
        "USD",
        1.53521,
        45.71429,
        null,
        null,
        -0.07314,
        -0.07314,
        2.84252e+07,
        6.121994216399533,
        2.473261160266e+08,
        null,
        5.4539459665199995e+07,
        "NZD",
        5.4e+07,
        0.2627907,
        0.2627907,
        1.13e+08,
        "Forest \u0026 Wood Products - NEC",
        -0.0556,
        6.111418e+08,
        1.220873567954e+08,
        8.811812e+07,
        -1.6e+07,
        20,
        6432,
        -0.034883700000000004,
        -0.0465116,
        0.3,
        0.195,
        0.43171,
        null,
        null,
        -4.54545,
        -32.25806,
        0.14056,
        0.53521,
        -0.11735939999999999,
        -0.0784314,
        -0.1077441,
        -0.11735939999999999,
        null,
        "Basic Materials",
        "NZX:RBC",
        2.89e+08,
        1.09e+08,
        6.4e+07,
        4.3e+08,
        4.0905138e+08,
        4.0905138e+08,
        "http://www.rubicon-nz.com/"
      ],
      "s": "NZX:RBC"
    },
    {
      "f": [
        3.94941e+06,
        0.25679,
        null,
        "Scales Corporation Limited is engaged in agribusiness. The Company provides logistics services, grows apples, exports products, provides insurance services, and operates storage and processing facilities. Its segments are Food Ingredients, Horticulture, Storage \u0026 Logistics and Other. The Food Ingredients segment includes processing and marketing of food ingredients; Meateor Foods Limited; Meateor Foods Australia Pty Limited, and Profruit (2006) Limited. The Horticulture segment includes orchards, fruit packing and marketing; Mr Apple New Zealand Limited; New Zealand Apple Limited, and Fern Ridge Produce Limited. The Storage \u0026 Logistics segment includes cool, cold and bulk liquid storage, and logistics services; Liqueo Bulk Storage Limited; Polarcold Stores Limited; Scales Logistics Limited, and Whakatu Coldstores Limited. The Other segment includes Scales Corporation Limited, Geo. H. Scales Limited, Scales Employees Limited, Scales Holdings Limited and Selacs Insurance Limited.",
        0.33785,
        1.42126,
        "New Zealand",
        "NZD",
        1.41197,
        34.18654,
        -9.685e+06,
        0.13,
        0.26264,
        0.26264,
        6.2463e+07,
        7.570119910987304,
        4.728524e+08,
        0.17,
        2.1469e+07,
        "NZD",
        1.1021e+07,
        0.327653,
        0.327653,
        1.07268e+08,
        "Food Processing - NEC",
        0.25679,
        3.0141e+08,
        4.570774e+08,
        1.5775e+07,
        3.5894e+07,
        null,
        null,
        0.1442349,
        0.1442349,
        3.55,
        2.16,
        2.39254,
        12.4505,
        9.38056,
        -0.6079,
        39.56523,
        1.3069,
        0.65275,
        0.1651174,
        0.11246969999999999,
        0.21168990000000001,
        0.1651174,
        null,
        "Consumer/Non-Cyclical",
        "NZX:SCL",
        3.5245e+08,
        1.55019e+08,
        6.531100000000001e+07,
        3.0141e+08,
        1.3977901e+08,
        1.3977901e+08,
        "http://scalescorporation.co.nz/"
      ],
      "s": "NZX:SCL"
    },
    {
      "f": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        -6.1955e+07,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "NZD",
        null,
        null,
        null,
        1.85018e+08,
        null,
        null,
        null,
        null,
        null,
        5.3043e+07,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "NZX:QHLHA",
        1.489615e+09,
        6.6075e+07,
        3.732e+08,
        2.69729e+08,
        10000,
        10000,
        null
      ],
      "s": "NZX:QHLHA"
    },
    {
      "f": [
        0,
        -0.00183,
        null,
        "NZF Group Limited is a New Zealand-based shell company. The Company has no trading operations. NZF Money Limited, which is a finance company, is the subsidiary of the Company.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        null,
        null,
        null,
        -0.00292,
        -0.00292,
        -348000,
        -3.009051724137931,
        1.04715e+06,
        null,
        -524000,
        "NZD",
        null,
        null,
        null,
        4000,
        "Consumer Lending - NEC",
        -0.00183,
        4000,
        1.17115e+06,
        -124000,
        -203000,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        -2.92437,
        null,
        null,
        null,
        "Financial",
        "NZX:NZF",
        141000,
        null,
        0,
        4000,
        1.25958e+08,
        1.25958e+08,
        "http://www.nzf.co.nz/"
      ],
      "s": "NZX:NZF"
    },
    {
      "f": [
        3.8984e+06,
        0.28924,
        0.6606,
        "Steel \u0026 Tube Holdings Limited is engaged in the business of distribution, processing and fabrication of steel, plastic and allied products. The Company's segments are steel and stainless distribution and processing roofing products, reinforcing and wire businesses and fastenings and plastics businesses. It offers a portfolio of stainless steel products, including coil, sheet, plate, pipe, hygienic tube and associated fittings, and a range of structural bar, handrail and architectural products. Its industrial products include grinding discs and cut off wheels; Loctite, Bostik adhesives and sealants; anti-luce fittings; stainless steel hose clips; grease nipples; power bits and nutsetters; and circlips, cotter pins, tension pins, dowell pins, shaft collars and recoils. Its product range also includes a range of brands, such as Hurricane and Atlas, as well as new seismic products. The Company also supplies fabricated reinforcing steel meshes, bars, ties, piles, beams and columns.",
        0.36016,
        1.42126,
        "New Zealand",
        "NZD",
        4.43975,
        54.31496,
        -1.7027e+07,
        0.225,
        0.2893,
        0.28915,
        3.0539e+07,
        10.100900487900716,
        3.084714e+08,
        0.20825,
        -1.981e+06,
        "NZD",
        null,
        0.2393715,
        0.2393715,
        1.23503e+08,
        "Iron, Steel Mills \u0026 Foundries",
        0.28905,
        5.15947e+08,
        2.128584e+08,
        9.5613e+07,
        2.5826e+07,
        918,
        8506,
        0.0591902,
        0.0642857,
        2.47,
        1.79,
        1.16719,
        8.12727,
        null,
        3.52423,
        6.33484,
        0.41256,
        1.84697,
        0.09884470000000001,
        0.0835467,
        0.1487441,
        0.09884470000000001,
        562033.8,
        "Capital Goods",
        "NZX:STU",
        3.3044e+08,
        2.21539e+08,
        9.79e+07,
        5.15947e+08,
        8.952331e+07,
        8.952331e+07,
        "http://steelandtube.co.nz/"
      ],
      "s": "NZX:STU"
    },
    {
      "f": [
        5.44506e+06,
        -0.04339,
        2.23205,
        "Pacific Edge Limited is a cancer diagnostics company. The Company develops and commercializes diagnostic and prognostic tools for the early detection and management of cancers. The Company's segments include NZ Laboratory, US Laboratory and Research NZ \u0026 Australia. Its segments are engaged in the research and development of diagnostic and prognostic products for human cancer both in New Zealand and Australia, and operation of the laboratories used for the detection of bladder cancer in the United States and New Zealand. It offers Cxbladder, which is a suite of non-invasive laboratory tests for the detection and the management of bladder cancer. Cxbladder includes a suite of urine-based molecular tests to determine the likelihood of bladder cancer in patients presenting with hematuria. Its pipeline includes Cxcolorectal, which is a prognostic gene signature for patients diagnosed with stage II or stage III colorectal cancer, enabling prediction of aggressiveness of the tumor.",
        -0.04199,
        1.42126,
        "New Zealand",
        "NZD",
        11.13892,
        0,
        null,
        null,
        -0.05793,
        -0.05793,
        -1.944319e+07,
        -10.538509884437687,
        2.0490225e+08,
        0,
        -1.727693e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Biotechnology \u0026 Medical Research - NEC",
        -0.04339,
        7.1932e+06,
        2.290627e+08,
        -2.416045e+07,
        -1.567639e+07,
        0,
        null,
        -2.402683,
        -2.402683,
        0.67,
        0.38,
        10.69344,
        null,
        null,
        9.09091,
        33.33333,
        27.55078,
        10.83801,
        -0.6760200000000001,
        -0.6346547,
        -0.6760200000000001,
        -0.6760200000000001,
        null,
        "Healthcare",
        "NZX:PEB",
        2.3413e+07,
        2.2211e+07,
        0,
        7.1932e+06,
        3.8173806e+08,
        3.8173806e+08,
        "http://www.pacificedge.co.nz/"
      ],
      "s": "NZX:PEB"
    },
    {
      "f": [
        55750,
        0.07226,
        0.10694,
        "Solution Dynamics Limited (SDL) is engaged in the supply of customer communications solutions. The Company operates in the customer communications market (essential mail, interactive marketing communications and on-demand communications). Its products and services are represented by approximately two revenue streams, which include services and software and technology. The services include digital print and mail house processing for mail items, such as invoices, statements and promotional material. The software and technology stream develops and markets its own software products related to multichannel marketing communications, which include digital asset management, communication templates and campaign management; document archiving; document composition, and desktop mail solutions. It offers further technology services relating to its own software and the management of client data about the formatting, electronic output and archiving of customer communications.",
        0.08757,
        1.42126,
        "New Zealand",
        "NZD",
        1.33116,
        0.33557,
        -633000,
        0.0525,
        0.07233,
        0.06937,
        1.763e+06,
        17.541440726035166,
        3.092556e+07,
        null,
        59000,
        "NZD",
        938000,
        null,
        null,
        null,
        "Business Support Services - NEC",
        0.0694,
        1.6322e+07,
        3.2337560000000004e+07,
        -1.412e+06,
        1.016e+06,
        0,
        null,
        0.0871829,
        0.0881632,
        2.45,
        1.4,
        10.85153,
        33.15554,
        25.22431,
        0,
        39.39394,
        1.98123,
        1.29171,
        0.3681826,
        0.1910493,
        0.36885100000000004,
        0.3681826,
        null,
        "Services",
        "NZX:SDL",
        5.743e+06,
        3.678e+06,
        10000,
        1.6322e+07,
        1.405981e+07,
        1.405981e+07,
        "http://solutiondynamics.com/"
      ],
      "s": "NZX:SDL"
    },
    {
      "f": [
        5.0395e+06,
        0.48235,
        0.07484,
        "The New Zealand Refining Company Limited is a New Zealand-based company that operates oil refinery. The Company operates through two segments: Oil Refining and Distribution. The Company also includes other segments, which include the subsidiary company operations and properties. The Company owns and operates an oil refinery located at Marsden Point, approximately 160 kilometers north of Auckland. The oil refinery processes a range of crude oil types imported from across the world. The Company owns infrastructure to support the distribution of manufactured products to its customers. The Refinery to Auckland Pipeline transfers product to the Wiri Oil terminal located in South Auckland. The Company's pipeline transports refined fuels for consumption within the Auckland market. Independent Petroleum Laboratory Limited is the subsidiary of the Company.",
        0.71355,
        1.42126,
        "New Zealand",
        "NZD",
        0.58833,
        39.5322,
        -1.5629e+07,
        0.25,
        0.31024,
        0.31024,
        2.22116e+08,
        4.5252651767544885,
        1.0051338e+09,
        0.08667,
        1.20291e+08,
        "NZD",
        null,
        0.6325502000000001,
        0.6325502000000001,
        3.10494e+08,
        "Petroleum Refining",
        0.48235,
        4.46771e+08,
        8.126988e+08,
        1.92435e+08,
        1.50771e+08,
        410,
        4511,
        0.35904220000000003,
        0.3344594,
        3.83,
        2.15,
        1.14342,
        8.38061,
        4.61077,
        0,
        -27.97784,
        2.03966,
        0.58056,
        0.0928163,
        0.0749129,
        0.1362914,
        0.0928163,
        null,
        "Energy",
        "NZX:NZR",
        1.318252e+09,
        1.65708e+08,
        2.81e+08,
        4.46771e+08,
        3.126e+08,
        3.126e+08,
        "http://www.refiningnz.com/"
      ],
      "s": "NZX:NZR"
    },
    {
      "f": [
        341550,
        -0.09195,
        1.66725,
        "Pumpkin Patch Limited is engaged in designing, marketing, retailing and wholesaling of children's clothing. The Company operates through New Zealand, Australia and Other International Market segments. The Company's products are categorized into baby for the new borns, girl, boy, occasion wear and clearance. The products sizes are categorized into newborn-12 months; newborn-18 months; 12 months-6 years, and 5-12 years. The baby collection has bear hugs, fairytale folklore trail boy, home sweet home, watch me grow, farmyard friends, autumn in wonderland and desert road trip. The girl collection has autumn in wonderland, atlantica and urban angel gypsy rose. The boy collection has desert road trip and paradise behold. It also offers ones plus bodysuits, jackets plus coats, jumpers plus knits, jeans plus pants, dresses, sets, sleepwear, shorts, shirts, swimwear, tops, accessories, hosiery, footwear and gifts.",
        -0.05221,
        1.42126,
        "New Zealand",
        "NZD",
        0.72719,
        579.2374,
        null,
        null,
        -0.09195,
        -0.09195,
        -2.0579999999999998e+06,
        -27.296758989310014,
        5.617673e+07,
        null,
        -7.469e+06,
        "NZD",
        null,
        0.4838871,
        0.4838871,
        1.02781e+08,
        "Children \u0026 Infants Clothing Retailers",
        -0.09195,
        2.12407e+08,
        1.014473e+07,
        4.6032e+07,
        -1.5547e+07,
        null,
        null,
        -0.0608549,
        -0.0608549,
        0.13,
        0.055,
        1.26684,
        null,
        null,
        0,
        -55.55556,
        0.04776,
        0.07289,
        -0.6617716,
        -0.161482,
        -0.8607574,
        -0.6617716,
        null,
        "Services",
        "NZX:PPL",
        8.8832e+07,
        5.4889e+07,
        4.6032e+07,
        2.12407e+08,
        1.6779306e+08,
        1.6779306e+08,
        "http://www.pumpkinpatch.co.nz/"
      ],
      "s": "NZX:PPL"
    },
    {
      "f": [
        1.60181e+06,
        0.00728599329224342,
        0.41853,
        "Mercantile Investment Company Limited is an Australia-based investment company. The principal activities of the Company are investment in cash and securities, which will provide risk adjusted returns, including by way of short term trading, profit making ventures and holding shares for dividend yield/long term capital appreciation. The Company operates through two segments: Securities and Consumer Finance. Within the securities industry, the Company derives revenue from trust distribution, dividend income, interest income and from sale of its investment portfolio. Within the consumer finance industry, the Company derives revenue from interest income. The Company's subsidiaries include Murchison Metals Ltd, Mercantile ADF Pty Ltd, Mercantile IAH Pty Ltd, Mercantile IAM Pty Ltd, Mercantile OFM Pty Ltd, ATL Exploration Pty Ltd, MMX Investments Pty Ltd, MMX Port Holdings Pty Ltd, MMX Rail Holdings Pty Ltd, Jack Hills Holdings Pty Ltd and Weld Range Mining Pty Ltd.",
        0.00604,
        1.35962,
        "Australia",
        "AUD",
        12.84175,
        32.70719,
        null,
        0,
        0.00689,
        0.00689,
        3.20004e+06,
        12.198556893038838,
        4.080560788764507e+07,
        null,
        -9.756540859946162e+06,
        "NZD",
        null,
        0.880358,
        0.880358,
        6.055e+06,
        "Investment Trusts",
        0.00697,
        6.89676e+06,
        4.975800297141848e+07,
        -8.56413e+06,
        1.90509e+06,
        null,
        null,
        0.32795070000000004,
        0.32795070000000004,
        0.175,
        0.125,
        1.03049,
        24.67344,
        null,
        0,
        17.24138,
        6.76562,
        null,
        0.0310385,
        0.0294705,
        0.045143199999999994,
        0.0310385,
        null,
        "Financial",
        "NZX:MVT",
        6.904392e+07,
        2.752449e+07,
        1.510793e+07,
        6.89676e+06,
        2.8e+08,
        2.8e+08,
        "http://www.mercantileinvestment.com.au/"
      ],
      "s": "NZX:MVT"
    },
    {
      "f": [
        5.376431e+07,
        0.265988809,
        2.69335,
        "OceanaGold Corporation is an Australia-based gold mining and exploration company. The Company is engaged in the production of gold. The Company operates through three segments: New Zealand, the Philippines and the USA. Its asset portfolio consists of the Macraes Operations (Macraes), which include the operating Macraes open pit gold mines and Frasers underground gold mine; the Didipio Operations (Didipio), which includes an open pit that commenced commercial production, and an underground mine; the Waihi Gold Mine Operation (Waihi), which includes the Martha open pit and Correnso underground gold mine, and the Haile Gold Mine Project (Haile). Macraes is located approximately 60 kilometers north of Dunedin and over 30 kilometers to the northwest of Palmerston in the Otago Region of the South Island, New Zealand. The Didipio is located in the north of Luzon Island, approximately 270 kilometers north-northeast of Manila, in the Philippines.",
        0.61657,
        1,
        "Australia",
        "USD",
        1.34218,
        22.56728,
        -1.221e+07,
        0.0284252,
        0.25573,
        0.25034,
        3.75005e+08,
        5.665716723777016,
        3.0197114688459997e+09,
        0.07200103159999999,
        3.20959024146e+07,
        "NZD",
        null,
        0.5196426000000001,
        0.5196426000000001,
        2.80552e+08,
        "Gold Mining",
        0.18378,
        6.771948e+08,
        2.9960658240999994e+09,
        1.663709e+07,
        5.3066e+07,
        null,
        null,
        0.2274533,
        0.2193357,
        5.56,
        2.5,
        1.19678,
        13.7811,
        6.22291,
        -5.99455,
        34.76563,
        2.53084,
        0.93478,
        0.0924023,
        0.08381690000000001,
        0.1163698,
        0.0924023,
        null,
        "Basic Materials",
        "NZX:OGC",
        1.884097e+09,
        2.1967e+08,
        2.98269e+08,
        5.07985e+08,
        6.11205e+08,
        6.11205e+08,
        "http://www.oceanagold.com"
      ],
      "s": "NZX:OGC"
    },
    {
      "f": [
        322190,
        0.00125,
        1.73119,
        "SmartPay Holdings Limited is a provider of technology products, services and software to merchants and retailers. The Company designs, develops and implements payment solutions for customers in New Zealand and Australia. It offers a range of payment and data management solutions for retail, business payment and transactional processing requirements. The Company is the electronic funds transfer at point of sale (EFTPOS) terminal provider throughout Australia. It licenses its technologies to third parties. The Company is a supplier of taxi payment solutions in New Zealand. The Company offers wireless EFTPOS Machines that allow accepting a credit card onsite. Its stationary countertop solutions are capable of connecting through the Internet. Its EFTPOS terminals are available for hire for a trade show on a short term lease. The Company has over 45,000 EFTPOS terminals throughout Australia and New Zealand, servicing the payment needs of approximately 18,000 merchants.",
        0.03451,
        1.42126,
        "New Zealand",
        "NZD",
        0.87082,
        228.4263,
        null,
        null,
        0.00343,
        0.00343,
        8.567e+06,
        6.200524104120462,
        5.311989e+07,
        0.013,
        -2.76e+06,
        "NZD",
        1.4772e+07,
        0.4063209,
        0.4063209,
        8.111000000000001e+06,
        "Transaction \u0026 Payment Services",
        0.00125,
        2.0361e+07,
        2.919789e+07,
        2.3922e+07,
        215000,
        null,
        null,
        0.022203300000000002,
        0.022203300000000002,
        0.225,
        0.11,
        2.47167,
        49.56268,
        4.49752,
        0,
        25.92593,
        1.37934,
        null,
        0.0165503,
        0.0139479,
        0.050738700000000005,
        0.0165503,
        null,
        "Technology",
        "NZX:SPY",
        4.3425e+07,
        6.303e+06,
        2.6984e+07,
        2.0361e+07,
        1.7175228e+08,
        1.7175228e+08,
        "http://www.smartpay.co.nz/"
      ],
      "s": "NZX:SPY"
    },
    {
      "f": [
        5.56886e+06,
        0.1136,
        0.48246,
        "Port Of Tauranga Limited is a New Zealand-based company, which operates a port and natural freight gateway to and from international markets for various New Zealand's businesses. The Company carries out its business through the provision of wharf facilities, land and buildings, for the storage and transit of import and export cargo, berthage, cranes, tugs and pilot services for customers. The Company operates through three segments: Port Operations, Property Services and Marshalling Services. The Port Operations segment's operations consist of providing and managing port services, and cargo handling facilities through the Port of Tauranga and MetroPort. The Property Services segment consists of managing and maintaining the port's property assets. The Marshalling Services segment consists of the contracted terminal operations, stevedoring, marshalling and scaling activities of Quality Marshalling (Mount Maunganui) Limited, a subsidiary of the Company.",
        0.14846,
        1.42126,
        "New Zealand",
        "NZD",
        0.22901,
        36.15285,
        -7.2142e+07,
        0.106,
        0.1136,
        0.1136,
        1.29743e+08,
        21.892371842796916,
        2.840382e+09,
        0.13717,
        -4.337e+07,
        "NZD",
        null,
        0.7568640000000001,
        0.7568640000000001,
        1.85826e+08,
        "Marine Cargo Handling Services",
        0.1136,
        2.45521e+08,
        2.531762e+09,
        3.0862e+08,
        7.7314e+07,
        194,
        10469,
        0.4316983,
        0.41987450000000004,
        3.99702,
        3.50754,
        2.85772,
        32.74648,
        25.05802,
        -1.32626,
        -0.79768,
        10.31179,
        0.22861,
        0.0711606,
        0.0590322,
        0.0872011,
        0.0711606,
        1.265572e+06,
        "Transportation",
        "NZX:POT",
        1.322367e+09,
        5.3219e+07,
        3.202e+08,
        2.45521e+08,
        6.8038598e+08,
        6.8038598e+08,
        "http://www.port-tauranga.co.nz"
      ],
      "s": "NZX:POT"
    },
    {
      "f": [
        40610,
        0.33196,
        0.17944,
        "South Port New Zealand Limited is a commercial deep water port. The Company is primarily engaged in the commercial operation of the Port of Bluff. Its operations are carried out in the Southland region. It provides a range of marine services, cargo and container shipping, and onsite warehousing for domestic and international customers. It offers full container, break bulk and bulk cargo capability, and services a range of primary cargoes, such as import, including alumina, petroleum products, fertilizer, acid, stock food and cement, and export, including timber, logs, dairy and woodchips. Its land-based operating resource is divided into four primary divisions: dairy warehousing, containers, cool and cold storage, and general cargo. It provides pilotage, towage, berthage and marine services to international and coastal vessels, including the southern fishing fleet. It also offers marine plant and equipment, such as Pilot Vessel-Takitimu II, Pilot Ladders, Radio Watches and Bunkering.",
        0.44704,
        1.42126,
        "New Zealand",
        "NZD",
        0.44718,
        30.05956,
        -6.427e+06,
        0.26,
        0.33198,
        0.33198,
        1.57e+07,
        9.814261146496815,
        1.540839e+08,
        null,
        -3.951e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Marine Port Services - NEC",
        0.33196,
        3.6718e+07,
        1.442919e+08,
        9.792e+06,
        8.709e+06,
        95,
        863,
        0.3453619,
        0.3310638,
        6.2,
        4.28802,
        4.0536,
        16.56726,
        12.3032,
        0,
        22.29205,
        3.92973,
        null,
        0.21116569999999998,
        0.17388089999999998,
        0.2527645,
        0.21116569999999998,
        386505.3,
        "Transportation",
        "NZX:SPN",
        5.3019e+07,
        5.651e+06,
        1.07e+07,
        3.6718e+07,
        2.62349e+07,
        2.62349e+07,
        "http://www.southport.co.nz/"
      ],
      "s": "NZX:SPN"
    },
    {
      "f": [
        7.81184e+06,
        0.05228,
        0.96856,
        "PGG Wrightson Limited provides goods and services within the agricultural sector. The Company's segments include Rural Services and Seed \u0026 Grain. The Rural Services segment consists of Retail, which includes the rural supplies and Fruitfed retail operations, AgNZ (Consulting), Agritrade and ancillary sales support, supply chain and marketing functions; Livestock, which includes rural livestock trading activities and export livestock, and Other Rural Services, which includes insurance, real estate, wool, PGG Wrightson Water, AgNZ (Training), regional administration and finance commission. The Seed \u0026 Grain segment includes Australasia Seed (New Zealand and Australian manufacturing and distribution of forage seed and turf), Grain (sale of cereal seed and grain trading), South America (sale of pasture and crop seed and farm inputs, operations in the areas of livestock, real estate and irrigation), and other Seed \u0026 Grain (research and development, production and corporate seeds).",
        0.06731,
        1.42126,
        "New Zealand",
        "NZD",
        1.83532,
        49.2676,
        -2.8602e+07,
        0.0375,
        0.0524,
        0.0524,
        6.9755e+07,
        6.8587943516593795,
        4.784352e+08,
        0.04,
        -2.6316e+07,
        "NZD",
        null,
        0.2765287,
        0.2765287,
        3.26753e+08,
        "Fishing \u0026 Farming - NEC",
        0.05228,
        1.181624e+09,
        3.585532e+08,
        1.19882e+08,
        3.8823e+07,
        2700,
        13393,
        0.0514368,
        0.041147600000000006,
        0.54,
        0.38,
        1.31697,
        9.06489,
        7.32354,
        1.06383,
        13.09524,
        0.30344,
        0.96925,
        0.1053773,
        0.0593791,
        0.1454284,
        0.1053773,
        null,
        "Consumer/Non-Cyclical",
        "NZX:PGW",
        6.87216e+08,
        5.1901099999999994e+08,
        1.3413399999999999e+08,
        1.181624e+09,
        7.54849e+08,
        7.54849e+08,
        "http://pggwrightson.co.nz/"
      ],
      "s": "NZX:PGW"
    },
    {
      "f": [
        590430,
        0.11328,
        0.35451,
        "Opus International Consultants Limited is a multi-disciplinary infrastructure consultancy. The Company offers asset development and management services at all phases of the lifecycle, including concept development, planning, detailed design, procurement, construction, commissioning, operation, maintenance, rehabilitation and upgrading. The Company's geographical segments include New Zealand, United Kingdom, Australia and Canada. It provides consultancy and project management services across a range of disciplines, including civil, mechanical and electrical engineering, land and building surveying, planning, environmental, architectural and property management. The Company offers products and services to the sectors, including building, transport, water, environmental, energy, resources, research and telecommunications. The Company has operations across Australia, Canada, New Zealand, Fiji, the United Kingdom, the Middle East and the United States.",
        0.18236,
        1.42126,
        "New Zealand",
        "NZD",
        2.30829,
        90.19579,
        -1.6408999999999998e+07,
        0.09,
        -0.15431,
        -0.15431,
        3.2424999999999996e+07,
        5.025242868157287,
        1.629435e+08,
        0.04333,
        -1.6479e+07,
        "NZD",
        6.4946e+07,
        0.7303127,
        0.7303127,
        3.64881e+08,
        "Construction \u0026 Engineering - NEC",
        0.11328,
        5.0523e+08,
        1.2909049999999999e+08,
        3.3853e+07,
        1.6748000000000002e+07,
        3000,
        2786,
        -0.0309309,
        -0.0332485,
        1.36,
        0.74,
        1.05287,
        null,
        null,
        -8.51064,
        -28.45694,
        0.26547,
        1.649,
        -0.0937117,
        -0.066738,
        -0.1544349,
        -0.0937117,
        162092.7,
        "Services",
        "NZX:OIC",
        3.0336e+08,
        1.89841e+08,
        1.08952e+08,
        5.0523e+08,
        1.4788494e+08,
        1.4788494e+08,
        "http://www.opus.co.nz/"
      ],
      "s": "NZX:OIC"
    },
    {
      "f": [
        1.36322e+06,
        0.40458,
        0.02764,
        "Sanford Limited is a seafood company, which is engaged in farming, processing and aquaculture business. The Company's segments include wildcatch, which is responsible for catching and processing inshore and deepwater fish species, and aquaculture, which is responsible for farming, harvesting and processing mussels and salmon. The Company's farming business includes Fleet, which operates a fleet of vessels for inshore, purse seine and deepwater fishing, including vessels for freezing and processing at sea. The Company's aquaculture business includes Mussel Farming, Oyster Farming and King Salmon Farming. The Company's Sea food products include Antarctic toothfish Arrow squid, Blue mackerel, Bluff Oyster, Gemfish, Ghost shark, Hake, Hapuku, Hoki, Jack mackerel, John dory, Kahawai, King Salmon, Lemon sole, Ling, Monkfish, Orange roughy, Patagonian toothfish, Red cod, Scampi, Silver warehou, Snapper, Trevally and Yellowbelly flounder.",
        0.57039,
        1.42126,
        "New Zealand",
        "NZD",
        1.56197,
        31.83257,
        -2.1507e+07,
        0.23,
        0.40462,
        0.40462,
        7.675e+07,
        10.488562866449511,
        8.049972e+08,
        0.245,
        -2.9283e+07,
        "NZD",
        null,
        0.24320070000000002,
        0.24320070000000002,
        1.12716e+08,
        "Fishing \u0026 Farming - NEC",
        0.40458,
        4.63469e+08,
        6.310442e+08,
        1.73953e+08,
        3.4744e+07,
        1055,
        null,
        0.13079190000000002,
        0.1158481,
        6.8,
        5.4,
        1.12972,
        16.6576,
        11.83326,
        0.59701,
        20.35714,
        1.36157,
        1.01955,
        0.0565268,
        0.0490067,
        0.070715,
        0.0565268,
        null,
        "Consumer/Non-Cyclical",
        "NZX:SAN",
        7.97836e+08,
        1.41149e+08,
        1.77542e+08,
        4.63469e+08,
        9.34844e+07,
        9.34844e+07,
        "http://www.sanford.co.nz/"
      ],
      "s": "NZX:SAN"
    },
    {
      "f": [
        2.126311e+07,
        0.19342,
        0.80349,
        "Spark New Zealand Limited is a supplier of telecommunications and digital services in New Zealand. The Company operates through three segments: Spark Home, Mobile \u0026 Business; Spark Digital, and Spark Connect. The Spark Home, Mobile \u0026 Business segment provides fixed line, mobile and Internet services to consumers and the small medium business market, and includes Spark Ventures. The Spark Digital segment integrates information technology (IT) and telecommunications services to provide converged information and communications technology (ICT) solutions for clients. The Spark Connect segment includes its network and IT operations, shared business operations and servicing of wholesale and international customers. The Company provides a range of telecommunications, and ICT products and services, including local, national, international and telephone services; data networks, broadband services and Internet television; IT services and procurement; equipment sales, and installation services.",
        0.42656,
        1.42126,
        "New Zealand",
        "NZD",
        0.99387,
        51.95962,
        -4.3e+08,
        0.22,
        0.19342,
        0.19342,
        9.5663e+08,
        7.05372562014572,
        6.74780554e+09,
        0.23916,
        -1.262752e+08,
        "NZD",
        null,
        0.781813,
        0.781813,
        2.734e+09,
        "Integrated Telecommunications Services - NEC",
        0.19342,
        3.345335e+09,
        5.960499e+09,
        7.873065e+08,
        3.7e+08,
        5569,
        40770,
        0.1544181,
        0.14641120000000002,
        3.8192,
        2.89065,
        3.68012,
        16.75102,
        7.63569,
        -2.7027,
        10.7557,
        1.78173,
        0.86983,
        0.1458703,
        0.11485329999999999,
        0.2137493,
        0.1458703,
        600706.6,
        "Services",
        "NZX:SPK",
        3.237e+09,
        6.49e+08,
        8.75e+08,
        3.497e+09,
        1.82979518e+09,
        1.82979518e+09,
        null
      ],
      "s": "NZX:SPK"
    },
    {
      "f": [
        683990,
        0.0038,
        0.56907,
        "Sealegs Corporation Limited is engaged in the manufacturing of amphibious marine craft. The Company offers a range of product categories, such as Sealegs Craft, original equipment manufacturer (OEM) hulls fitted with Sealegs technologies and amphibious enablement kits. The Company's amphibious enablement system is a product, which allows boat builders to make amphibious versions of their craft. Its SLG-100 amphibious enablement system gives the operational capability of amphibious interdiction on coast lines. Its System 60 includes all-wheel drive (AWD), power steering, automatic braking system (ABS) and xtended run time (XRT). Its System 60 parts include wheels and tires, legs brackets, electrical wiring loom and hydraulic tank. The Company's subsidiaries include Sealegs International Limited and Sealegs (US) Corporation. Sealegs International Limited manufactures amphibious marine craft. Sealegs (US) Corporation imports amphibious marine craft.",
        0.00674,
        1.42126,
        "New Zealand",
        "NZD",
        2.51215,
        0,
        null,
        null,
        0.00374,
        0.00374,
        931910,
        11.263222843407625,
        1.049631e+07,
        null,
        186940,
        "NZD",
        null,
        0.3055463,
        0.3055463,
        5.29958e+06,
        "Shipbuilding - NEC",
        0.0038,
        1.856435e+07,
        1.228364e+07,
        -1.78733e+06,
        507580.00000000006,
        null,
        1597,
        0.0320571,
        0.0292104,
        0.13,
        0.07,
        1.40649,
        24.59893,
        18.80388,
        0,
        -16.36364,
        0.69811,
        0.98295,
        0.0618253,
        0.0436155,
        0.0618253,
        0.0618253,
        null,
        "Consumer Cyclical",
        "NZX:SLG",
        1.224172e+07,
        8.81314e+06,
        0,
        1.856435e+07,
        1.335178e+08,
        1.335178e+08,
        "http://www.sealegs.com"
      ],
      "s": "NZX:SLG"
    },
    {
      "f": [
        2.69374e+06,
        0.22768,
        0.70527,
        "Synlait Milk Limited is a dairy processing company. The Company is engaged in manufacturing of nutritional solutions, value added products and specialty ingredients. It manufactures and sells milk powder and milk powder-related products. It manufactures specialized milk powders for infant formula manufacture and base pediatric powders for blending into finished infant formula, and finished infant formula products. Its products include infant and adult nutritional formulations, functional food ingredients and specialized products. The infant nutritional powder is a nutritional product. The ingredient products include whole milk powder, skim milk powder and anhydrous milk fat. The specialty product is synlait lactoferrin. The Company has 140,000 metric tons of annual production capacity and packages upto 30,000 metric tons of canned infant formula. It exports its products around the world to Asia, Middle East and Africa and other regions. Its subsidiary is Synlait Milk Finance Limited.",
        0.37791,
        1.42126,
        "New Zealand",
        "NZD",
        1.24291,
        83.88549,
        null,
        null,
        0.22768,
        0.22768,
        8.489e+07,
        8.822683472729414,
        7.489576e+08,
        0,
        6.4218e+07,
        "NZD",
        null,
        0.1828455,
        0.1828455,
        9.9992e+07,
        "Dairy Products",
        0.22768,
        5.46866e+08,
        5.3554859999999994e+08,
        2.13409e+08,
        3.4383e+07,
        150,
        null,
        0.11163980000000001,
        0.0884933,
        3.74949,
        2.42215,
        1.75836,
        13.13247,
        9.38407,
        -2.60586,
        6.78551,
        0.97931,
        0.63018,
        0.0809176,
        0.0587624,
        0.16041,
        0.0809176,
        null,
        "Consumer/Non-Cyclical",
        "NZX:SML",
        5.90456e+08,
        1.49874e+08,
        2.15454e+08,
        5.46866e+08,
        1.510446e+08,
        1.510446e+08,
        "http://www.synlait.com/"
      ],
      "s": "NZX:SML"
    },
    {
      "f": [
        6.11182e+06,
        0.21367,
        0.51368,
        "Tourism Holdings Limited is engaged in the manufacture, rental and sale of motorhomes and other tourism related activities. The principal activity of the Company includes motorhome rental, attractions and travel applications. Its segments include New Zealand Rentals, Tourism Group, Australia Rentals, United States Rentals and Other. The New Zealand Rentals segment includes rental of Maui, Britz and Mighty motorhomes, and the sale of motorhomes sold under the RV Super Centre retail brand. The Tourism Group segment includes Kiwi Experience and the Waitomo Caves Group experiences. The Australia Rentals segment includes rental of Maui, Britz and Mighty motorhomes and four wheel drive (4WD) vehicles, and the sale of motorhomes sold under the RV Sales Centre retail brand. The United States Rentals segment includes rental and sale of Road Bear and Britz recreational vehicles (RVs). The Other segment includes Mighway and Geozone. Its subsidiaries include JJ Motorcars Inc. and THL Oz Pty Ltd.",
        0.49862,
        1.42126,
        "New Zealand",
        "NZD",
        0.82718,
        47.65487,
        -1.9439e+07,
        0.19,
        0.21367,
        0.20521,
        7.3599e+07,
        6.404471528145763,
        4.713627e+08,
        0.22,
        -1.7525e+07,
        "NZD",
        null,
        0.7159139,
        0.7159139,
        1.99692e+08,
        "Passenger Car rental",
        0.20511,
        2.78933e+08,
        3.923577e+08,
        7.9005e+07,
        2.4376e+07,
        637,
        5158,
        0.1388039,
        0.1307447,
        3.44,
        2.11,
        2.2787,
        16.51966,
        6.62118,
        1.19403,
        57.67442,
        1.40664,
        0.48958,
        0.09269970000000001,
        0.0747597,
        0.1414553,
        0.09269970000000001,
        null,
        "Services",
        "NZX:THL",
        3.33835e+08,
        5.3296e+07,
        8.2025e+07,
        2.78933e+08,
        1.15698e+08,
        1.15698e+08,
        "http://www.thlonline.com"
      ],
      "s": "NZX:THL"
    },
    {
      "f": [
        974010,
        0.24702,
        1.63929,
        "Turners Limited is engaged in providing financial services (loans, insurance products and credit collection services), and auctions and fleet-remarketing (motor vehicles, trucks, heavy machinery and commercial goods) and purchasing goods for sale (motor vehicles and commercial goods) and related asset-based finance to consumers. The Company's segments include Auctions \u0026 Fleet, which is engaged in remarketing (motor vehicles, trucks, heavy machinery and commercial goods) and purchasing goods for sale (motor vehicles and commercial goods) and related asset-based finance to consumers; Collection services, which provides collection services, credit management and debt recovery services to the corporate and small and medium-sized enterprise (SME) sectors in New Zealand and Australia; Finance, which provides asset-based secured finance to consumers and SME's; Insurance, which markets and administrates a range of life and consumer insurance and superannuation products, and Corporate \u0026 other.",
        0.27446,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        131.4087,
        -7.596e+06,
        0.1104,
        0.263,
        0.25267,
        3.87e+07,
        10.862968992248062,
        4.203969e+08,
        0.145,
        662000,
        "NZD",
        null,
        null,
        null,
        null,
        "Life Insurance",
        0.2413,
        1.70448e+08,
        2.593419e+08,
        1.61055e+08,
        1.5602e+07,
        null,
        4176,
        0.1137442,
        0.1137442,
        3.63,
        2.7,
        1.45877,
        13.77291,
        13.63809,
        -1.13636,
        16,
        1.2796,
        null,
        null,
        0.043013199999999994,
        0.1204412,
        null,
        null,
        "Financial",
        "NZX:TNRHB",
        4.26085e+08,
        null,
        1.98849e+08,
        1.70448e+08,
        6.343164e+07,
        6.343164e+07,
        "http://www.turnerslimited.co.nz/"
      ],
      "s": "NZX:TNRHB"
    },
    {
      "f": [
        253830,
        0.106,
        -0.02904,
        "Smiths City Group Limited is a holding company. The Company has two principal activities: Retail Trading, which is engaged in the retailing of consumer electronic products, kitchen appliances, home heating solutions, home furnishings and sporting goods through the Smiths City brand, and Finance, which is engaged in the provision of finance by Smiths City Finance Limited to support the retailing operation. The Company operates through three segments: retail, the financing of retail sales and property. The Company consists of approximately 30 Smiths City-branded stores throughout New Zealand, approximately four clearance centers and has a Furniture City, which has approximately three sites in the Auckland/Northland region. It represents a range of brands in-store and online, including Sleepyhead, Fisher \u0026 Paykel, and Cavalier Bremworth, along with international brands, such as La-Z-Boy, John Young Furnishings, Ashley, Samsung, Panasonic, Hewlett Packard, Mitsubishi Electric and Bosch.",
        0.13629,
        1.42126,
        "New Zealand",
        "NZD",
        3.68015,
        106.6414,
        -1.8e+06,
        0.028,
        0.10597,
        0.10597,
        5.6e+06,
        15.0681625,
        8.438171e+07,
        null,
        6.5e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Other Specialty Retailers - NEC",
        0.106,
        2.219e+08,
        3.688171e+07,
        4.75e+07,
        5.6e+06,
        700,
        null,
        0.0139703,
        0.0139703,
        0.79,
        0.5,
        0.69984,
        6.60564,
        5.12246,
        0,
        34.61538,
        0.16621,
        2.19485,
        0.0496014,
        0.0391882,
        0.1096964,
        0.0496014,
        null,
        "Services",
        "NZX:SCY",
        1.361e+08,
        1.001e+08,
        5.62e+07,
        2.219e+08,
        5.268815e+07,
        5.268815e+07,
        "http://www.smithscitygroup.co.nz/"
      ],
      "s": "NZX:SCY"
    },
    {
      "f": [
        266250,
        -0.04618,
        0.81049,
        "TeamTalk Limited is a telecommunications company. The Company is involved in the provision of mobile radio networks, broadband services and Internet services provider (ISP) services in New Zealand. The Company operates through three segments: Wireless Networks, Wired Networks and ISP. The Wireless Networks segment includes the mobile radio business of the Company along with associated finance leasing, data and global positioning system tracking products, and the wireless broadband business of the Company. The Wired Networks segment includes the wired broadband business of CityLink Limited, a subsidiary of the Company, which provides broadband connectivity and ancillary related services to a range of wholesale customers and end users. The ISP segment includes the BayCity Communications Limited, a subsidiary of the Company, which provides ISP and related telecommunications services primarily to rural residential customers. Mobile Radio comprises KorKor, RTmax, FleetLink and ActionNet.",
        0.37132,
        1.42126,
        "New Zealand",
        "NZD",
        0.68608,
        166.6881,
        -2.284e+06,
        0.04706,
        -0.04617,
        -0.04617,
        1.3641e+07,
        3.367058866652005,
        4.593005e+07,
        null,
        1.912e+06,
        "NZD",
        1.9796e+07,
        0.32405970000000006,
        0.32405970000000006,
        1.9504e+07,
        "Wireless Telecommunications Services - NEC",
        -0.04618,
        5.7295e+07,
        1.276605e+07,
        3.3164e+07,
        -1.31e+06,
        null,
        null,
        0.0139105,
        -0.024958499999999998,
        0.79,
        0.38,
        0.6317,
        null,
        1.21189,
        5.88235,
        -32.83582,
        0.22281,
        0.57135,
        -0.0224369,
        -0.0178528,
        -0.0595292,
        -0.0224369,
        null,
        "Services",
        "NZX:TTK",
        7.0624e+07,
        1.065e+07,
        3.3686e+07,
        5.7295e+07,
        2.836899e+07,
        2.836899e+07,
        "http://www.teamtalk.co.nz/"
      ],
      "s": "NZX:TTK"
    },
    {
      "f": [
        5.8665559e+08,
        0.3223712297553728,
        0.67764,
        "Telstra Corporation Limited (Telstra) is a telecommunications and technology company. Its principal activity is to provide telecommunications and information services for domestic and international customers. The Company operates through four segments. The Telstra Retail segment provides telecommunication products, services and solutions across mobiles, fixed and mobile broadband, telephony and Pay television/Internet Protocol television and digital content. The Global Enterprise and Services segment provides sales and contract management for business and government customers. The Telstra Operations segment offers overall planning, design, engineering and architecture and construction of Telstra networks, technology and information technology solution. The Telstra Wholesale segment provides a range of telecommunication products and services delivered over Telstra networks and associated support systems to other carriers, carriage service providers and Internet service providers.",
        0.72487,
        1.35962,
        "Australia",
        "AUD",
        1.01654,
        109.0164,
        -3.787e+09,
        0.32405422103234727,
        0.30848,
        0.30749,
        9.311e+09,
        7.775161636773708,
        7.567662266500934e+10,
        0.3303262382136185,
        6.272017181271237e+07,
        "NZD",
        null,
        0.7203118000000001,
        0.7203118000000001,
        1.8664e+10,
        "Integrated Telecommunications Services - NEC",
        0.30804,
        2.5911e+10,
        6.130115928553566e+10,
        1.3752e+10,
        5.78e+09,
        33482,
        1394146,
        0.1995678,
        0.2161244,
        5.86,
        4.7,
        3.78224,
        15.968,
        7.34225,
        -1.60321,
        -9.74265,
        2.26323,
        0.95592,
        0.11617229999999999,
        0.0915312,
        0.2510843,
        0.11617229999999999,
        773878.5,
        "Services",
        "NZX:TLS",
        4.3286e+10,
        9.34e+09,
        1.7302e+10,
        2.5911e+10,
        1.222565584e+10,
        1.222565584e+10,
        "https://www.telstra.com.au"
      ],
      "s": "NZX:TLS"
    },
    {
      "f": [
        2.16539e+06,
        0.15,
        0.0121,
        "Trilogy International Limited is a manufacturer and wholesaler of products in the home fragrance, body care and natural skincare categories. The Company is a distributer of personal fragrance and beauty products. Its segments include Home Fragrance, Bodycare (the Ecoya brand), Natural Products (the Trilogy and Goodness brands) and Distribution (CS\u0026Co Company). Its Home Fragrance \u0026 Bodycare segment offers products, including Soy-based home fragrance (candles, diffusers, bodycare). The Natural Products segment offers products, including natural and organic rosehip oil-based and organic chia seed oil skincare range. The Distribution segment is engaged in the third party premium beauty products distribution. The Company provides natural skin care and home fragrance products through the brands, including Trilogy, Goodness and Ecoya in New Zealand and around the world. Its subsidiary, CS\u0026Co, distributes international cosmetics, fragrances, skincare and haircare brands in New Zealand.",
        0.157,
        1.42126,
        "New Zealand",
        "NZD",
        2.30813,
        30.23523,
        -2.323e+06,
        0.05451,
        0.15119,
        0.15119,
        1.7217e+07,
        13.977260846837428,
        2.406465e+08,
        0.114,
        1.813e+06,
        "NZD",
        4.706e+07,
        0.5112595,
        0.5112595,
        4.4776e+07,
        "Personal Products - NEC",
        0.15,
        8.3128e+07,
        2.099135e+08,
        3.0733e+07,
        9.409e+06,
        15,
        null,
        0.1592375,
        0.1333018,
        5,
        2.54,
        2.9718,
        19.18116,
        20.25019,
        -7.05128,
        13.72549,
        2.06691,
        1.08596,
        0.1175603,
        0.0935278,
        0.19538360000000002,
        0.1175603,
        null,
        "Consumer/Non-Cyclical",
        "NZX:TIL",
        1.14233e+08,
        4.5918e+07,
        2.135e+07,
        8.3128e+07,
        7.236139e+07,
        7.236139e+07,
        "http://ecoya.com/"
      ],
      "s": "NZX:TIL"
    },
    {
      "f": [
        974010,
        0.24702,
        1.63929,
        "Turners Limited is engaged in providing financial services (loans, insurance products and credit collection services), and auctions and fleet-remarketing (motor vehicles, trucks, heavy machinery and commercial goods) and purchasing goods for sale (motor vehicles and commercial goods) and related asset-based finance to consumers. The Company's segments include Auctions \u0026 Fleet, which is engaged in remarketing (motor vehicles, trucks, heavy machinery and commercial goods) and purchasing goods for sale (motor vehicles and commercial goods) and related asset-based finance to consumers; Collection services, which provides collection services, credit management and debt recovery services to the corporate and small and medium-sized enterprise (SME) sectors in New Zealand and Australia; Finance, which provides asset-based secured finance to consumers and SME's; Insurance, which markets and administrates a range of life and consumer insurance and superannuation products, and Corporate \u0026 other.",
        0.27446,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        131.4087,
        -7.596e+06,
        0.1104,
        0.263,
        0.25267,
        3.87e+07,
        10.862968992248062,
        4.203969e+08,
        0.145,
        662000,
        "NZD",
        null,
        null,
        null,
        null,
        "Life Insurance",
        0.2413,
        1.70448e+08,
        2.593419e+08,
        1.61055e+08,
        1.5602e+07,
        null,
        4176,
        0.1137442,
        0.1137442,
        3.63,
        2.7,
        1.45877,
        13.77291,
        13.63809,
        -1.13636,
        16,
        1.2796,
        null,
        null,
        0.043013199999999994,
        0.1204412,
        null,
        null,
        "Financial",
        "NZX:TNR",
        4.26085e+08,
        null,
        1.98849e+08,
        1.70448e+08,
        6.343164e+07,
        6.343164e+07,
        "http://www.turnerslimited.co.nz/"
      ],
      "s": "NZX:TNR"
    },
    {
      "f": [
        2.11704e+06,
        0.07194,
        null,
        "Vista Group International Limited is a New Zealand-based company, engaged in the sale, support and associated development of software for the film industry. The Company's segment operates through single vertical film/cinema market. It consists of seven businesses, including Vista Entertainment Solutions (VES), Veezi, BookMyShow, MACCS, Movio, Numero and Share Dimension. VES offers software suite for cinema management. Veezi offers cinema management software, which is a cloud-based Software as a Service (SaaS) product for the small circuit market. BookMyShow is a cinema ticketing Website operated in New Zealand. MACCS International designs and develops film distribution software. Movio is also a SaaS solution providing marketing data analysis and a campaign management platform for cinema exhibitors and distributors. Numero provides an aggregated box office reporting platform. Share Dimension specializes in business intelligence and predictive analytics software for the cinema industry.",
        0.10113,
        1.42126,
        "New Zealand",
        "NZD",
        1.9836,
        6.42644,
        0,
        null,
        0.07479,
        0.07436,
        1.4199e+07,
        29.519698570321854,
        4.191502e+08,
        0.04467,
        2.864e+06,
        "NZD",
        4.905e+07,
        null,
        null,
        null,
        "Software - NEC",
        0.0715,
        6.5431e+07,
        4.416582e+08,
        -2.2508e+07,
        5.753e+06,
        350,
        null,
        0.1435344,
        0.1484402,
        6.91,
        4.25,
        6.0219,
        73.9645,
        null,
        -5.17241,
        -5.17241,
        5.59862,
        null,
        0.0981088,
        0.06876929999999999,
        0.1008694,
        0.0981088,
        null,
        "Technology",
        "NZX:VGL",
        1.1776e+08,
        5.5277e+07,
        4.694e+06,
        6.5431e+07,
        7.9973e+07,
        7.9973e+07,
        "http://www.vistagroup.co.nz/"
      ],
      "s": "NZX:VGL"
    },
    {
      "f": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        0,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "NZD",
        null,
        null,
        null,
        -1.447502e+07,
        null,
        null,
        null,
        null,
        null,
        1.439435e+07,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "NZX:WKSHA",
        3.5188378e+08,
        1.5188378e+08,
        1.5e+08,
        3.454099e+07,
        100,
        100,
        null
      ],
      "s": "NZX:WKSHA"
    },
    {
      "f": [
        2.39452e+06,
        -0.01287,
        0.00551,
        "Wellington Drive Technologies Limited develops, manufactures, markets and sells energy saving, electronically commutated (EC) motors, controllers and fans. The Company operates in the segment of marketing, selling, manufacturing and developing electric motors and associated electronics and software. Its offers EC Refrigeration Fan Motors, Refrigeration Fan Assemblies, Fractional Horsepower Ventilation Fan Motors and AirMoVent Shaded Pole Q-motors. The Smart Control Solutions (SCS) range is a family of electronic thermostats and energy management devices (EMDs) for commercial refrigeration systems. It offers a range of axial, centrifugal and cross flow fan assemblies, featuring ECR motors. The Company offers Q frame shaded pole fan motors under its AirMoVent brand. Its SCS Connect System is a cloud-based fleet management system for point of sale refrigeration equipment. Its SCS Connect System includes tools for asset tracking, fleet deployment, monitoring and maintenance.",
        -0.01102,
        1.42126,
        "New Zealand",
        "NZD",
        0.86407,
        135.8486,
        null,
        null,
        -0.01302,
        -0.01302,
        -1.37e+06,
        -28.06621167883212,
        3.845071e+07,
        null,
        -1.372e+06,
        "NZD",
        null,
        0.2235354,
        0.2235354,
        5.261e+06,
        "Portable Motors \u0026 Generators",
        -0.01287,
        2.4572e+07,
        3.614271e+07,
        2.308e+06,
        -2.78e+06,
        null,
        null,
        -0.0772391,
        -0.1111111,
        0.175,
        0.055,
        10.1993,
        null,
        null,
        -2.5,
        90.2439,
        1.21693,
        0.62474,
        -0.3971329,
        -0.1562813,
        -0.5585736,
        -0.3971329,
        null,
        "Technology",
        "NZX:WDT",
        2.0733e+07,
        1.429e+07,
        5.635e+06,
        2.4572e+07,
        2.7119683e+08,
        2.7119683e+08,
        "http://www.wdtl.com/"
      ],
      "s": "NZX:WDT"
    },
    {
      "f": [
        1.209106e+07,
        0.611,
        1.03842,
        "Ryman Healthcare Limited develops, owns and operates integrated retirement villages, resthomes and hospitals for the elderly people. The Company offers various living and care options, including independent living, assisted living, resthome, hospital and dementia. The independent townhouses and apartments are occupied by residents wishing to retain a level of independence. The Company's Assisted Living offers a range of services, including meals, housekeeping services, morning and afternoon tea, shopping trips and the resort style facilities offered by the village. Resthome and Hospital level care in its Village offers residents in clinical care. The Company offers a specialized care unit for residents. The Company's Villages include residents requiring short-term care, respite care and day care. The Company also offers Day Care program for those just needing assistance during the day. The Company operates in New Zealand with various operations in Australia.",
        0.63632,
        1.42126,
        "New Zealand",
        "NZD",
        null,
        48.09734,
        -7.3e+07,
        0.1342,
        0.72007,
        0.72007,
        6.0906e+07,
        75.45854267231472,
        4.595878e+09,
        0.1822,
        1.09889e+08,
        "NZD",
        null,
        null,
        null,
        null,
        "Healthcare Facilities \u0026 Services - NEC",
        0.611,
        2.6107e+08,
        4.05e+09,
        5.45878e+08,
        3.05423e+08,
        1400,
        null,
        0.1739247,
        1.349563,
        9.86,
        7.78,
        2.75795,
        11.24891,
        10.85067,
        -4.25532,
        -2.99401,
        14.82843,
        null,
        0.1762912,
        0.0896782,
        0.2711092,
        0.1762912,
        null,
        "Healthcare",
        "NZX:RYM",
        4.423404e+09,
        null,
        7.03475e+08,
        2.6107e+08,
        4.9799963e+08,
        4.9799963e+08,
        "http://www.rymanhealthcare.co.nz/"
      ],
      "s": "NZX:RYM"
    },
    {
      "f": [
        53930,
        0.28535,
        0.20045,
        "Seeka Ltd, formerly Seeka Kiwifruit Industries Limited (Seeka) is a New Zealand-based integrated orcharding, post harvest, supply and retail services company. The Company operates through five segments: Orchard operations, Post harvest operations, Retail service operations, All other segments - New Zealand and Australian operations. The Orchard operations segment provides on-orchard management services to orchard owners producing kiwifruit, avocado and kiwiberry crops. The Post harvest operations segment provides post harvest services to the kiwifruit, avocado and kiwiberry industries. The Retail service operations segment provides fruit marketing services in New Zealand and internationally, particularly in the Australian and Asian markets. The Australian operations segment owns and operates Australian orchards; provides post harvest operations, and markets the produce from those orchards, primarily in Australia. In New Zealand, the Company also provides retail and ripening services.",
        0.66907,
        1.42126,
        "New Zealand",
        "NZD",
        1.31297,
        102.0677,
        -2.519e+06,
        0.19,
        0.49,
        0.46,
        5.018e+06,
        26.66276006377043,
        1.3379373000000001e+08,
        null,
        -1.7108e+07,
        "NZD",
        null,
        0.09412290000000001,
        0.09412290000000001,
        1.9538e+07,
        "Vegetable, Fruit \u0026 Nut Farming",
        0.27281,
        1.42112e+08,
        8.118273e+07,
        5.2611e+07,
        4.272e+06,
        163,
        null,
        0.0764323,
        0.059895300000000005,
        4.85,
        3.34431,
        0.97196,
        10.1087,
        5.71106,
        3.56347,
        38.21931,
        0.47305,
        0.9842,
        0.059972399999999995,
        0.043188199999999996,
        0.106773,
        0.059972399999999995,
        null,
        "Consumer/Non-Cyclical",
        "NZX:SEK",
        2.14047e+08,
        7.4477e+07,
        7.972e+07,
        1.42112e+08,
        1.632573e+07,
        1.632573e+07,
        "http://www.seeka.co.nz/"
      ],
      "s": "NZX:SEK"
    },
    {
      "f": [
        1.55505e+06,
        -0.00388,
        1.51435,
        "SLI Systems Limited (SLI) provides site search and navigation technologies to connect site visitors with products on e-commerce Websites. The Company is engaged in providing Website search services in New Zealand, the United States, Australia, the United Kingdom, Brazil and Japan. Its solutions include SLI buyer engine, learning search, rich auto complete, learning navigation, learning recommendations, dynamic product banners, mobile, merchandising and search engine optimization. It serves various industry sectors, including business-to-business, apparel, automotive, beauty, food and beverage, furniture, home and garden, jewelry, content sites and party supplies, among others. Its technology and services include analytics, infrastructure, compliance, uptime, e-commerce platform plugins, learning search connect for magento, learning search connect for systems applications and products hybris, implementation, after project initiation implementation and expert commerce services.",
        0.00341,
        1.42126,
        "New Zealand",
        "NZD",
        1.42514,
        0,
        null,
        null,
        -0.00366,
        -0.00366,
        248000,
        80.67399193548387,
        2.000715e+07,
        0,
        645000,
        "NZD",
        null,
        null,
        null,
        null,
        "Internet Services - NEC",
        -0.00388,
        3.5006e+07,
        2.677215e+07,
        -6.765e+06,
        -239000,
        null,
        1596,
        -0.0057418999999999994,
        -0.0046278000000000005,
        1.17,
        0.37,
        4.62786,
        null,
        127.4864,
        -8.51064,
        -40.27778,
        0.76479,
        null,
        -0.044390799999999994,
        -0.016325700000000002,
        -0.0446854,
        -0.044390799999999994,
        null,
        "Technology",
        "NZX:SLI",
        1.4697e+07,
        1.2641e+07,
        0,
        3.5006e+07,
        6.226082e+07,
        6.226082e+07,
        null
      ],
      "s": "NZX:SLI"
    },
    {
      "f": [
        501040.00000000006,
        0.00013,
        8.87751,
        "TRS Investments Ltd is a New Zealand-based investment company. The ultimate controlling party of the Company is Beconwood Securities Pty Ltd.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.52347,
        null,
        null,
        null,
        0.00011,
        0.00011,
        110000,
        10.306454545454546,
        1.13371e+06,
        null,
        -46000,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        0.00013,
        215000,
        1.21271e+06,
        -79000,
        144000,
        null,
        null,
        0.38062280000000004,
        0.38062280000000004,
        0.004,
        0.001,
        null,
        9.09091,
        null,
        -50,
        0,
        4.19623,
        null,
        null,
        0.8661417,
        null,
        null,
        null,
        "Financial",
        "NZX:TRS",
        145000,
        145000,
        160000,
        215000,
        1.21271048e+09,
        1.21271048e+09,
        null
      ],
      "s": "NZX:TRS"
    },
    {
      "f": [
        4.40407e+06,
        -0.33157,
        null,
        "Wynyard Group Limited is a New Zealand-based company that owns, develops, markets and sells software products and services that protect companies and countries from global threats, crime and corruption. The Company's geographical segments include Asia Pacific; Europe, Middle East and Africa, and Americas. The Company offers products, including Investigations Case Management (ICM), which offers features, such as user security, agency defined review process and alerting; Advanced Crime Analytics (ACA), which offers features, such as context aware visualization and geospatial analysis, and Advanced Cyber Threat Analytics (ACTA), which is a cyber-forensics solution. Its products offer solutions, including operational risk, threat assessment, regulatory compliance, information security, fraud analytics, anti-money laundering and crime investigations. The Company sells its products within the financial services, government and critical national infrastructure sectors.",
        -0.23134,
        1.42126,
        "New Zealand",
        "NZD",
        1.86265,
        0,
        null,
        null,
        -0.40875,
        -0.40875,
        -4.4561e+07,
        -0.5297008594959718,
        2.3604e+07,
        null,
        -5.144e+07,
        "NZD",
        null,
        null,
        null,
        -1.1717e+07,
        "Enterprise Software",
        -0.33157,
        2.4662e+07,
        3.8523e+07,
        -1.4919e+07,
        -4.4055e+07,
        297,
        null,
        -2.513746,
        -2.516127,
        1.90164,
        0.17,
        0.63395,
        null,
        null,
        0,
        -88.273,
        1.52827,
        null,
        -0.8325127000000001,
        -0.6959527,
        -0.8387688,
        -0.8325127000000001,
        84872.05,
        "Technology",
        "NZX:WYN",
        7.3834e+07,
        2.376e+07,
        0,
        2.4662e+07,
        1.7816677e+08,
        1.7816677e+08,
        null
      ],
      "s": "NZX:WYN"
    },
    {
      "f": [
        8.124330000000001e+06,
        0.27935,
        0.4765,
        "Stride Property Limited, formerly DNZ Property Fund Limited, is a New Zealand-based company, which is principally involved in the ownership and management of investment properties in New Zealand. The Company holds interests in approximately 60 properties with over 420 tenants. The Company's properties have a net lettable area of approximately 432,340 square meters. The Company's properties include office, industrial, retail, large format retail and land. Its properties are located in Auckland, Wellington, Rotorua, Morrinsville, Upper Hutt, Lower Hutt, Blenheim, Kaiapoi, Christchurch, Queenstown and Invercargill. The Company's development projects include NorthWest Shopping Centre, which is located at the Westgate Town Centre in North West Auckland; NorthWest Two, and Johnsonville Shopping Centre. NorthWest Shopping Centre is a stage of a development at the Westgate Town Centre, with approximately 40,000 square meters of retail, office and commercial facilities under construction.",
        0.27932,
        1.42126,
        "New Zealand",
        "NZD",
        1.96308,
        57.0736,
        -3.4913e+07,
        0.1075,
        0.23549,
        0.23508,
        6.586499999999999e+07,
        17.677253473012982,
        1.1643123e+09,
        0.1,
        -3.72321e+08,
        "NZD",
        null,
        0.9185047000000001,
        0.9185047000000001,
        6.9254e+07,
        "Commercial REITs - NEC",
        0.27893,
        7.3942e+07,
        6.377983e+08,
        5.26514e+08,
        9.2406e+07,
        14,
        null,
        0.4839714,
        1.139492,
        2.0956,
        1.75,
        1.07959,
        7.44427,
        7.41773,
        -2.23464,
        -2.7,
        7.66631,
        0.36531,
        0.09089330000000001,
        0.0884348,
        0.1507732,
        0.09089330000000001,
        null,
        "Capital Goods",
        "NZX:SPG",
        9.70427e+08,
        3.7589e+07,
        3.3718e+08,
        7.3942e+07,
        3.64457e+08,
        3.64457e+08,
        "http://www.strideproperty.co.nz/"
      ],
      "s": "NZX:SPG"
    },
    {
      "f": [
        2.39452e+06,
        -0.01287,
        0.00551,
        "Wellington Drive Technologies Limited develops, manufactures, markets and sells energy saving, electronically commutated (EC) motors, controllers and fans. The Company operates in the segment of marketing, selling, manufacturing and developing electric motors and associated electronics and software. Its offers EC Refrigeration Fan Motors, Refrigeration Fan Assemblies, Fractional Horsepower Ventilation Fan Motors and AirMoVent Shaded Pole Q-motors. The Smart Control Solutions (SCS) range is a family of electronic thermostats and energy management devices (EMDs) for commercial refrigeration systems. It offers a range of axial, centrifugal and cross flow fan assemblies, featuring ECR motors. The Company offers Q frame shaded pole fan motors under its AirMoVent brand. Its SCS Connect System is a cloud-based fleet management system for point of sale refrigeration equipment. Its SCS Connect System includes tools for asset tracking, fleet deployment, monitoring and maintenance.",
        -0.01102,
        1.42126,
        "New Zealand",
        "NZD",
        0.86407,
        135.8486,
        null,
        null,
        -0.01302,
        -0.01302,
        -1.37e+06,
        -28.06621167883212,
        3.845071e+07,
        null,
        -1.372e+06,
        "NZD",
        null,
        0.2235354,
        0.2235354,
        5.261e+06,
        "Portable Motors \u0026 Generators",
        -0.01287,
        2.4572e+07,
        3.614271e+07,
        2.308e+06,
        -2.78e+06,
        null,
        null,
        -0.0772391,
        -0.1111111,
        0.175,
        0.055,
        10.1993,
        null,
        null,
        -2.5,
        90.2439,
        1.21693,
        0.62474,
        -0.3971329,
        -0.1562813,
        -0.5585736,
        -0.3971329,
        null,
        "Technology",
        "NZX:WDTPA",
        2.0733e+07,
        1.429e+07,
        5.635e+06,
        2.4572e+07,
        2.7119683e+08,
        2.7119683e+08,
        "http://www.wdtl.com/"
      ],
      "s": "NZX:WDTPA"
    },
    {
      "f": [
        2.143361e+07,
        0.18054,
        0.56634,
        "Trade Me Group Limited provides online marketplaces that connect people to undertake a transaction or form a relationship. The Company's businesses include providing a new and used goods marketplace, classified advertising for motor vehicles, real estate and employment, online advertising services and other ancillary online businesses. Its segments include General Items, Classifieds and Other. The General Items segment is its online marketplace business. The Classifieds segment represents advertising revenue from each of its three classified advertising sites: Motors, Property and Jobs. Its revenue is generated from basic and premium listing fees. The Other segment reflects all other businesses, including advertising, travel, dating, life and health insurance comparison and general insurance.",
        0.226,
        1.42126,
        "New Zealand",
        "NZD",
        1.5412,
        19.39245,
        -7.3629e+07,
        0.168,
        0.18055,
        0.18055,
        1.359591e+08,
        14.408881641611337,
        1.95901858e+09,
        0.17618,
        2.289216e+07,
        "NZD",
        null,
        0.9374085999999999,
        0.9374085999999999,
        2.04401e+08,
        "Internet Services - NEC",
        0.18054,
        2.085922e+08,
        1.861691e+09,
        9.732754e+07,
        7.4943e+07,
        295,
        null,
        0.5208003999999999,
        0.4953244,
        5.7,
        3.52,
        2.77897,
        25.97556,
        20.74504,
        0.64378,
        23.7467,
        8.92502,
        null,
        0.0881512,
        0.0852378,
        0.1077249,
        0.0881512,
        null,
        "Services",
        "NZX:TME",
        8.69233e+08,
        4.8121e+07,
        1.35853e+08,
        2.18049e+08,
        3.97093e+08,
        3.97093e+08,
        "http://www.trademe.co.nz/"
      ],
      "s": "NZX:TME"
    },
    {
      "f": [
        2.0485799999999998e+06,
        -0.60445,
        1.85358,
        "Xero Limited is a software as a service (SaaS) company. The Company is engaged in the provision of a platform for online accounting and business services to small businesses and their advisors. The Company operates through two operating segments: Australia and New Zealand (ANZ), and International. The Company's small business cloud accounting software, Xero, is provided in Australia, New Zealand and the United Kingdom. Xero integrates with over 400 add-on applications allowing people to customize Xero to their needs. Xero includes various features, which include cash flow, invoicing, payments, pay runs, reports, contacts, security, support and mobile. Through its various features, Xero offers online accounting, automatic bank reconciliation, quotes and online training for small businesses. Xero allows access to real-time account information and business tools from any device.",
        -0.39083,
        1.42126,
        "New Zealand",
        "NZD",
        3.17407,
        0,
        null,
        null,
        -0.59529,
        -0.59529,
        -5.0522e+07,
        -43.86483116266181,
        2.216139e+09,
        0,
        -8.7268e+07,
        "NZD",
        5.352e+06,
        0.7644556,
        0.7644556,
        1.57179e+08,
        "Enterprise Software",
        -0.60445,
        2.0706e+08,
        2.400163e+09,
        -1.84024e+08,
        -8.2464e+07,
        602,
        16255,
        -0.3445234,
        -0.32246270000000005,
        20.41,
        13.3,
        9.81018,
        null,
        null,
        0.28736,
        -1.96629,
        9.54556,
        null,
        -0.2887709,
        -0.2490081,
        -0.29343009999999997,
        -0.2887709,
        417679.4,
        "Technology",
        "NZX:XRO",
        2.9936e+08,
        1.68632e+08,
        0,
        2.0706e+08,
        1.36375e+08,
        1.36375e+08,
        "http://www.xero.com/nz/"
      ],
      "s": "NZX:XRO"
    },
    {
      "f": [
        3.43698e+06,
        0.05624,
        0.18832,
        "Vector Limited is a New Zealand-based company, which distributes electricity and gas. The Company's segments include Regulated Networks, Gas Trading and Technology. The Company's Regulated Networks segment includes Auckland electricity and gas distribution services. The Company's Gas Trading segment includes natural gas and liquefied petroleum gas (LPG) sales, storage and processing, and cogeneration. The Company's Technology segment includes metering services, telecommunications and new energy solutions. The Company's electricity lines and cables deliver power approximately 544,510 homes and businesses on behalf of electricity retailers. The Company maintains and operates approximately 1.5 million electricity and gas meters. The Company's gas brand, OnGas, promotes both piped and bottled gas supply to customers throughout New Zealand. The Company owns and operates gas processing facilities at Kapuni in South Taranaki.",
        0.2546,
        1.42126,
        "New Zealand",
        "NZD",
        1.05874,
        94.74779,
        -1.59215e+08,
        0.1575,
        0.05625,
        0.05625,
        5.33006e+08,
        9.504885498474689,
        5.066161e+09,
        0.16,
        -1.47243e+08,
        "NZD",
        null,
        0.6443604999999999,
        0.6443604999999999,
        7.37537e+08,
        "Multiline Utilities - NEC",
        0.05624,
        1.144603e+09,
        3.13e+09,
        1.936161e+09,
        2.71493e+08,
        783,
        33583,
        0.23312619999999998,
        0.0901492,
        3.55,
        3.06,
        1.30833,
        55.64444,
        12.06882,
        -1.88088,
        0,
        2.73457,
        1.05055,
        0.0110725,
        0.010047500000000001,
        0.0240092,
        0.0110725,
        1.461817e+06,
        "Utilities",
        "NZX:VCT",
        5.602958e+09,
        5.53586e+08,
        2.256881e+09,
        1.144603e+09,
        9.9565995e+08,
        9.9565995e+08,
        "https://vector.co.nz/"
      ],
      "s": "NZX:VCT"
    },
    {
      "f": [
        6.45265e+06,
        0.34,
        0.41545,
        "Vital Healthcare Property Trust is a New Zealand-based unit trust. The Trust's principal activity is the investment in high quality health sector related properties. The Trust operates in both Australia and New Zealand. Its tenants are hospital and healthcare operators, providing a range of medical and health services and carry out vital research. The principal objectives of the Trust are to acquire or design, build, manage and enhance properties associated with the provision of healthcare services; build the Trust's capital base; maximize the return to investors, consistent with the objective of the stable, long-term development of the property portfolio; provide investors with access to scale properties in a diversified portfolio across healthcare sectors; maintain a structured, low-risk capital and treasury management policy, and focus on the New Zealand and Australian markets. The Trust is managed by Vital Healthcare Management Limited.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.26839,
        35.74059,
        -2.5045e+07,
        0.06532,
        null,
        null,
        null,
        null,
        1.1753592e+09,
        0.08616,
        -1.03214e+08,
        "NZD",
        null,
        null,
        null,
        5.5757e+07,
        "Healthcare REITs",
        0.34,
        7.7119e+07,
        8.441802e+08,
        3.31179e+08,
        1.17208e+08,
        0,
        null,
        null,
        null,
        2.32956,
        1.83391,
        0.99337,
        null,
        null,
        -2.7027,
        6.81161,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        "Financial",
        "NZX:VHP",
        1.047068e+09,
        6.788e+06,
        2.46485e+08,
        7.7119e+07,
        3.4599783e+08,
        3.4599783e+08,
        "http://www.vitalhealthcareproperty.co.nz/"
      ],
      "s": "NZX:VHP"
    },
    {
      "f": [
        10380,
        -0.09522,
        null,
        "Windflow Technology Limited is a wind turbine design and assembly company. The Company is engaged in wind turbine manufacturing; engineering design, research and development; production engineering, and wind farm development, operations and maintenance. The Company's segments include Wind Turbines, Licensing and All Other segments. The Company's Wind Turbines segment is engaged in manufacturing, selling, installing, commissioning, operating and maintaining wind turbines and related parts. It is an aggregation of the activities in New Zealand and the United Kingdom. The Licensing segment derives revenue from licensing agreements with other manufacturers of wind turbines. Its All Other Segments represent the design and development of wind turbines, general marketing and administration expenses, and it includes the parent and subsidiary companies and their general central administration income and expenses.",
        -0.06849,
        1.42126,
        "New Zealand",
        "NZD",
        0.28324,
        null,
        -73000,
        null,
        -0.09395,
        -0.09395,
        -1.638e+06,
        -9.664505494505494,
        1.583046e+07,
        null,
        -7.186e+06,
        "NZD",
        null,
        0.6840644,
        0.6840644,
        1.232e+06,
        "Wind Systems \u0026 Equipment",
        -0.09522,
        1.801e+06,
        386460,
        1.5444e+07,
        -3.68e+06,
        null,
        null,
        -1.483065,
        -2.0433090000000003,
        0.025,
        0.01,
        null,
        null,
        null,
        0,
        -9.09091,
        0.21458,
        0.08779,
        null,
        -0.2497879,
        null,
        null,
        null,
        "Capital Goods",
        "NZX:WTL",
        1.5539e+07,
        5.185e+06,
        1.6229e+07,
        1.801e+06,
        3.864595e+07,
        3.864595e+07,
        "http://www.windflow.co.nz/"
      ],
      "s": "NZX:WTL"
    },
    {
      "f": [
        851980,
        null,
        0.50325,
        "Methven Limited designs, manufactures and supplies showerware, tapware and water control valves. The Company's segments include Group operations, New Zealand, Australia, United Kingdom and Inter-segment eliminations/unallocated and Other. The Group operations include supply chain services; research and development; marketing and brand development activity; manufacturing operations including locations in New Zealand and China, and strategic and management support, information technology and corporate services. The New Zealand segment comprises sales and marketing operations in New Zealand supplying showerware, tapware and domestic water control valves. The Australia segment comprises sales and marketing operations in Australia supplying showerware, tapware and domestic water control valves. The United Kingdom segment comprises sales and marketing operations in the United Kingdom, the European Union and the Middle East, and supplies showerware, tapware and domestic water control valves.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        2.04469,
        49.71634,
        -7.81e+06,
        0.085,
        null,
        null,
        null,
        null,
        1.1995956e+08,
        0.09567,
        null,
        "NZD",
        null,
        null,
        null,
        5.504e+07,
        "Construction Supplies \u0026 Fixtures - NEC",
        null,
        null,
        9.783756e+07,
        2.2122e+07,
        8.594e+06,
        null,
        5448,
        null,
        null,
        1.4,
        1.1,
        1.99005,
        null,
        null,
        1.51515,
        18.58407,
        null,
        1.12436,
        null,
        null,
        null,
        null,
        null,
        "Capital Goods",
        "NZX:MVN",
        9.3753e+07,
        4.1632e+07,
        2.4362e+07,
        1.29987e+08,
        7.277341e+07,
        7.277341e+07,
        "http://www.methvenltd.com/"
      ],
      "s": "NZX:MVN"
    },
    {
      "f": [
        295340,
        0.133,
        0.91161,
        "Scott Technology Limited is an engineering company. The Company's principal activities are the design, manufacture, sales and servicing of automated production lines and processes for a variety of industries in New Zealand and overseas. The Company's operating segments include Australasia manufacturing, Americas manufacturing, and Asia and Europe manufacturing. Its business divisions include appliance systems; meat processing; industrial automation; sample preparation, and superconductivity. Appliance Systems specializes in the design and manufacture of automated manufacturing systems for white goods manufacturers. The Meat Processing business division develops and builds solutions for lamb and beef boning operations. Industrial Automation designs and manufactures production equipment for industries in various sectors. Sample Preparation equipment is designed for the Company under the ROCKLABS brand. High Temperature Superconductor technologies are developed under the HTS-110 brand.",
        0.17552,
        1.42126,
        "New Zealand",
        "NZD",
        3.80727,
        0.75481,
        -4.32e+06,
        0.095,
        0.1259,
        0.1259,
        1.3016e+07,
        8.792985556238476,
        1.144495e+08,
        null,
        8.804e+06,
        "NZD",
        2.9911e+07,
        0.4057781,
        0.4057781,
        4.5465e+07,
        "Testing \u0026 Measuring Equipment",
        0.133,
        1.12044e+08,
        1.493615e+08,
        -3.4912e+07,
        7.485e+06,
        null,
        null,
        0.1006033,
        0.0978633,
        2.22965,
        1.35371,
        1.59012,
        15.88562,
        15.12062,
        0,
        40.50958,
        1.33306,
        3.09863,
        0.1052101,
        0.0820555,
        0.1035778,
        0.1052101,
        null,
        "Technology",
        "NZX:SCT",
        1.13811e+08,
        6.6315e+07,
        709000,
        1.12044e+08,
        7.468075e+07,
        7.468075e+07,
        "http://www.scott.co.nz/"
      ],
      "s": "NZX:SCT"
    },
    {
      "f": [
        1.15842e+06,
        -0.00916,
        1.10539,
        "Rakon Limited is a technology company that designs and manufactures frequency control solutions. The Company's segments include NZ, UK, France, China-T'maker, India-Centum Rakon and Other. The Company's product range consists of low stability Crystal Oscillators (XO), Voltage Controlled Crystal Oscillators (VCXOs) and crystal products, through to high volume precision Temperature Compensated Crystal Oscillators (TCXOs), Oven Controlled Crystal Oscillators (OCXOs), Digital Pulse Compression Sub-Systems (DPCSS), Surface Acoustic Wave (SAW) oscillators and specialized products. It offers a product portfolio, including technology advanced products for the telecommunications, positioning, and space and defense markets. It has approximately six manufacturing plants, including over three joint venture plants and approximately eight research and development centers. Its subsidiaries include Rakon America LLC, Rakon Financial Services Limited and Rakon UK Holdings Limited, among others.",
        0.02588,
        1.42126,
        "New Zealand",
        "NZD",
        1.50447,
        30.57188,
        null,
        null,
        -0.0442,
        -0.0442,
        -4.545e+06,
        -10.332882288228824,
        4.696295e+07,
        null,
        1.954e+06,
        "NZD",
        null,
        0.402834,
        0.402834,
        4.794e+07,
        "Electrical Components \u0026 Equipment - NEC",
        -0.00916,
        1.12737e+08,
        3.438695e+07,
        1.2576e+07,
        -1.731e+06,
        800,
        null,
        -0.0557575,
        -0.0747041,
        0.33,
        0.17,
        0.46141,
        null,
        null,
        0,
        -28,
        0.34147,
        0.76395,
        -0.1008104,
        -0.0678947,
        -0.1055007,
        -0.1008104,
        null,
        "Technology",
        "NZX:RAK",
        1.16392e+08,
        5.9076e+07,
        2.2784e+07,
        1.12737e+08,
        1.9103859e+08,
        1.9103859e+08,
        "http://www.rakon.com/"
      ],
      "s": "NZX:RAK"
    },
    {
      "f": [
        444110,
        -0.05631,
        0.65253,
        "Veritas Investments Limited is an investment company with shareholdings in a range of New Zealand businesses in the food and beverage and hospitality sectors. The Company's segments include the Mad Butcher, Nosh, the BBC, Kiwi Pacific Foods and Other. The Mad Butcher segment represents the activities of the Mad Butcher franchisor business, as well as an owned retail store. The Mad Butcher franchisor comprises the brand, franchise system and franchisor rights for Mad Butcher stores across New Zealand. Mad Butcher stores are retail butchers. Nosh includes the business activities of Nosh Group Limited. Nosh is a chain of specialty food stores based in New Zealand. The BBC segment includes the business activities of The Better Bar Company Limited, which operates a chain of approximately eight bars based in Auckland and Hamilton. Kiwi Pacific Foods includes the 50% joint venture interest the Company has in Kiwi Pacific Foods Limited. Other includes the activities of the Company.",
        -0.02873,
        1.42126,
        "New Zealand",
        "NZD",
        0.31906,
        415.7726,
        -472090,
        null,
        -0.0563,
        -0.0563,
        5.04902e+06,
        7.898651619522204,
        3.988045e+07,
        null,
        -392360,
        "NZD",
        null,
        0.5984482,
        0.5984482,
        3.383767e+07,
        "Investment Trusts",
        -0.05631,
        5.654235e+07,
        8.66132e+06,
        3.121913e+07,
        -4.59162e+06,
        null,
        null,
        -0.0014053,
        -0.0310999,
        0.5,
        0.15,
        1.08098,
        null,
        null,
        -13.04348,
        -58.33333,
        0.15318,
        0.25853,
        -0.0706933,
        -0.0475216,
        -0.2301762,
        -0.0706933,
        null,
        "Financial",
        "NZX:VIL",
        4.620906e+07,
        6.84223e+06,
        3.3313609999999996e+07,
        5.654235e+07,
        4.330662e+07,
        4.330662e+07,
        "http://www.veritasinvestments.co.nz/"
      ],
      "s": "NZX:VIL"
    },
    {
      "f": [
        2.38236e+07,
        0.11411,
        0.46246,
        "Precinct Properties New Zealand Limited is engaged in investing prime central business district (CBD) properties in New Zealand. The Company owns inner-city business space in Auckland and Wellington. The Company's property comprises over 300,000 square meters over approximately 10 buildings. The Company's Aukland and Wellington properties include AMP Centre, ANZ Centre, Bowen Campus, Central on Midland Park, Deloitte House, HSBC House, Mason Brothers Building, Mayfair House, PwC Tower, Pastoral House, State Insurance Tower, Zurich House, 1-3 The Terrace, 12 Madden Street and 157 Lambton Quay. The Company offers its buildings to the businesses and government organizations, including Air New Zealand, ANZ, Microsoft, PwC, The Treasury, State Insurance and Zurich. The Company's site in Wynyard Quarter comprises approximately 1.1 hectares of land area and focuses on developing over 46,000 square meters. The Company is managed by AMP Haumi Management Limited.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.28313,
        16.59225,
        -6.540000000000001e+07,
        0.0675,
        0.11411,
        0.11411,
        9.44e+07,
        17.52719279661017,
        1.654567e+09,
        0.05771,
        -6.3e+07,
        "NZD",
        null,
        0.660274,
        0.660274,
        9.64e+07,
        "Office Real Estate Development",
        0.11411,
        1.46e+08,
        1.423067e+09,
        2.315e+08,
        1.382e+08,
        null,
        7677,
        0.5712328999999999,
        0.9965752999999999,
        1.34,
        1.16,
        1.00861,
        10.29708,
        null,
        -0.42373,
        -3.68852,
        9.74703,
        0.28313,
        0.0805291,
        0.07925449999999999,
        0.1005383,
        0.0805291,
        null,
        "Services",
        "NZX:PCT",
        1.7386e+09,
        9.4e+06,
        2.341e+08,
        1.46e+08,
        1.2111e+09,
        1.2111e+09,
        "http://www.precinct.co.nz/"
      ],
      "s": "NZX:PCT"
    },
    {
      "f": [
        117680,
        0.13696,
        -0.12917,
        "Millennium \u0026 Copthorne Hotels New Zealand Limited is a New Zealand-based hotel operator. The Company is engaged in the ownership and operation of hotels in New Zealand; residential development and sale of land in New Zealand, and development and sale of residential units in Australia. The Company operates through three segments: Hotel operations, which include income from the ownership and management of hotels; Residential land development, which consists of development and sale of land, and Residential and commercial property development, which consists of development and sale of residential apartments and commercial properties. The Company, through its subsidiaries, is engaged in the investment holding, property investment and development, and residential apartment development, among others. It is a subsidiary of CDL Hotels Holdings New Zealand Limited, which is a subsidiary of Millennium \u0026 Copthorne Hotels plc in the United Kingdom. It operates in New Zealand and Australia.",
        0.22143,
        1.42126,
        "New Zealand",
        "NZD",
        4.5482,
        18.08837,
        -3.797e+06,
        0.028,
        0.21142,
        0.21142,
        6.2089e+07,
        4.548137351221634,
        2.823893e+08,
        null,
        -8.994e+06,
        "NZD",
        null,
        0.5813865,
        0.5813865,
        7.8076e+07,
        "Hotels \u0026 Motels",
        0.13696,
        1.36541e+08,
        2.468203e+08,
        2.351e+06,
        2.167e+07,
        null,
        1434,
        0.3825486,
        0.3843398,
        2.4,
        1.44,
        0.98789,
        11.06802,
        5.07433,
        0,
        59.18367,
        1.56222,
        3.44996,
        0.0836609,
        0.0718978,
        0.0926249,
        0.0836609,
        null,
        "Services",
        "NZX:MCK",
        6.10251e+08,
        1.41017e+08,
        7.3798e+07,
        1.36541e+08,
        1.5821829e+08,
        1.5821829e+08,
        "http://www.millenniumhotels.com/"
      ],
      "s": "NZX:MCK"
    },
    {
      "f": [
        6.17915e+06,
        0.17176,
        0.35928,
        "Property For Industry Limited is a New Zealand-based industrial property investment company. The Company's principal activity is property investment and management. The Company and its subsidiary, P.F.I. Property No. 1 Limited, invest in New Zealand. The Company's investment properties include 17 Allens Road, East Tamaki; 2-4 Argus Place, North Shore; 51 Arrenway Drive, North Shore; 7 Carmont Place, Mt Wellington; 15 Copsey Place, Avondale; 43 Cryers Road, East Tamaki, 124 Hewletts Road, Mt Maunganui; 76 Carbine Road, Mt Wellington; 686 Rosebank Road, Avondale; 322 Rosedale Road, North Shore; 12 Southpark Place, Penrose; 78 Springs Road, East Tamaki; 558 Te Rapa Road, Hamilton; 5 Vestey Drive, Mt Wellington; 7 Vestey Drive, Mt Wellington; 15a Vestey Drive, Mt Wellington; 127 Waterloo Road, Christchurch; 23 Zelanian Drive, East Tamaki; 41 William Pickering Drive, North Shore, and 10c Stonedon Drive, East Tamaki. The Company's portfolio includes approximately 80 industrial properties.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        0.2335,
        50.3473,
        -2.7705e+07,
        null,
        0.13388,
        0.13388,
        5.9602e+07,
        17.005981342907955,
        1.0135905e+09,
        0.0718,
        -6.6244e+07,
        "NZD",
        2.9086e+07,
        0.9701855,
        0.9701855,
        6.4744e+07,
        "Industrial REITs",
        0.17176,
        6.692700000000001e+07,
        6.832125e+08,
        3.30378e+08,
        7.2825e+07,
        0,
        null,
        0.5844816,
        0.933103,
        1.7,
        1.5,
        1.0181,
        11.27876,
        null,
        -3.82166,
        -5.32915,
        9.75558,
        null,
        0.059496799999999996,
        0.0587887,
        0.09382960000000001,
        0.059496799999999996,
        null,
        "Capital Goods",
        "NZX:PFI",
        1.0417950000000001e+09,
        2.622e+06,
        3.36321e+08,
        6.692700000000001e+07,
        4.5039415e+08,
        4.5039415e+08,
        "http://www.propertyforindustry.co.nz/"
      ],
      "s": "NZX:PFI"
    },
    {
      "f": [
        59160,
        0.154,
        0.22772,
        "T\u0026G Global Limited, formerly Turners \u0026 Growers Limited, is engaged in distributing, marketing and exporting of fresh produce. The Company's operating segments include, Pipfruit, International Produce, New Zealand Produce, Processed Foods and Other. Its Pipfruit segment includes growing, packing, cool storing, sales and marketing of pipfruit across the world. Its International Produce segment includes international trading activities other than pipfruit. Its New Zealand Produce segment includes growing, transport and trading activities within New Zealand, which incorporates the New Zealand wholesale markets, and the tomato and citrus growing operations. Its Processed Foods segment is engaged in processed food manufacture and sales in New Zealand and trading activities in Australia. Its Other segment includes flower auction, properties and corporate costs. It offers fresh produce in over 20 countries across the world, including grapes, citrus, kiwifruit, asparagus and berries.",
        0.32565,
        1.42126,
        "New Zealand",
        "NZD",
        1.47836,
        72.68892,
        -1.851e+06,
        0.12,
        0.23323,
        0.23323,
        6.524200000000001e+07,
        8.422476318935654,
        5.494992e+08,
        null,
        -6.283e+06,
        "NZD",
        null,
        0.3071816,
        0.3071816,
        2.29074e+08,
        "Fishing \u0026 Farming Wholesale",
        0.154,
        8.12764e+08,
        3.921382e+08,
        1.57361e+08,
        1.81e+07,
        133,
        null,
        0.050929,
        0.044370200000000005,
        3.43,
        1.94,
        1.10857,
        13.72036,
        7.715,
        -2.14067,
        52.38095,
        0.45353,
        0.839,
        0.0569283,
        0.038154099999999996,
        0.0881068,
        0.0569283,
        null,
        "Consumer/Non-Cyclical",
        "NZX:TGG",
        8.2603e+08,
        3.74776e+08,
        2.51375e+08,
        8.12764e+08,
        1.1980332e+08,
        1.1980332e+08,
        "http://www.turnersandgrowers.com/"
      ],
      "s": "NZX:TGG"
    },
    {
      "f": [
        1.2856008e+08,
        2.347511497330136,
        1.42043,
        "Westpac Banking Corporation is a banking organization. The Company provides a range of banking and financial services in markets, including consumer, business and institutional banking and wealth management services. The Company is engaged in the provision of financial services, including lending, deposit taking, payments services, investment portfolio management and advice, superannuation and funds management, insurance services, leasing finance, general finance, interest rate risk management and foreign exchange services. The Company's segments include Consumer Bank, Business Bank, BT Financial Group (BTFG), Westpac Institutional Bank (WIB) and Westpac New Zealand. The Company has branches throughout Australia, New Zealand, Asia and in the Pacific region. The Company through its division offers its services under various brands, such as Westpac, St.George, BankSA, Bank of Melbourne and RAMS brands.",
        2.41648,
        1.35962,
        "Australia",
        "AUD",
        null,
        327.0303,
        -5.402e+09,
        1.9652320501316543,
        2.2457,
        2.17818,
        1.9216e+10,
        14.092688384679432,
        2.8308237332931256e+11,
        1.917700613259587,
        -1.1843659110633852e+09,
        "NZD",
        null,
        null,
        null,
        null,
        "Banks - NEC",
        2.17813,
        3.1822e+10,
        1.1259640230799782e+11,
        1.63092e+11,
        7.445e+09,
        32190,
        622674,
        0.5072194,
        0.5072194,
        33.74,
        27.57,
        1.85106,
        14.77839,
        12.01485,
        -0.27881,
        0.03108,
        5.13286,
        null,
        null,
        0.009035,
        0.1337913,
        null,
        null,
        "Financial",
        "NZX:WBC",
        8.39202e+11,
        null,
        1.9007e+11,
        null,
        3.34214624e+09,
        3.34214624e+09,
        "http://www.westpac.com.au"
      ],
      "s": "NZX:WBC"
    },
    {
      "f": [
        1.784746e+07,
        0.13419,
        null,
        "Tegel Group Holdings Limited is involved in breeding, hatching, processing, marketing and distribution of poultry products. The Company also manufactures and markets a range of sausages and other processed meat products. It produces a range of products across its business (such as fresh and frozen whole chickens, fillets and portions), and convenience products (such as cooked and smoked smallgoods, and frozen further processed products). The Company's brands include Tegel, Rangitikei and Top Hat. Its offerings include Tegel Meal Maker Shredded Roast Chicken, Honey Roast Sliced Turkey and Cheese Fresh Chicken Sausages. Domestically, the Company's products are supplied to supermarkets, other retail outlets, processors, hotels, restaurants, distributors and fast food customers. The Company's international markets include Australia, the Pacific Islands, the United Arab Emirates and Hong Kong. Its operations include processing facilities in Auckland, New Plymouth and Christchurch.",
        0.35203,
        1.42126,
        "New Zealand",
        "NZD",
        3.05518,
        33.38088,
        null,
        0,
        0.07804,
        0.07804,
        6.2594e+07,
        11.573364859251685,
        7.244232e+08,
        0.067,
        2.0119e+07,
        "NZD",
        2.54578e+08,
        0.2436192,
        0.2436192,
        1.47436e+08,
        "Poultry Farming",
        0.13419,
        5.82361e+08,
        4.697962e+08,
        2.54627e+08,
        1.1311e+07,
        null,
        null,
        0.0735587,
        0.050555,
        1.8,
        1.29,
        0.99425,
        16.9144,
        11.93073,
        -15.38462,
        null,
        0.79126,
        1.27714,
        0.032748400000000004,
        0.028837500000000002,
        0.0520399,
        0.032748400000000004,
        null,
        "Consumer/Non-Cyclical",
        "NZX:TGH",
        7.16931e+08,
        2.23126e+08,
        1.57729e+08,
        5.82361e+08,
        3.55906e+08,
        3.55906e+08,
        null
      ],
      "s": "NZX:TGH"
    },
    {
      "f": [
        9.33154e+06,
        0.091,
        0.1101,
        "NZX Limited operates New Zealand securities, derivatives and energy markets, and an Australian grain commodity market. The Company operates in five segments: Capital Markets, which is an operator and regulator of securities markets and provider of trading, post-trade and data services, as well as the provider of a central securities depository; Soft Commodities, which is an operator of an electronic grain trading platform through Clear Grain Exchange, and operator of a dairy derivatives market; Agricultural Information, which provides information, news and data relating to the agriculture sectors in New Zealand and Australia through printed publications and online services; Funds Services, which provides superannuation, KiwiSaver and Exchange Traded Funds and funds administration platforms, and Market Operations, which is a market operator for New Zealand's wholesale electricity market and the Fonterra Shareholders Market. It offers products, including AgriHQ, NZX Agri and NZX Info.",
        0.11635,
        1.42126,
        "New Zealand",
        "NZD",
        1.36421,
        27.87923,
        -1.5834e+07,
        0.06,
        0.03533,
        0.03485,
        2.3996e+07,
        10.44781630271712,
        2.507058e+08,
        0.06,
        -3.076e+06,
        "NZD",
        3.5764e+07,
        null,
        null,
        null,
        "Financial \u0026 Commodity Market Operators - NEC",
        0.09,
        7.3151e+07,
        2.709988e+08,
        -2.0293e+07,
        2.3872e+07,
        60,
        null,
        0.1998305,
        0.1998305,
        1.08,
        0.97,
        3.71573,
        28.98135,
        15.85252,
        0,
        -0.98039,
        3.53415,
        null,
        0.0909113,
        0.0533047,
        0.12668200000000002,
        0.0909113,
        null,
        "Financial",
        "NZX:NZX",
        1.78326e+08,
        9.8714e+07,
        2e+07,
        7.3151e+07,
        2.6391955000000003e+08,
        2.6391955000000003e+08,
        "https://www.nzx.com"
      ],
      "s": "NZX:NZX"
    },
    {
      "f": [
        58890,
        -0.042559456721458014,
        0.41631,
        "Pyne Gould Corporation Limited is a wealth management company. The Company is engaged in providing wealth management, trustee and financial services. The Company operates in three segments: Torchlight Group, Property Group and Parent Company. The Torchlight Group segment provides investment management services and a proprietary investor (both directly and in funds it manages). The Property Group segment manages the Company's property assets. The Parent Company segment holds investments in and advances to/from subsidiaries. The Company's subsidiaries operate in approximately three geographical areas, including New Zealand, Australia and Cayman Islands. Its subsidiaries include MARAC Investments Limited, Equity Partners Asset Management Limited, Torchlight Securities Limited, Ferrero Investments Limited, Torchlight Fund No.2 Limited Partnership, Equity Partners Infrastructure Management Ltd, NZ Credit Fund (GP) 1 Limited, Torchlight (GP) 2 Limited and Torchlight Management Limited.",
        null,
        0.80548,
        "Guernsey",
        "GBP",
        1.99386,
        94.49265,
        null,
        null,
        -0.04177,
        -0.04177,
        -1.475818e+07,
        -6.7178730710697385,
        1.74937682513284e+08,
        null,
        1.8966943024780255e+07,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Management \u0026 Fund Operators - NEC",
        -0.02412,
        2.11915e+06,
        7.504363256964791e+07,
        5.661361e+07,
        -2.836e+06,
        247,
        null,
        -3.0903050000000003,
        -4.190571,
        0.225,
        0.18,
        0.43666,
        null,
        null,
        2.5,
        null,
        16.00484,
        1.19466,
        -0.08384219999999999,
        -0.056632100000000005,
        -0.0778861,
        -0.08384219999999999,
        null,
        "Financial",
        "NZX:PGC",
        1.61398e+08,
        6.1407e+07,
        5.2159e+07,
        1.201e+06,
        2.07463e+08,
        2.07463e+08,
        "http://www.pgc.co.nz/"
      ],
      "s": "NZX:PGC"
    },
    {
      "f": [
        1.614384e+07,
        0.14031,
        null,
        "NZME Limited is a New Zealand-based company, which is principally engaged in the media and entertainment business. The Company operates in three segments: Print, Radio and Digital. The Company is focused on delivering in news, sport and entertainment to New Zealanders. GrabOne is the Company's e-commerce platform. The Company has a network of over 80 media brands. The Company's news brands include The New Zealand Herald, Herald National News, Newstalk ZB, Weekend Herald, Herald On Sunday, Herald Business, Bay of Plenty Times, Hawke's Bay Today, The Northern Advocate, Rotorua Daily Post, Wanganui Chronicle, Farming Show, Herald World News, Herald Classifieds, Heraldjobs, Northland Age, Whangarei Report and The Aucklander. The Company's sports brands include Radio Sport, Herald Sport, Herald Rugby and Dream Team. The Company's media brands include Herald Entertainment, Herald Lifestyle, Heraldhomes, Coast, Flava, Vibe and Watch Me.",
        0.26173,
        1.42126,
        "New Zealand",
        "NZD",
        0.9923,
        44.87974,
        null,
        0,
        null,
        null,
        null,
        null,
        2.139264e+08,
        0.075,
        5.53e+07,
        "NZD",
        7.0783e+07,
        null,
        null,
        null,
        "Broadcasting - NEC",
        0.14031,
        4.33e+08,
        1.117264e+08,
        1.022e+08,
        2.76e+07,
        null,
        null,
        null,
        null,
        0.99,
        0.49,
        0.40113,
        null,
        null,
        -1.72414,
        null,
        null,
        0.9623,
        null,
        null,
        null,
        null,
        null,
        "Services",
        "NZX:NZM",
        4.81959e+08,
        7.1826e+07,
        1.25004e+08,
        4.33e+08,
        1.9601128e+08,
        1.9601128e+08,
        "http://www.nzme.co.nz/"
      ],
      "s": "NZX:NZM"
    },
    {
      "f": [
        941730,
        -0.06217,
        0.23115,
        "Marlin Global Limited (Marlin) is an Australia-based investment company. The Company invests in growing companies based outside New Zealand and Australia. The Company operates in the international financial investment segment. The key investment objectives of Marlin are to achieve a high real rate of return, comprising both income and capital growth, within risk parameters acceptable to the directors, and provide access to a diversified portfolio of international growth stocks through a single tax-efficient investment vehicle. The Company's investment portfolio includes investments across various sectors, such as biotech, financial services, technology and retail. It has an investment portfolio spanning across China, Denmark, France, Ireland, Israel, Italy, Japan, Mexico, the United Kingdom and the United States. Fisher Funds Management Limited (Fisher Funds) is the manager of the Company. Fisher Funds is a specialist investment manager engaged in investing in growth company shares.",
        null,
        1.42126,
        "New Zealand",
        "NZD",
        38.702,
        0.01698,
        -4.807e+06,
        0.0725,
        -0.06167,
        -0.06167,
        -5.434e+06,
        0.8395693779904306,
        -4.56222e+06,
        null,
        472000,
        "NZD",
        null,
        null,
        null,
        null,
        "Investment Trusts",
        -0.06217,
        -3.781e+06,
        9.143878e+07,
        -9.6001e+07,
        -6.901e+06,
        0,
        null,
        null,
        null,
        0.87,
        0.74,
        0.95021,
        null,
        null,
        0,
        -9.1954,
        null,
        null,
        -0.0686069,
        -0.0664507,
        -0.0686069,
        -0.0686069,
        null,
        "Financial",
        "NZX:MLN",
        9.6755e+07,
        9.6755e+07,
        16000,
        -3.781e+06,
        1.1336963e+08,
        1.1336963e+08,
        "http://www.marlin.co.nz/"
      ],
      "s": "NZX:MLN"
    },
    {
      "f": [
        794990,
        -0.0941,
        2.60978,
        "Plexure Group Limited, formerly VMob Group Limited, offers Plexure platform. The Company's Plexure platform analyzes purchases and contextual data, and tailors messaging to individual customers. Plexure platform allows users to measure every purchase transaction, alongside real-time data, such as location and weather conditions. Plexure allows users to integrate digital and in-store technology. Plexure combines data from Websites, mobile, point of sale and connected in-store technology to optimize real-world customer experiences. Plexure consists of application programming interface (API), mobile software development kit (SDK) and a set of pre-built connectors. Plexure consists of features, including analytics, adaptive machine learning, campaign manager, workflow builder, media library, consumer manager, content manager and push messaging. The Plexure loyalty module allows users to manage loyalty rewards, points and incentives across multiple programs in multiple channels.",
        -0.07446,
        1.42126,
        "New Zealand",
        "NZD",
        1.35965,
        0,
        null,
        null,
        -0.08626,
        -0.08626,
        -5.385e+06,
        -2.9049396471680593,
        1.56431e+07,
        null,
        -7.596e+06,
        "NZD",
        null,
        null,
        null,
        null,
        "Software - NEC",
        -0.0941,
        5.368e+06,
        1.82801e+07,
        -2.637e+06,
        -6.649e+06,
        null,
        null,
        -1.145699,
        -1.1458599999999999,
        0.53,
        0.195,
        2.89976,
        null,
        null,
        -11.11111,
        -42.85714,
        2.95603,
        null,
        -1.236143,
        -0.8928212999999999,
        -1.247632,
        -1.236143,
        null,
        "Technology",
        "NZX:PLX",
        9.325e+06,
        4.064e+06,
        0,
        5.368e+06,
        9.140051e+07,
        9.140051e+07,
        "http://www.vmob.co/"
      ],
      "s": "NZX:PLX"
    },
    {
      "f": [
        2.38079e+06,
        0.13875,
        -0.13899,
        "Hellaby Holdings Limited is an investment company. The Company's segments include Resource Services, Automotive, Footwear and Corporate. The Resource Services segment includes the operations of Contract Resources Investments Limited, which provides specialized industrial and mechanical services to refineries and petrochemical plants. The Automotive segment includes the operations of Brake \u0026 Transmission NZ Limited, an importer and distributor of automotive and commercial replacement parts; Diesel Distributors Limited and Diesel Distributors Australia Pty Limited, wholesale distributors of diesel fuel injection and ancillary diesel engine parts; TRS Tyre \u0026 Wheel Limited, an importer and distributor of tires and wheels, and Dasko Limited, a wholesale distributor of auto-electrical, fuel and engine management components. The Footwear segment includes the operations of R. Hannah \u0026 Co Limited and Number 1 Shoes Limited, which are specialty shoe retailers.",
        0.28138,
        1.42126,
        "New Zealand",
        "NZD",
        2.24899,
        52.61078,
        -2.0624e+07,
        0.215,
        0.13877,
        0.13877,
        3.4267e+07,
        12.409927918989116,
        4.25251e+08,
        0.22,
        -1.8035e+07,
        "NZD",
        null,
        0.4146667,
        0.4146667,
        2.36404e+08,
        "Diversified Trading \u0026 Distributing",
        0.13875,
        5.70106e+08,
        3.38136e+08,
        8.7115e+07,
        1.9603e+07,
        3000,
        6192,
        0.036179199999999995,
        0.0328535,
        3.5,
        2.45,
        1.74844,
        24.93334,
        12.52727,
        0,
        17.28814,
        0.59311,
        1.36523,
        0.0434405,
        0.029993099999999998,
        0.0678429,
        0.0434405,
        190035.3,
        "Consumer Cyclical",
        "NZX:HBY",
        4.56767e+08,
        2.8967e+08,
        9.987e+07,
        5.70106e+08,
        9.59256e+07,
        9.59256e+07,
        "http://www.hellabyholdings.co.nz/"
      ],
      "s": "NZX:HBY"
    }
  ]
}