{
  "fields": [
    "revenue_per_employee",
    "price_52_week_low",
    "operating_margin",
    "number_of_shareholders",
    "currency",
    "conversion_rate",
    "earnings_per_share_basic_ttm",
    "industry",
    "average_volume",
    "earnings_per_share_diluted_ttm",
    "beta_1_year",
    "pre_tax_margin",
    "country",
    "total_revenue",
    "ebitda",
    "symbol",
    "price_revenue_ttm",
    "cash_ratio",
    "free_cash_flow",
    "basic_eps_net_income",
    "sector",
    "business_description",
    "last_annual_eps",
    "web_site_url",
    "price_percent_change_52_week",
    "gross_margin",
    "gross_margin_percent_ttm",
    "market_cap_basic",
    "number_of_employees",
    "net_income",
    "price_52_week_high",
    "price_percent_change_1_week"
  ],
  "symbols": [
    {
      "f": [
        117556.1,
        2.61,
        -2.9880790000000004,
        26174,
        "USD",
        1,
        -1.0333,
        "Biotechnology \u0026 Medical Research - NEC",
        2.164923e+07,
        -1.0333,
        2.04292,
        -348.4547,
        "United States",
        6.592e+06,
        -7.847485e+07,
        "NASDAQ:AGEN",
        17.75902,
        -1.10119,
        -5.076678e+07,
        -1.12622,
        "Healthcare",
        "Agenus Inc. (Agenus) is an immuno-oncology company. The Company is engaged in discovering and developing treatments for patients with cancer. Its approaches are driven by platforms and programs, which include antibody discovery platform, including Retrocyte Display, SECANT yeast display and phage display technologies designed to produce human antibodies; antibody candidate programs, including checkpoint modulator (CPM) programs; vaccine programs, including Prophage and AutoSynVax, and saponin-based vaccine adjuvants, principally QS-21 Stimulon adjuvant (QS-21 Stimulon). The Company has a portfolio of programs in various stages of development, including a series of antibodies in discovery and pre-clinical and clinical development, Prophage vaccine, a Heat Shock Protein (HSP)-based vaccine candidate for a form of brain cancer that has completed Phase II trials, and a number of QS-21 Stimulon-containing vaccine candidates in late stage development.",
        -1.12622,
        "http://www.agenusbio.com",
        -32.80872,
        0.2825231,
        0.2825231,
        4.801665e+08,
        230,
        -2.832e+07,
        8.36,
        14.66942
      ],
      "s": "NASDAQ:AGEN"
    },
    {
      "f": [
        0,
        2.57,
        "null",
        92,
        "USD",
        1,
        -1.24653,
        "Pharmaceuticals - NEC",
        7.51042e+06,
        -1.24653,
        -0.33764,
        "null",
        "United States",
        0,
        -1.472847e+07,
        "NASDAQ:ADMP",
        "null",
        -0.94771,
        -1.033558e+07,
        -1.02231,
        "Healthcare",
        "Adamis Pharmaceuticals Corporation is a pharmaceutical company. The Company is engaged in the development of its specialty pharmaceutical products. The Company is developing various products in the allergy and respiratory markets, including a dry powder inhaler technology that it acquired from 3M Company (3M). The Company's product portfolio includes specialty pharmaceutical products, such as Epinephrine pre-filled syringe (PFS), APC-5000 dry powder inhaler (DPI), APC-1000 and APC-2000, and biotechnology products, such as TeloB-VAX (vaccine), APC-100, APC-200 and APC-300. The Company's lead product candidate, the Epinephrine Injection USP 1:1000 0.3 milligram Pre-filled Single Dose Syringe, or the Epinephrine PFS, is a pre-filled syringe designed to deliver a premeasured 0.3 milligrams dose of epinephrine for the treatment of anaphylaxis. The Company also has licensed vaccine technology called somatic transgene immunization (STI) technology.",
        -1.02231,
        "http://www.adamispharmaceuticals.com/",
        -32.89896,
        "null",
        "null",
        5.764765e+07,
        15,
        -6.40849e+06,
        10.98,
        -7.07071
      ],
      "s": "NASDAQ:ADMP"
    },
    {
      "f": [
        83601.67,
        8.08,
        0.0628728,
        75,
        "USD",
        1,
        0.65827,
        "Communications \u0026 Networking - NEC",
        7.88733e+06,
        0.61924,
        "null",
        4.91263,
        "United States",
        5.0422e+07,
        2.3556e+07,
        "NASDAQ:AAOI",
        0.94619,
        1.22284,
        -7.277e+07,
        0.69067,
        "Technology",
        "Applied Optoelectronics, Inc. is a vertically integrated provider of fiber-optic networking products. The Company offers its products for approximately three networking end markets, such as Internet data center; cable television (CATV), and fiber-to-the-home (FTTH). The Company designs and manufactures a range of optical communications products at varying levels of integration, from components, subassemblies and modules to turnkey equipment. The Company's customers in the Internet data center market include Internet-based (Web 2.0) data center operators, to whom it supplies optical transceivers that plug into switches and servers within the data center, and allow these network devices to send and receive data over fiber optic cables. To the CATV market, it supplies a range of products, including lasers, transmitters and turnkey equipment, as well as headend, node and distribution equipment. Its manufacturing sites are located at Sugar Land, Texas; Ningbo, China, and Taipei, Taiwan.",
        0.65282,
        "http://ao-inc.com/",
        -38.80126,
        0.3077476,
        0.3077476,
        1.987854e+08,
        2513,
        -1.33e+06,
        22.79,
        -8.12944
      ],
      "s": "NASDAQ:AAOI"
    },
    {
      "f": [
        349513.6,
        47.24,
        0.2289848,
        2056,
        "USD",
        1,
        2.0786,
        "Semiconductors - NEC",
        4.928187e+07,
        2.05341,
        1.22138,
        21.86373,
        "United States",
        7.78766e+08,
        1.002024e+09,
        "NASDAQ:ADI",
        5.69683,
        2.9006,
        2.62779e+08,
        2.22887,
        "Technology",
        "Analog Devices, Inc. is engaged in designing, manufacturing and marketing analog, mixed-signal and digital signal processing (DSP) technology, including integrated circuits (ICs), algorithms, software and subsystems. The Company's operating segments include United States, Rest of North/South America, Europe, Japan, China and Rest of Asia. The Company's signal processing products help in converting, conditioning and processing real-world phenomena, such as temperature, pressure, sound, light, speed and motion into electrical signals. It offers data converters, amplifiers and linear products, radio frequency (RF) ICs, power management products, sensors based on micro-electro mechanical systems (MEMS) technology and other sensors, and processing products. Its products are embedded inside various types of electronic equipment, including industrial process control systems, medical imaging equipment, optical systems, automobiles and portable electronic devices.",
        2.19924,
        "http://www.analog.com/",
        7.10755,
        0.6486272,
        0.6486272,
        1.931386e+10,
        9700,
        1.70573e+08,
        66.91,
        -0.05169
      ],
      "s": "NASDAQ:ADI"
    },
    {
      "f": [
        899113.6,
        31.99,
        0.009314,
        49,
        "USD",
        1,
        -0.86312,
        "Air Freight",
        7.57173e+06,
        -0.87082,
        1.57992,
        -2.9312,
        "United States",
        4.18615e+08,
        2.52417e+08,
        "NASDAQ:AAWW",
        0.56764,
        6.19114,
        1.00799e+08,
        0.2934,
        "Transportation",
        "Atlas Air Worldwide Holdings, Inc., (AAWW) is a holding company with a principal operating subsidiary, Atlas Air, Inc. (Atlas). The Company is a provider of outsourced aircraft and aviation operating services, operating a fleet of 750 freighters, as well as operating 747 and 767 passenger aircraft and 767 freighters. It also owns and dries leases a fleet of aircraft, including over six 777 freighters. The Company operates through three segments, including aircraft, crew, maintenance and insurance (ACMI), Charter and Dry Leasing. Its ACMI segment provides aircraft, crew, maintenance and insurance services to customers. Its Charter segment provides full planeload air cargo and passenger aircraft charters to customers, including the United States military air mobility command (AMC), brokers, freight forwarders, direct shippers, airlines, sports teams and fans, and private charter customers. Its Dry Leasing segment provides cargo and passenger aircraft and engine leasing solutions.",
        0.29123,
        "http://www.atlasair.com/",
        -16.0882,
        0.7404284,
        0.7404284,
        1.019733e+09,
        1998,
        471000,
        57.77,
        -1.55689
      ],
      "s": "NASDAQ:AAWW"
    },
    {
      "f": [
        3217.273,
        1.5,
        -281.4561,
        "null",
        "CAD",
        1.3121,
        -0.79613,
        "Pharmaceuticals - NEC",
        20370,
        -0.79613,
        1.25442,
        -24030.94,
        "Canada",
        2890,
        -5.45204e+06,
        "NASDAQ:ACST",
        593.2635,
        -0.36789,
        -6.94212e+06,
        -0.59257,
        "Healthcare",
        "Acasti Pharma Inc. is a clinical-stage biopharmaceutical company. The Company is engaged in developing, clinically studying and marketing new pharmaceutical products to treat human cardiovascular conditions. The Company is involved in the development and commercialization of pharmaceutical applications of its licensed rights for cardiovascular diseases. The Company's prescription drug candidate is CaPre, which is being developed for the treatment of severe hypertriglyceridemia and eventually mild to moderate hypertriglyceridemia. The Company's ONEMIA has a natural health product status in Canada, and it is commercialized as a medical food in the United States. Onemia is a purified omega-3 phospholipids concentrate derived from krill oil with lower levels of phospholipids, eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA) content than CaPre.",
        -0.59257,
        "http://www.acastipharma.com/",
        -57.3913,
        -1.225487,
        -1.225487,
        2.099559e+07,
        11,
        -3.15356e+06,
        5.5,
        -4.39024
      ],
      "s": "NASDAQ:ACST"
    },
    {
      "f": [
        230266.7,
        1.61,
        -2.504632,
        350,
        "USD",
        1,
        -0.85739,
        "Bio Therapeutic Drugs",
        830480,
        -0.85739,
        1.86207,
        -278.286,
        "United States",
        224000,
        -8.244999999999999e+06,
        "NASDAQ:ACUR",
        6.30405,
        -0.43136,
        -3.902e+06,
        -0.46212,
        "Healthcare",
        "Acura Pharmaceuticals, Inc. is a pharmaceutical company. The Company is engaged in the research, development and commercialization of technologies and products intended to address medication abuse and misuse. The Company has discovered and developed three platform technologies, which can be used to develop multiple products. The Company's Oxaydo Tablets (oxycodone HCl, CII), which utilizes the Aversion Technology, is an approved and immediate-release (IR) oxycodone product in the United States. The Company's Impede technology products include Nexafed and Nexafed Sinus Pressure + Pain. Its third deterrent technology is Limitx, which is designed to retard the release of active drug ingredients when too many tablets are accidently or purposefully ingested. The Company's Aversion and Limitx technologies are intended to address methods associated with opioid and its Impede technology is directed at the extraction and conversion of pseudoephedrine into methamphetamine.",
        -0.46212,
        "http://acurapharm.com",
        -51.57895,
        0.8743486,
        0.8743486,
        2.177419e+07,
        15,
        -3.384e+06,
        3.8495,
        -4.16667
      ],
      "s": "NASDAQ:ACUR"
    },
    {
      "f": [
        0,
        10.99,
        "null",
        58,
        "USD",
        1,
        -0.18192,
        "Bio Therapeutic Drugs",
        1.57521e+06,
        -0.18192,
        "null",
        "null",
        "United States",
        0,
        -3.1069e+07,
        "NASDAQ:ACRS",
        "null",
        -1.14295,
        -2.0876e+07,
        -1.14741,
        "Healthcare",
        "Aclaris Therapeutics, Inc. is a clinical-stage specialty pharmaceutical company. The Company is focused on identifying, developing and commercializing differentiated drugs for the treatment of dermatological indications. The Company's lead drug candidate, A-101 Topical Solution, is a high-concentration hydrogen peroxide topical solution that the Company is developing as a prescription treatment for seborrheic keratosis (SK), a non-malignant skin tumor. The Company has completed over three Phase II clinical trials of A-101 in over 300 patients with SK. The Company has initiated a Phase II clinical trial of A-101 for the treatment of common warts. In addition to A-101, the Company is also developing A-102, a topical gel dosage form of hydrogen peroxide, for the treatment of both SK and common warts. It has in-licensed the rights to inhibitors of the Janus kinase (JAK) family of enzymes, for specified dermatological conditions.",
        -1.14741,
        "http://www.aclaristx.com/",
        "null",
        "null",
        "null",
        4.045168e+08,
        18,
        -1.3039e+07,
        33.88,
        -6.66667
      ],
      "s": "NASDAQ:ACRS"
    },
    {
      "f": [
        917956.5,
        3.2,
        -0.5896051,
        2246,
        "USD",
        1,
        -0.89774,
        "Environmental Services \u0026 Equipment - NEC",
        383050,
        -0.90067,
        1.70198,
        -30.95091,
        "United States",
        2.2357e+07,
        -3.6495e+07,
        "NASDAQ:ADES",
        2.25887,
        -1.28788,
        -2.8179e+07,
        -1.3717,
        "Energy",
        "Advanced Emissions Solutions, Inc. is a holding company for a family of companies that provide emissions solutions to customers in the coal-fired power generation, industrial boiler and cement industries. The Company provides environmental and emissions control equipment and specialty chemicals to the coal-burning electric power generation industry. It operates through two segments: Refined Coal (RC) and Emissions Control (EC). The RC segment is engaged in equity method investments, as well as royalty payment streams and reducing emissions of both nitrogen oxide and mercury from coals. Its equity method investments related to the RC segment include Clean Coal Solutions, LLC, which owns, leases or sells facilities used in the production of RC, and Clean Coal Solutions Services, LLC, which operates and maintains RC facilities. The EC Segment includes systems and equipment-activated carbon injection, dry sorbent injection system and other systems; consulting services, and chemicals.",
        -1.3717,
        "http://www.advancedemissionssolutions.com/",
        -35.96059,
        -0.130883,
        -0.130883,
        1.430747e+08,
        69,
        4.376e+06,
        10.25,
        0
      ],
      "s": "NASDAQ:ADES"
    },
    {
      "f": [
        "null",
        0.4799,
        0.1142415,
        "null",
        "USD",
        1,
        0.14273,
        "Animal Breeding",
        306600,
        0.14273,
        2.85959,
        12.15449,
        "China",
        9.05927e+06,
        7.42988e+06,
        "NASDAQ:ABAC",
        0.57245,
        0.17138,
        2.124329e+07,
        0.09168,
        "Consumer/Non-Cyclical",
        "Aoxin Tianli Group, Inc. is a holding company. The Company is engaged in hog farming. The Company conducts its hog breeding operations through Wuhan Fengze Agricultural Science and Technology Development Co., Ltd. (Fengze), a subsidiary of Wuhan Aoxin Tianli Enterprise Investment Management Co., Ltd., its wholly foreign owned enterprise, or WFOE, and its subsidiaries, Hubei Tianzhili Breeder Hog Co., Ltd. (Tianzhili), and Hubei Tianzhili (Hefeng) Breeder Hog Co., Ltd (Hefeng). The Company operates in two segments: Hog Farming and Retail. It utilizes various purebred hogs at its farms. The primary purebred varieties that it utilizes are the Yorkshire, Landrace and Duroc. It breeds both purebred and cross-bred hogs in order to attain desirable traits in the hogs produced in its farms. It is engaged in the sales of specialty processed black hog meat through the Internet. It sells its products under its Xiduhei trademark.",
        0.09168,
        "http://www.tianli-china.com/",
        -37.73585,
        0.251174,
        0.251174,
        2.108832e+07,
        434,
        -104900,
        1.21,
        -10.81081
      ],
      "s": "NASDAQ:ABAC"
    },
    {
      "f": [
        9.988102e+06,
        13.11,
        0.4289763,
        "null",
        "USD",
        1,
        -2.18637,
        "Electric Utilities - NEC",
        9.52114e+06,
        -2.18637,
        "null",
        -20.94094,
        "United Kingdom",
        2.06376e+08,
        6.63257e+08,
        "NASDAQ:ABY",
        2.23363,
        0.68016,
        5.6312e+07,
        -2.25233,
        "Utilities",
        "Atlantica Yield Plc owns, manages and acquires a diversified portfolio of contracted assets in the power and environment sectors. The Company owns approximately 20 assets, comprising 1,441 mega watts of renewable energy generation, 300 mega watts of conventional power generation, 1,099 miles of electric transmission lines and 10.5 Mft3 per day of water assets. The Company’s portfolio is diversified both by business segment and geography. By geography, the Company is present in North \u0026 South America, and certain markets in EMEA. ",
        -2.25233,
        "http://www.atlanticayield.com/",
        -20.62399,
        0.9798681,
        0.9798681,
        1.963256e+09,
        88,
        -2.6006e+07,
        25.3799,
        -5.72666
      ],
      "s": "NASDAQ:ABY"
    },
    {
      "f": [
        825792.8,
        23.5548,
        0.1217772,
        156,
        "USD",
        1,
        2.84599,
        "Property Insurance",
        1.72503e+07,
        2.80319,
        1.11758,
        11.23454,
        "United States",
        1.385866e+09,
        1.211952e+09,
        "NASDAQ:AFSI",
        0.84387,
        3.21667,
        7.06382e+08,
        2.85777,
        "Financial",
        "Amtrust Financial Services, Inc. (AmTrust) is an insurance holding company. The Company, through its subsidiaries, provides specialty property and casualty insurance focusing on workers' compensation and commercial package coverage for small business, specialty risk and extended warranty coverage, and property and casualty coverage for middle market business. Its segments include Small Commercial Business, Specialty Risk and Extended Warranty, and Specialty Program. The Small Commercial Business segment is engaged in providing workers' compensation, commercial package and other commercial insurance lines produced by wholesale agents, retail agents and brokers in the United States. The Specialty Risk and Extended Warranty segment is engaged in providing coverage for consumer and commercial goods and custom designed coverages. The Specialty Program segment is engaged in writing commercial insurance for defined classes of insureds through general and other wholesale agents.",
        2.80145,
        "http://www.amtrustgroup.com",
        -28.96956,
        "null",
        "null",
        4.320555e+09,
        6200,
        1.46367e+08,
        35.935,
        2.89855
      ],
      "s": "NASDAQ:AFSI"
    },
    {
      "f": [
        679933.9,
        1.23,
        -0.43862470000000003,
        5,
        "USD",
        1,
        -4.21463,
        "Pharmaceuticals - NEC",
        1.739812e+07,
        -4.21463,
        0.5719,
        -56.07324,
        "United States",
        3.5716e+07,
        -7.1238e+07,
        "NASDAQ:AEGR",
        0.19648,
        -1.78814,
        1.4102e+07,
        -2.5543,
        "Healthcare",
        "Aegerion Pharmaceuticals, Inc. is a biopharmaceutical company engaged in the development and commercialization of therapies for patients with debilitating rare diseases. It operates through pharmaceuticals segment. Its products include lomitapide and metreleptin. Lomitapide is a small molecule microsomal triglyceride transfer protein (MTP) inhibitor. Lomitapide received marketing approval under the brand name Juxtapid (lomitapide) capsules from the United States Food and Drug Administration (FDA) as an adjunct to a low-fat diet and other lipid-lowering treatments. It also received marketing authorization for lomitapide in the European Union (EU) under the brand name LOJUXTA (lomitapide) hard capsules (LOJUXTA) as a treatment for HoFH in adults. Metreleptin is a recombinant human leptin analog that exerts its function by binding to and activating the human leptin receptor. Metreleptin is marketed in the United States under the brand name MYALEPT (metreleptin) for injection (MYALEPT).",
        -2.5543,
        "http://www.aegerion.com/",
        -92.64556,
        0.7435008000000001,
        0.7435008000000001,
        4.248163e+07,
        318,
        -6.5554e+07,
        19.99,
        0
      ],
      "s": "NASDAQ:AEGR"
    },
    {
      "f": [
        "null",
        9.55,
        -1.362127,
        "null",
        "USD",
        1,
        -2.14523,
        "Biotechnology \u0026 Medical Research - NEC",
        1.62428e+06,
        -2.14523,
        0.70869,
        -195.1932,
        "Canada",
        4.362e+06,
        -2.986103e+07,
        "NASDAQ:ABUS",
        22.3885,
        -1.10185,
        -9.3557e+06,
        -1.15205,
        "Healthcare",
        "Tekmira Pharmaceuticals Corporation is a biopharmaceutical company focused on advancing ribonucleic acid (RNA) interference (RNAi) therapeutics and providing its lipid nanoparticle (LNP) delivery technology to pharmaceutical and biotechnology partners. Its product candidates include TKM-HBV, TKM-PLK1, TKM-Ebola and TKM-Marburg. TKM-HBV is an RNAi therapeutic for the treatment of Hepatitis B infection. The Company’s lead oncology product candidate, TKM -PLK1 is an oncology product platform that targets polo-like kinase 1 (PLK1), a protein involved in tumor cell proliferation and a validated oncology target. TKM-ALDH2 is an application of RNAi for alcohol use disorder with a target patient population who have moderate to severe alcohol use disorder. TKM-Ebola is an anti-Ebola viral therapeutic being developed under a contract with the United States Department of Defense Joint Project Manager Medical Countermeasure Systems. TKM-Marburg is used to treat hemorrhagic fever viral infections.",
        -1.15205,
        "http://www.tekmirapharm.com",
        -1.36,
        "null",
        "null",
        5.021082e+08,
        85,
        -8.604e+06,
        34.66,
        -10.24
      ],
      "s": "NASDAQ:ABUS"
    },
    {
      "f": [
        20347.45,
        3.77,
        -45.29271,
        "null",
        "USD",
        1,
        -29.13477,
        "Biotechnology \u0026 Medical Research - NEC",
        270930,
        -29.13477,
        2.78271,
        -6200,
        "Canada",
        242000,
        -4.185442e+07,
        "NASDAQ:AEZS",
        47.21449,
        -23.66365,
        -4.440018e+07,
        -23.82537,
        "Healthcare",
        "Aeterna Zentaris Inc. is a specialty biopharmaceutical company engaged in developing and commercializing treatments in oncology, endocrinology and women's health. The Company operates through the biopharmaceutical segment. The Company is engaged in drug development activities and in the promotion of products for others. The Company's principal product candidates are Zoptrex (zoptarelin doxorubicin) and Macrilen (macimorelin) in oncology and endocrinology. The Company focuses on its product candidates Zoptrex and Macrilen, which are in Phase III clinical development, and on a luteinizing hormone-releasing hormone (LHRH)-disorazol Z conjugate (AEZS-138), which is in pre-clinical development in oncology and is available for partnering. The Company's direct and indirect subsidiaries include AEZS GmbH, Zentaris IVF GmbH and Aeterna Zentaris, Inc.",
        -23.82537,
        "http://www.aezsinc.com/",
        -81.45833,
        "null",
        "null",
        4.419194e+07,
        46,
        -3.676e+06,
        26,
        1.13636
      ],
      "s": "NASDAQ:AEZS"
    },
    {
      "f": [
        1.140518e+06,
        41.54546,
        0.106778,
        1546,
        "USD",
        1,
        4.30827,
        "Property \u0026 Casualty Insurance - NEC",
        2.85686e+06,
        4.22115,
        0.61449,
        9.89649,
        "Bermuda",
        3.718e+08,
        2.128e+08,
        "NASDAQ:AGII",
        1.04084,
        5.75723,
        2.41e+08,
        5.30382,
        "Financial",
        "Argo Group International Holdings, Ltd. is an underwriter of specialty insurance and reinsurance products in the property and casualty market. The Company operates through four segments: Excess and Surplus Lines, Commercial Specialty, International Specialty and Syndicate 1200. Excess and Surplus Lines segment carriers focus on risks that the standard (admitted) market is unwilling or unable to underwrite. The Excess and Surplus Lines segment consists of two operating platforms: Colony Specialty and Argo Pro. Commercial Specialty segment provides property, casualty and surety coverages designed to meet the insurance needs of businesses within certain markets. International Specialty segment underwrites insurance and reinsurance risks. The Syndicate 1200 segment underwrites around the world property, specialty and non-United States liability insurance.",
        5.19967,
        "https://www.argolimited.com/",
        0.46783,
        "null",
        "null",
        1.558657e+09,
        1313,
        2.77e+07,
        60.36364,
        -1.52847
      ],
      "s": "NASDAQ:AGII"
    },
    {
      "f": [
        425748.1,
        48.97,
        0.0715365,
        1000,
        "USD",
        1,
        7.62135,
        "Plastic Container \u0026 Packaging",
        1.0292600000000001e+06,
        7.58112,
        0.98865,
        5.48365,
        "United States",
        2.73162e+08,
        1.07394e+08,
        "NASDAQ:AEPI",
        0.36856,
        11.8067,
        5.8297e+07,
        5.66111,
        "Basic Materials",
        "AEP Industries Inc. is a manufacturer of plastic packaging films in North America. The Company is engaged in the production, manufacture and distribution of polyethylene and polyvinyl chloride flexible plastic packaging products for the food/beverage, industrial and agricultural markets. The Company's plastic packaging films are used in the packaging, transportation, beverage, food, automotive, pharmaceutical, chemical, electronics, and construction, agriculture and textile industries. The Company's products include custom films, stretch (pallet) wrap, food contact, PROformance films, canliners, printed and converted films, and other products and specialty films. It manufactures plastic films, principally from resins blended with other raw materials, which it either sells or further processes by printing, laminating, slitting or converting. It manufactures both industrial grade products and specialty products. The Company operates in the United States and Canada.",
        5.63654,
        "http://www.aepinc.com",
        62.18744,
        0.17804950000000003,
        0.17804950000000003,
        4.07979e+08,
        2600,
        1.378e+07,
        94.91,
        -8.26722
      ],
      "s": "NASDAQ:AEPI"
    },
    {
      "f": [
        251492.3,
        3.43,
        0.0861524,
        566,
        "USD",
        1,
        0.02501,
        "Personal Services - NEC",
        487370,
        0.02247,
        0.17603,
        0.72592,
        "United States",
        3.3674e+07,
        3.6335e+07,
        "NASDAQ:ABCD",
        1.51475,
        0.43717,
        1.6836e+07,
        -0.02909,
        "Services",
        "Cambium Learning Group, Inc. is an educational solutions and services company. The Company's product lines include Learning A-Z (www.learninga-z.com), ExploreLearning (www.explorelearning.com), Voyager Sopris Learning (www.voyagersopris.com) and Kurzweil Education (www.kurzweiledu.com). It operates through three segments: Learning A-Z, Voyager Sopris Learning and ExploreLearning. The product lines provide technology solutions for online learning and professional support; intervention and supplemental instructional materials; professional development and school-improvement services; valid assessments, and materials. Learning A-Z is a preK-6 educational technology provider of digitally delivered resources and tools that support instruction and student growth in reading, writing, and science. Voyager Sopris Learning segment includes its Voyager Sopris Learning and Kurzweil Education brands. ExploreLearning develops online solutions to improve student learning in math and science.",
        -0.02909,
        "http://www.cambiumlearning.com/",
        -0.61224,
        0.6705614,
        0.6705614,
        2.228546e+08,
        585,
        -102000,
        5.97,
        -0.20492
      ],
      "s": "NASDAQ:ABCD"
    },
    {
      "f": [
        217074.7,
        15.072,
        0.20984380000000002,
        318,
        "USD",
        1,
        1.10191,
        "IT Services \u0026 Consulting - NEC",
        8.66358e+06,
        1.08817,
        1.37607,
        17.4771,
        "United States",
        2.1993e+08,
        1.57786e+08,
        "NASDAQ:ACIW",
        2.24002,
        1.53774,
        1.34166e+08,
        0.72733,
        "Technology",
        "ACI Worldwide, Inc. develops, markets, installs and supports a line of software products and services primarily focused on facilitating electronic payments. The Company also distributes or acts as a sales agent for software developed by third parties. These products and services are used principally by financial institutions, retailers, billers and electronic payment processors, both in domestic and international markets. The Company's products are sold and supported through distribution networks covering three geographic regions, including the Americas, Europe/Middle East/Africa (EMEA) and Asia/Pacific. The electronic payments market consists of financial institutions, retailers, billers, third-party electronic payment processors, payment associations, switch interchanges and a range of transaction-generating endpoints, including automated teller machines (ATM), retail merchant locations, bank branches, mobile phones, corporations and Internet commerce sites.",
        0.71844,
        "http://www.aciworldwide.com",
        -19.12266,
        0.5363171,
        0.5363171,
        2.225091e+09,
        4576,
        -1.6858e+07,
        24.61,
        -2.06292
      ],
      "s": "NASDAQ:ACIW"
    },
    {
      "f": [
        805018.7,
        15.64,
        0.1626189,
        2160,
        "USD",
        1,
        1.47463,
        "Insurance - Automobile",
        831320,
        1.39165,
        1.16262,
        15.60189,
        "United States",
        4.3196e+07,
        4.7197e+07,
        "NASDAQ:AFH",
        1.12641,
        1.21195,
        7.764e+06,
        1.18191,
        "Financial",
        "Atlas Financial Holdings, Inc. is a financial services holding company. The Company, through its subsidiaries, is engaged in the underwriting of commercial automobile insurance policies, focusing on the light commercial automobile sector, which includes taxi cabs, non-emergency para-transit, limousine, livery and business auto. The Company operates through the property and casualty (P\u0026C) insurance business segment. It develops and delivers specialty insurance products, which are distributed to the insured through a network of independent retail agents utilizing its operating platform. Through the insurance subsidiaries, it is licensed to write P\u0026C insurance in over 50 states and the District of Columbia in the United States. Its subsidiaries include American Country Insurance Company, American Service Insurance Company, Inc., Gateway Insurance Company, Anchor Group Management, Inc., Plainview Premium Finance Company, Inc. and Plainview Premium Finance Company of California, Inc.",
        1.11137,
        "http://www.atlas-fin.com/",
        -12.72727,
        "null",
        "null",
        1.940518e+08,
        214,
        4.9e+06,
        21.13,
        -3.65998
      ],
      "s": "NASDAQ:AFH"
    },
    {
      "f": [
        219144.4,
        18.85,
        0.20325310000000002,
        1120,
        "USD",
        1,
        0.89452,
        "Heating, Ventilation \u0026 Air Conditioning Systems",
        3.09158e+06,
        0.88815,
        1.32697,
        20.39582,
        "United States",
        8.5422e+07,
        8.6688e+07,
        "NASDAQ:AAON",
        3.79969,
        1.05484,
        2.0086e+07,
        0.8461,
        "Capital Goods",
        "AAON, Inc. (AAON) is engaged in the manufacture and sale of air-conditioning and heating equipment. The Company's products consist of rooftop units, chillers, packaged outdoor mechanical rooms, air handling units, makeup air units, energy recovery units, condensing units, self-contained units and coils. Its products serve the commercial, and industrial new construction and replacement markets. The Company's rooftop and condenser unit markets consist of units installed on commercial or industrial structures of over 10 stories in height. Its air handling units, self-contained units, chillers, packaged outdoor mechanical rooms and coils are applicable to all sizes of commercial and industrial buildings. The replacement market consists of products installed to replace existing units/components that are worn or damaged. Its operating subsidiaries are AAON, Inc. and AAON Coil Products, Inc. It markets its products to over 50 states in the United States and certain provinces in Canada.",
        0.83933,
        "http://www.aaon.com/",
        20.2925,
        0.30661120000000003,
        0.30661120000000003,
        1.395572e+09,
        1676,
        1.0806e+07,
        28.7,
        -1.01542
      ],
      "s": "NASDAQ:AAON"
    },
    {
      "f": [
        "null",
        14.38,
        0.31064,
        736,
        "USD",
        1,
        1.61508,
        "Banks - NEC",
        1.19651e+06,
        1.59078,
        "null",
        31.064,
        "United States",
        "null",
        3.1342e+07,
        "NASDAQ:ABTX",
        3.5417,
        1.65863,
        1.5822e+07,
        1.45435,
        "Financial",
        "Allegiance Bancshares, Inc. is a bank holding company. Through its subsidiary, Allegiance Bank (the Bank), the Company provides a range of commercial banking services primarily to Houston metropolitan area-based small to medium-sized businesses, professionals and individual customers. In addition to banking during normal business hours, the Company offers extended drive-in hours, automated teller machines (ATMs) and banking by telephone, mail and Internet. The Company also provides debit card services, cash management services and wire transfer services, and offers night depository, direct deposits, cashier's checks, letters of credit and mobile deposits. It also offers safe deposit boxes, automated teller machines, drive-in services and round the clock depository facilities. The Company maintains an Internet banking Website that allows customers to obtain account balances and transfer funds among accounts.",
        1.42923,
        "http://ir.allegiancebank.com/",
        "null",
        "null",
        "null",
        3.148924e+08,
        305,
        6.355e+06,
        28.282,
        -1.80361
      ],
      "s": "NASDAQ:ABTX"
    },
    {
      "f": [
        "null",
        15.69,
        "null",
        1063,
        "USD",
        1,
        -2.89837,
        "Mortgage REITs",
        7.320453e+07,
        -2.89837,
        0.21844,
        "null",
        "United States",
        6e+06,
        -9.52e+08,
        "NASDAQ:AGNC",
        "null",
        "null",
        5.26e+08,
        0.53643,
        "Services",
        "American Capital Agency Corp. is a real estate investment trust (REIT). The Company primarily invests on a leveraged basis in agency mortgage-backed securities (agency MBS). The Company's investments consist of residential mortgage pass-through securities and collateralized mortgage obligations (CMOs) for which the principal and interest payments are guaranteed by a government-sponsored enterprise, such as the Federal National Mortgage Association (Fannie Mae) and the Federal Home Loan Mortgage Corporation (Freddie Mac), or by the United States Government agency, such as the Government National Mortgage Association (Ginnie Mae) (collectively, GSEs). The Company also invests in other assets related to agency securities and approximately 10% of its assets in AAA non-agency and commercial mortgage-backed securities (collectively, AAA non-agency MBS). The Company is externally managed by American Capital AGNC Management, LLC, an affiliate of American Capital, Ltd.",
        0.53643,
        "https://www.agnc.com/",
        0.8273,
        "null",
        "null",
        6.454491e+09,
        0,
        -1.35e+08,
        20.08,
        -0.86426
      ],
      "s": "NASDAQ:AGNC"
    },
    {
      "f": [
        2.002618e+06,
        89.47,
        0.2854717,
        25924,
        "USD",
        1,
        8.61218,
        "Computer Hardware - NEC",
        7.7818255e+08,
        8.56216,
        1.13276,
        29.16455,
        "United States",
        4.2358e+10,
        7.3962e+10,
        "NASDAQ:AAPL",
        2.55567,
        11.02939,
        5.8217e+10,
        9.28039,
        "Technology",
        "Apple Inc. designs, manufactures and markets mobile communication and media devices, personal computers and portable digital music players and sells a variety of related software, services, peripherals, networking solutions and third-party digital content and applications. The Company's products and services include iPhone, iPad, Mac, iPod, Apple TV, a portfolio of consumer and professional software applications, the iOS and OS X operating systems, iCloud and a variety of accessory, service and support offerings. The Company offers a range of mobile communication and media devices, personal computing products and portable digital music players, as well as a variety of related software, services, peripherals, networking solutions and third-party hardware and software products. The Company's primary products include iPhone, iPad, Mac, iPod, iTunes, Mac App Store, iCloud, Operating System Software, Application Software and Other Application Software.",
        9.21688,
        "http://www.apple.com",
        -11.78656,
        0.39492849999999996,
        0.39492849999999996,
        5.629845e+11,
        110000,
        7.796e+09,
        123.82,
        8.07903
      ],
      "s": "NASDAQ:AAPL"
    },
    {
      "f": [
        686500,
        2.4,
        -0.6989964999999999,
        16,
        "USD",
        1,
        -0.60973,
        "Bio Therapeutic Drugs",
        6.90177e+06,
        -0.61136,
        2.18206,
        -108.392,
        "United States",
        4.531e+06,
        -1.5259e+07,
        "NASDAQ:ACRX",
        6.54547,
        -0.50598,
        -2.1409e+07,
        -0.55077,
        "Healthcare",
        "AcelRx Pharmaceuticals, Inc. is a pharmaceutical company focused on the development and commercialization of therapies for the treatment of moderate-to-severe acute pain. The Company operates through the segment, which includes development and commercialization of product candidates for the treatment of pain. Its lead product candidates include ARX-04, Zalviso, which utilize sublingual sufentanil, delivered through a non-invasive route of administration, and ARX-03. ARX-04 is meant for the treatment of moderate-to-severe acute pain to be administered by a healthcare professional to a patient in medically supervised settings. Zalviso is meant for the management of moderate-to-severe acute pain in hospitalized adult patients. ARX-03 provides mild sedation, anxiety reduction and pain relief for patients undergoing painful procedures in a physician's office. It also includes ARX-02, which is meant for the treatment of patients who suffer from breakthrough pain (BTP) due to cancer.",
        -0.55077,
        "http://www.acelrx.com",
        -11.85185,
        0.0380756,
        0.0380756,
        1.617647e+08,
        36,
        -1.1092e+07,
        5.88,
        19
      ],
      "s": "NASDAQ:ACRX"
    },
    {
      "f": [
        5208.333,
        5.21,
        -254.39880000000002,
        "null",
        "USD",
        1,
        -1.86437,
        "Biotechnology \u0026 Medical Research - NEC",
        1.6370149999999998e+07,
        -1.86437,
        1.44741,
        -25241.8,
        "United States",
        0,
        -6.323329e+07,
        "NASDAQ:ADXS",
        1522.245,
        -1.66864,
        -2.593032e+07,
        -1.67811,
        "Healthcare",
        "Advaxis, Inc. is a clinical-stage biotechnology company. The Company's immunotherapies are based on a platform technology that utilizes live attenuated Listeria monocytogenes (Lm or Listeria) bioengineered to secrete antigen/adjuvant fusion proteins. It is focused on the discovery, development and commercialization of Lm-LLO cancer immunotherapies. The Company's immunotherapy candidates include Axalimogene filolisbac, ADXS-PSA and ADXS-HER2. Axalimogene filolisbac (ADXS-HPV) is a lead Lm-LLO immunotherapy product candidate for the treatment of human papilloma virus (HPV) associated cancers. ADXS-PSA is an Lm-LLO immunotherapy product candidate designed to target the Prostate Specific Antigen (PSA) associated with prostate cancer. ADXS-HER2 is an Lm-LLO immunotherapy product candidate designed for the treatment of Human Epidermal Growth Factor Receptor 2 (HER2) expressing cancers, including human and canine osteosarcoma, breast, gastric and other cancers.",
        -1.67811,
        "http://www.advaxis.com",
        -30.09464,
        "null",
        "null",
        3.805613e+08,
        48,
        -1.552245e+07,
        22.2,
        37.98257
      ],
      "s": "NASDAQ:ADXS"
    },
    {
      "f": [
        30080.64,
        12.02,
        -31.742089999999997,
        38,
        "USD",
        1,
        -2.82067,
        "Biotechnology \u0026 Medical Research - NEC",
        5.31745e+06,
        -2.82067,
        "null",
        -3150.349,
        "United States",
        175000,
        -5.8697e+07,
        "NASDAQ:ADMS",
        167.6866,
        -2.83623,
        -4.8609e+07,
        -2.86025,
        "Healthcare",
        "Adamas Pharmaceuticals, Inc. is a pharmaceutical company. The Company is focused on the development and commercialization of therapeutics targeting chronic disorders of the central nervous systems (CNS). Its segment focuses on the development and commercialization of therapeutics targeting chronic disorders of the central nervous system. Its ADS-5102 is an extended-release version of amantadine that is intended for once daily administration at bedtime. It is developing ADS-8704, which is a fixed-dose combination of its controlled release version of memantine and donepezil for the treatment of moderate to severe dementia related to Alzheimer's disease. Its ADS 8902, a triple combination antiviral drug therapy for influenza. It also offers Namzaric (memantine hydrochloride extended-release and donepezil hydrochloride) capsules (formerly MDX-8704) and Namenda XR (memantine hydrochloride) extended release capsules.",
        -2.86025,
        "http://adamaspharma.com/",
        -41.55214,
        "null",
        "null",
        3.127355e+08,
        62,
        -1.3828e+07,
        31.84,
        1.54494
      ],
      "s": "NASDAQ:ADMS"
    },
    {
      "f": [
        "null",
        4.9666,
        0.0062439999999999996,
        2350,
        "USD",
        1,
        0.5755,
        "Banks - NEC",
        433970,
        0.5755,
        0.29001,
        0.6244,
        "United States",
        "null",
        6.085e+06,
        "NASDAQ:ACFC",
        3.05808,
        0.55967,
        396000,
        0.50122,
        "Financial",
        "Atlantic Coast Financial Corporation is a thrift holding company. The Company, through its subsidiary, Atlantic Coast Bank (the Bank), a federally chartered and insured stock savings bank supervised by the Office of the Comptroller of the Currency (the OCC), serves the Northeast Florida, Central Florida and Southeast Georgia markets. The Bank focuses on attracting deposits and investing those funds primarily in loans, including commercial real estate loans, consumer loans, first mortgages on owner-occupied, one- to four-family residences and home equity loans. Additionally, the Bank invests funds in multi-family residential loans, commercial business loans, and commercial and residential construction loans. The Bank originates commercial real estate loans and commercial and industrial loans with small to mid-size businesses for the purposes of purchasing real estate and inventory, financing equipment, and providing working capital.",
        0.50122,
        "https://www.atlanticcoastbank.net/",
        21.21212,
        "null",
        "null",
        9.305437e+07,
        186,
        1.524e+06,
        6.75,
        -0.16639
      ],
      "s": "NASDAQ:ACFC"
    },
    {
      "f": [
        1.962428e+06,
        11.92,
        0.5802651,
        66000,
        "USD",
        1,
        -1.13224,
        "Investment Management \u0026 Fund Operators - NEC",
        4.795419e+07,
        -1.14108,
        1.26774,
        -27.68778,
        "United States",
        1.62e+08,
        3.94e+08,
        "NASDAQ:ACAS",
        5.30252,
        "null",
        2.7e+08,
        -0.69985,
        "Financial",
        "American Capital, Ltd. (American Capital) is a global asset manager and private equity firm. American Capital, both directly and through its asset management business, originates, underwrites and manages investments in middle market private equity, leveraged finance, real estate, energy and structured products. It primarily invests in senior and mezzanine debt and equity in buyouts of private companies sponsored by the Company (American Capital One Stop Buyouts) or sponsored by other private equity funds and provide capital directly to early-stage and mature private and small public companies (Sponsor Finance and Other Investments). It also invests in first and second lien floating rate loans to the United States-based companies (Senior Floating Rate Loans or SFRL) and structured finance investments (Structured Products), including collateralized loan obligation (CLO) securities and commercial mortgages, and commercial mortgage backed securities (CMBS).",
        -0.69985,
        "http://www.americancapital.com",
        26.16679,
        0.8703976,
        0.8703976,
        3.60041e+09,
        307,
        -8e+07,
        16.55,
        0.18226
      ],
      "s": "NASDAQ:ACAS"
    },
    {
      "f": [
        200146.1,
        0.3036,
        -0.23024270000000002,
        120,
        "USD",
        1,
        -0.45525,
        "Electrical Components \u0026 Equipment - NEC",
        1.9669e+06,
        -0.45525,
        0.65544,
        -24.03267,
        "United States",
        1.073e+07,
        -9.208e+06,
        "NASDAQ:ACPW",
        0.20571,
        -0.2361,
        -2.39e+06,
        -0.2792,
        "Technology",
        "Active Power, Inc. designs, manufactures, sells and services flywheel-based uninterruptible power supply (UPS) products that use kinetic energy to provide short-term power as a cleaner alternative to electro-chemical battery-based energy storage. The Company also designs, manufactures, sells and services modular infrastructure solutions (MIS) that integrate critical power components into a pre-packaged, purpose built enclosure. The Company's UPS products and solutions deliver continuous conditioned power during short-term power disturbances and outages, such as voltage sags and surges, and provide ride-through power in the event of a utility failure, supporting operations until utility power is restored or a longer term alternative power source, such as a diesel generator, is started. Its flywheel-based UPS products are sold under the brand name, CleanSource UPS. The Company's MIS products include CleanSource PowerHouse and modular IT.",
        -0.2792,
        "http://www.activepower.com/",
        -80.29798,
        0.24194649999999998,
        0.24194649999999998,
        9.01679e+06,
        219,
        -1.837e+06,
        2.1,
        5.40394
      ],
      "s": "NASDAQ:ACPW"
    },
    {
      "f": [
        381934.5,
        71.27,
        0.2239732,
        1215,
        "USD",
        1,
        1.78783,
        "Application Software",
        5.037083e+07,
        1.77042,
        1.24579,
        21.70466,
        "United States",
        1.398709e+09,
        1.526905e+09,
        "NASDAQ:ADBE",
        9.01977,
        1.91067,
        1.284566e+09,
        1.26222,
        "Technology",
        "Adobe Systems Incorporated is a software company. The Company offers products and services used by professionals, marketers, knowledge workers, application developers, enterprises and consumers for creating, managing, delivering, measuring, optimizing and engaging with compelling content and experiences. It operates through three segments: Digital Media, Digital Marketing, and Print and Publishing. Its Digital Media segment provides tools and solutions that enable individuals, small and medium businesses and enterprises to create, publish, promote and monetize their digital content. Its Digital Marketing segment provides solutions and services for how digital advertising and marketing are created, managed, executed, measured and optimized. Its Print and Publishing segment addresses market opportunities ranging from the diverse authoring and publishing needs of technical and business publishing to its legacy type and original equipment manufacturer (OEM) printing businesses.",
        1.24132,
        "http://www.adobe.com/",
        17.99754,
        0.8505531999999999,
        0.8505531999999999,
        4.786084e+10,
        13893,
        2.44074e+08,
        100.56,
        -1.8997
      ],
      "s": "NASDAQ:ADBE"
    },
    {
      "f": [
        270182.7,
        33.5,
        -2.439589,
        21,
        "USD",
        1,
        -3.61904,
        "Bio Therapeutic Drugs",
        1.6080390000000002e+07,
        -3.61904,
        "null",
        -241.9552,
        "United States",
        3.1281e+07,
        -1.32882e+08,
        "NASDAQ:AGIO",
        30.29803,
        -3.05617,
        -9.7113e+07,
        -3.14545,
        "Healthcare",
        "Agios Pharmaceuticals, Inc. is a biopharmaceutical company. The Company is engaged in the discovery and development of orally available small molecule medicines for the treatment of cancer and rare genetic disorders (RGDs), which are a subset of orphan genetic metabolic diseases. Its cancer product candidates are AG-221 and AG-120, which targets mutated isocitrate dehydrogenase 2 and 1, or IDH2 and IDH1, respectively, and AG-881, which targets both mutated IDH1 and mutated IDH2. The lead product candidate in its RGD programs, AG-348, targets pyruvate kinase-R for the treatment of pyruvate kinase deficiency. Its AG-221 is an orally available, selective, inhibitor of the mutated IDH2 protein indicated for the treatment of patients with cancers. Its AG-120 is an orally available, selective, inhibitor of the mutated isocitrate dehydrogenase (IDH1) protein for the treatment of patients with cancers. AG-881 is an orally available, selective, brain-penetrant, pan-IDH mutant inhibitor.",
        -3.14545,
        "http://www.agios.com/",
        -59.51673,
        "null",
        "null",
        1.702688e+09,
        208,
        -2.3198e+07,
        115.39,
        2.20806
      ],
      "s": "NASDAQ:AGIO"
    },
    {
      "f": [
        "null",
        7.26,
        -0.4792022,
        "null",
        "USD",
        1,
        -0.89209,
        "Bio Therapeutic Drugs",
        1.141446e+07,
        -0.89328,
        "null",
        -71.61415,
        "United States",
        4.0300000000000005e+06,
        -3.1417e+07,
        "NASDAQ:ADRO",
        13.85465,
        -0.86285,
        1.52636e+08,
        -0.87703,
        "Healthcare",
        "Aduro Biotech, Inc. is a clinical-stage immunotherapy company. The Company is focused on the discovery, development and commercialization of therapies that transform the treatment of various diseases. The Company has developed approximately three technology platforms, which include Live, Attenuated, Double-Deleted (LADD), Stimulator of Interferon Genes (STING) Pathway Activator and B-select monoclonal antibodies. Its LADD product candidates include CRS-207, ADU-623, ADU-741 and ADU-214. Its STING Activator product candidates include ADU-S100. Its LADD technology platform is engineered to express tumor-associated antigens to induce specific and targeted immune responses. Its STING Pathway Activator platform is designed to activate the intracellular STING receptor, resulting in a tumor-specific immune response. Its B-select monoclonal antibody platform includes various immune modulating assets in research and preclinical development.",
        -0.87703,
        "http://www.adurobiotech.com/",
        -42.66455,
        "null",
        "null",
        9.342883e+08,
        50,
        -2.8827e+07,
        34.95,
        1.40252
      ],
      "s": "NASDAQ:ADRO"
    },
    {
      "f": [
        131933.1,
        49.77,
        0.14650470000000002,
        381,
        "USD",
        1,
        1.83806,
        "Healthcare Facilities \u0026 Services - NEC",
        1.917172e+07,
        1.83006,
        0.74383,
        8.53871,
        "United States",
        7.56548e+08,
        4.98488e+08,
        "NASDAQ:ACHC",
        1.9133,
        2.55684,
        -6.2266e+07,
        1.63568,
        "Healthcare",
        "Acadia Healthcare Company, Inc. is a provider of behavioral healthcare services. The Company operates in two segments: U.S. Facilities and U.K. Facilities. The Company develops and operates inpatient psychiatric facilities, residential treatment centers, group homes, substance abuse facilities and facilities providing outpatient behavioral healthcare services to serve the behavioral health and recovery needs of communities throughout the United States, the United Kingdom and Puerto Rico. The Company operates approximately 260 behavioral healthcare facilities with over 9,900 beds in over 40 states, the United Kingdom and Puerto Rico. Its U.S. facilities and services are classified into categories, which include acute inpatient psychiatric facilities; specialty treatment facilities; residential treatment centers and outpatient community-based services. It provides inpatient services through mental health hospitals and care homes in the United Kingdom.",
        1.62836,
        "http://www.acadiahealthcare.com",
        -35.9262,
        "null",
        "null",
        4.493225e+09,
        17800,
        5.6445e+07,
        85.62,
        -5.04341
      ],
      "s": "NASDAQ:ACHC"
    },
    {
      "f": [
        244629.6,
        17.32,
        -0.0153666,
        2028,
        "USD",
        1,
        -0.11131,
        "IT Services \u0026 Consulting - NEC",
        1.010996e+07,
        -0.11131,
        1.21781,
        -2.38564,
        "United States",
        8.50088e+08,
        1.12161e+08,
        "NASDAQ:ACXM",
        2.10303,
        0.98968,
        5.7662e+07,
        -0.11142,
        "Technology",
        "Acxiom Corporation (Acxiom) is a technology and enablement services company. The Company operates through three business segments: Marketing Services, Audience Solutions, and Connectivity. The Company's Marketing Services segment helps clients to unify data at individual level. The Audience Solutions segment helps clients to validate the accuracy of their people-based data, enhance it with additional insight and keep it up to date, enabling clients to reach desired audiences with relevant messages. The Connectivity segment activates data and makes it portable across the open marketing ecosystem. The Company serves a global client base from locations in the United States, Europe and the Asia-Pacific region. The Company's client base includes organizations in these regions across industry verticals, including financial, insurance and investment services, automotive, retail, telecommunications, healthcare, travel, entertainment, non-profit and government.",
        -0.11142,
        "http://www.acxiom.com",
        29.83051,
        0.4254924,
        0.4254924,
        1.787758e+09,
        3475,
        6.703e+06,
        23.57,
        -0.43328
      ],
      "s": "NASDAQ:ACXM"
    },
    {
      "f": [
        143668.8,
        15.33,
        0.0340467,
        2540,
        "USD",
        1,
        0.78201,
        "Home Healthcare Services",
        865340,
        0.77135,
        0.59746,
        2.9968,
        "United States",
        1.00927e+08,
        1.9002e+07,
        "NASDAQ:ADUS",
        0.67783,
        1.43623,
        1.893e+06,
        1.03341,
        "Healthcare",
        "Addus HomeCare Corporation is a provider of home and community-based personal care services, which are provided primarily in the home, and is focused on the dual eligible (Medicare/Medicaid) population. The Company's services include non-medical care, such as personal care, home support services and adult day care. The Company provides these services on a long-term, continuous basis, with an average duration of over 20 months per consumer. The Company's services are primarily provided to older adults and younger disabled persons in consumers' homes on an as-needed, hourly basis. The Company's personal care services include bathing, grooming, oral care, skincare, assistance with feeding and dressing, and medication reminders. The Company's adult day centers offer services, such as social activities, transportation services to and from the centers, the provision of meals and snacks, personal care and therapeutic activities, such as exercise and cognitive interaction.",
        1.01466,
        "http://www.addus.com/",
        -19.07275,
        0.2639926,
        0.2639926,
        2.457951e+08,
        2524,
        2.6e+06,
        38.08,
        13.77848
      ],
      "s": "NASDAQ:ADUS"
    },
    {
      "f": [
        976566.4,
        23.85,
        -0.0031907000000000003,
        26,
        "USD",
        1,
        -0.10539,
        "Bio Therapeutic Drugs",
        1.138328e+07,
        -0.11569,
        1.45748,
        -1.49676,
        "United States",
        1.27458e+08,
        1.9351e+07,
        "NASDAQ:ACOR",
        2.20081,
        0.59765,
        3.1415e+07,
        0.26185,
        "Healthcare",
        "Acorda Therapeutics, Inc. is a biopharmaceutical company. The Company is engaged in the identification, development and commercialization of therapies that restore function and recovers the lives of people with neurological disorders. Its commercial products include Ampyra, Fampyra, Zanaflex Capsules and a generic version of the capsules, Zanaflex tablets and Qutenza. Its research and development programs include CVT-301, Dalfampridine, Plumiaz, Neuregulin Program, Remyelinating Antibodies Program, CVT-427 and Chondroitinase Program. Its Ampyra is an oral drug for the treatment to improve walking in patients with multiple sclerosis. Zanaflex Capsules and tablets are used as short-acting drugs for the management of spasticity. Qutenza is a dermal patch for the management of neuropathic pain associated with post-herpetic neuralgia. Its pipeline of neurological therapies addresses a range of disorders, including Parkinson's disease, chronic post-stroke walking deficits and migraine.",
        0.2535,
        "http://www.acorda.com",
        -28.15199,
        0.8059231,
        0.8059231,
        1.149839e+09,
        535,
        -1.8279e+07,
        43.63,
        -3.66654
      ],
      "s": "NASDAQ:ACOR"
    },
    {
      "f": [
        179021.3,
        1.76,
        -0.1252674,
        49,
        "USD",
        1,
        -0.73961,
        "Electrical Components \u0026 Equipment - NEC",
        100680,
        -0.7399,
        0.3171,
        -12.78346,
        "United States",
        8.298e+06,
        -4.392e+06,
        "NASDAQ:AETI",
        0.50265,
        -0.2485,
        1.704e+06,
        -0.35697,
        "Technology",
        "American Electric Technologies, Inc. is a provider of power delivery solutions to the global energy industry. The Company serves a range of markets, such as power generation and distribution, oil and gas, and marine and industrial. It provides power delivery solutions for the power generation and distribution market sectors. It works with turbine manufacturers, engine-generator manufacturers and dealers, engineering, procurement and construction (EPC) firms, and high voltage service companies to provide electric power delivery products and solutions. It designs, manufactures, commissions and maintains its equipment for implementation in base-load, peaking power, cogeneration and substation transmission facilities across the world. It provides power delivery solutions for the upstream, midstream and downstream oil and natural gas sectors. Its industrial markets include non-oil and gas industrial markets, such as steel, paper, heavy commercial, and other non-oil and gas applications.",
        -0.35697,
        "http://www.aeti.com",
        -43.33333,
        0.1045401,
        0.1045401,
        2.114652e+07,
        235,
        -2.883e+06,
        4.75,
        -0.39063
      ],
      "s": "NASDAQ:AETI"
    }
  ]
}